[
    {
        "position": "Information Technologist (IT) Manager",
        "company": "Mental Health Association of San Francisco",
        "description": "We only accept applications through our online portal:APPLY HERE: https://mentalhealthsf.formstack.com/forms/information_technologist_it_managerAbout Mental Health Association of San Francisco (MHASF):MHASF is a mental health peer-run nonprofit located in downtown San Francisco and serving people and agencies across the Bay Area since 1947. As mental health consumers ourselves, we center the lived expertise of people with mental health challenges in our advocacy, education, and support programs, and believe that dignity and recovery in mental health are something everyone can experience. Our staff is dedicated to creating spaces for learning and healing around stigmatized and under-resourced areas in mental health—hoarding and cluttering behavior; post-hospitalization peer support; mental health and nutrition; peer mental health workforce development, and much more.Overview of the Position:Under the direction of the Executive Manager, the IT Manager is responsible for the management, strategy and execution of IT infrastructure, architecture and networks for Mental Health Association of San Francisco (MHASF). A specialization in IT with the proven ability in management information systems, database management technology, computer system analysis and organizational behavior to solve real-world technology challenges is highly desirable. The proven ability to evaluate new technologies for competitive advantages and the application of contemporary business principles to a non-profit mission driven organization is integral to the successful candidate for this position. Technical expertise along with leadership and interpersonal communication skills, and a background in business management from a candidate who can analyze workflows, delegate goals, develop and maintain high performance standards, implement and monitor new projects and make hiring decisions is competitively sought.TOP 3 RESPONSIBILITIES:Ensure that MHASF IT infrastructure will aid in the fulfillment of our peer program service goals and contract deliverablesSupport the continued technological development of department staff, volunteers, and internsServe in a broad capacity, managing software and/or hardware installation, troubleshooting systems issues, and consulting with leadership to assess the role IT plays in our organization.Core Responsibilities:Oversee technical projects in alignment with organizational goalsDirect the effective delivery of networks, development, and disaster recovery systems and processesResearch and recommend new software and hardware products, finding solutions to manage business activitiesSupport an organizational team of 100+ employees, working closely with management to accept, troubleshoot, triage, and find solutions for emergent IT needsManage existing relationships and contracts with vendors, including negotiating service requests, project timelines and cross-team workflowPrepare financial budgets and present proposals for capital projects to senior managementIdentify new market opportunitiesLead efforts to improve IT processes, train system users and provide instruction manualsBlend an understanding of business needs with an application of technology to design solutions that support organizational efficiencyQuick to adopt new technology and eager to help others understand and apply itTECHNICAL SUMMARY:Experience setting up switches, firewalls, and Experience with email communication systems routers with Office 365Experience with Microsoft Server Administration including Active Managerial and Group PolicyStrong understanding of common networking concepts DNS, TCP/IP, DHCPHelpdesk or IT Services experienceSetup and maintenance of all computer and peripheral hardwareInbound Call Center Management including:ACD softwareCustomer Relationship Management Application (CRM) integration VoIP System Management and CustomizationResource Database OptimizationPLATFORMS: Windows Server 2016 and Windows 10 Pro, Mac OSADDITIONAL DUTIES:Assess existing technology, tools and systems and continuously update them to achieve technical and business requirements while respecting and understanding users’ needsSupport computer system builds with flowcharts and organizational support which maintain deadlines, business standards and budgets on installationsEstablish memory, speed and other technical specifications, monitor network activity and conduct root cause analysis minimizing digital disruptionsUnderstand system performance and efficiency through detailed analysis and testing through the running and management of reportsCreate and care for operational applications, development and security and storage of MHASF’s HIPAA encrypted dataThe above list is meant to be representative, not comprehensive, and is subject to change depending on the needs and priorities of MHASF.REQUIRED QUALIFICATIONS:Experience supporting a call center and remote work staff, on mobile networks with cybersecurity and cloud computing using HIPAA standardsDeep familiarity with mental health peer support, recovery resources, consumer empowerment/advocacy and peer workforce developmentGraduate degree in Information Technology, Computer Science or related field is required or 10 years of deep experience5 to 7 years verifiable experience in a related fieldPossess industry expertise to assess IT systems effectively while being open to continued formal and/or informal industry trainingFamiliarity with healthcare fields, such as healthcare technology i.e. telehealthCollaborative team working style with ability and willingness to learn from others, takefeedback, and make adjustments to communication and behaviorExperience taking initiative to self-educate about unfamiliar subjects or conceptsAffirmative and accepting approach toward people from diverse backgrounds and experiences and a commitment to upholding the mission, vision, and values of MHASFPREFERRED QUALIFICATIONS:Experience working with a State or federally contracted call center.Experience managing IT needs of a nonprofit or mental health warm or hotline.Experience managing rapid expansion.We only accept applications through our online portal:APPLY HERE: https://mentalhealthsf.formstack.com/forms/information_technologist_it_manager ",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/22fb6529a1d7423aa40a83befb24fedf-information-technologist-it-manager-mental-health-association-of-san-francisco-san-francisco"
    },
    {
        "position": "Curriculum Developer",
        "company": "Black Girls CODE",
        "description": "ABOUT BLACK GIRLS CODESince 2011 Black Girls CODE (BGC) has been devoted to showing the world that black girls can code, and do so much more. By reaching out to the community through workshops and after school programs, Black Girls CODE introduces computer programming and technology to girls from underrepresented communities in technology areas such as web design, robotics, gaming, mobile app development and more. By cultivating the next generation of coders we hope to grow the number of women of color in technology and give underrepresented girls a chance to become the future leaders in technology and the masters of their technological worlds. We thrive on working in a collaborative, fast-paced environment. We represent a diversity of backgrounds, a wealth of experience and a lot of fun.POSITION SUMMARY: The Curriculum Developer will develop curriculum and lesson plans to support all Black Girls CODE programs and workshops. Our Curriculum Developer will work closely with the education team to develop an organizational curricular platform which includes course development, implementation, evaluation, research, and continuous improvement of the curricula models. S/he will support the development and implementation of chapter educational program initiatives and work with instructors and staff as needed in a high-performance non-profit environment. The Curriculum Developer will observe, supervise, evaluate and support BGC in the development and implementation of our curriculum. Ensure that there is a sound scope and sequence of curriculum and integration within our primary areas of focus.RESPONSIBILITIES:Develop and design detailed curriculum plans across various technical subjects; ensure that curriculum tools meet program goals and student learning objectivesScope, design, and develop curriculum content that is both engaging and informative for our tech divas and alumnaeEnsure there is curricula alignment and adequate curriculum materials and equipment available and accessible across all sites and locationsWork collaboratively with the Education/Curriculum team to develop a curricular platform that meets organizational objectives and that will scale across all of our chapter programs and by varying age demographicsDesign and write learning support tools such as, but not limited to Powerpoint presentations, facilitator/instructor guides, participant guides, quick reference guides, and other student learning tools as course accompaniments.QUALIFICATIONS:This is an extraordinary opportunity to be part of a small and growing team in a dynamic startup environment. The position offers great potential for learning and affords real opportunity to have a tangible impact on communities across the country. The successful candidate will have experience with developing, launching and managing computer science or other related STEM curricula in a K-12, nonprofit environment and/or corporate environment. Only candidates with a background in engineering, science, or technology will be considered for this role. Direct experience working with youth (or experience coordinating programs for youth) is a plus. Professional software development experience is a plus but not a requirement.REQUIREMENTS:Minimum of 3-5 years experience as CS educator, software engineer, or designer OR 4 years of related university training in a CS or Education discipline. Prior non-profit or start-up work experience is preferred.Exceptional organizational skills and ability to balance multiple priorities in a changing environmentEffective writing skills and proven ability to develop lessons plans and instructional toolsStrong experience and outgoing personality in fostering relationships and partnerships with community organizations and corporationsCreativity- able to think of new ways to engage studentsStrong interpersonal skills and ability to work well in a team environmentExceptional communication and presentation skillsIntegrity, maturity, credibility, and a demonstrated commitment to Black Girls CODE's missionBA/BS/MS in Computer Science or related technical field is ideal and preferred; however relevant professional experience will be considered.Position opens immediately.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/842aea1da8a441a5b3c29f5053f7ce3e-curriculum-developer-black-girls-code-oakland"
    },
    {
        "position": "Middle School Computer Science Teacher",
        "company": "Summit Public Schools",
        "description": "Expeditions Teacher Site-Based (Middle School) - 2020-2021at Summit Public Schools (View all jobs)California Bay AreaSite-Based Expeditions Teacher - 2020-2021Current vacancies: Middle School STEM - Sunnyvale, CAMiddle School Visual Art - Sunnyvale, CAMiddle School Computer Science - Sunnyvale, CAWho We AreWhat if all students graduated high school with the knowledge, skills, and habits they need to lead a fulfilled life?  This is the question that guides our mission at Summit Public Schools. Summit is a leading network of public schools that prepare a diverse student population for success in a four-year college and to be thoughtful, contributing members of society. We operate 15 schools serving over 4,500 students in the Bay Area and Washington state. Historically, 98 percent of Summit graduates are accepted to four-year colleges, and Summit graduates complete college at double the national average.We need exceptional, diverse, and mission-aligned teachers to join our team to help prepare our students for a fulfilled life. Join us!Summit’s Expeditions Program:The areas of study, or clusters, which students can explore include Leadership & Social Change, Health and Wellness, Media Studies, Technology, Business, and Art, Design & Engineering. Over the course of their time at Summit, students have the opportunity to explore passions across these clusters or to craft a pathway of deep study that may lead to an internship or independent study.In particular, our middle and high schools are interested in teachers who can offer courses in one of the following areas:Computer ScienceVisual Art STEM EducationThe Expeditions team seeks teachers with a passion for these areas who can design and execute courses in that cluster based on the teacher’s experience and expertise, aimed at middle and high school students. Using the Framework for 21st Century Learning (P21. 2015, May), students should master the skills, knowledge and expertise to succeed in work and life in the 21st century.The role of the Expeditions teacher is to empower students to discover and deepen their passions, as well as serve as a mentor to a group of students they will follow throughout their time in middle and high school. We believe that connecting to one’s passion is crucial for success in college and a career, as this allows students to make better choices about “best fit” colleges based on an understanding of the course of study for possible careers. They can begin college with a career goal in mind that is connected to their passion, and can immediately apply their decision-making and self-direction skills to continuously set and achieve goals. With their own passions and fields of study as expertise, Expeditions Teachers execute this vision by doing the following:Summit Expeditions teachers design and teach a high-quality, challenging, project-based curriculum that guides students towards explorations of potential passions.Summit Expeditions teachers facilitate learning experiences which lead students through deep exploration of fields of study connected to potential majors, hobbies and careers.Summit Expeditions teachers design and guide students through real-life experiences in the field, through guest speakers, field trips, and other connections to community groups.Collaboration & Professional Development - Twice a week, teachers participate in all-faculty after-school meetings where community decisions are made, professional development takes place, and faculty collaborates as a grade-level team or subject-level team. Mentor Time - Build deep relationships and a sense of community when teachers meet with their small group of mentees daily for their entire time at Summit. Daily, teachers meet with their mentor groups, work on Habits of Success as a group, and check in one-on-one with their mentees. Mentors coach and advocate for their mentees both inside and outside of the classroom, and strive to support them as they develop their sense of purpose as they become self-directed learners.See sample teacher schedules here. A student school day is around 8-8:30am to 3-3:30pm, depending on the specific school. Teachers stay until 5pm three days per week. At Summit Public Schools, you are joining a community committed to excellence and continual growth. We prioritize developing leaders from within and have invested in multiple career pathway programs for our teachers and school leaders. If you are looking for the opportunity to drive transformative change in a diverse community of learners and contribute to reimagining what schools should be, we encourage you to apply.What You NeedCommitment to uphold Summit’s values, and the belief that all children deserve a rigorous and equitable education that prepares them for college and for lifeTeaching Credential in California, Washington or another US stateBachelor’s Degree (a Master’s Degree in Education is preferred, but not required)Clear health and background checkTeaching experience in your subject preferred, but not requiredWho You AreYou want to be a world-class project-based learning teacher You thrive while collaborating and are excited to work with mission-aligned, high-performing colleagues. You find positivity in shared successes.You’re excited to teach Summit’s common curriculum and assessment system, which was designed for teachers and by teachers in partnership with learning scientists. You care deeply about working in intentionally heterogeneous schools and are ready to support all diverse students to reach a fulfilled lifeYou’re eager to engage in professional development and be developed as a practitioner in a network that is committed to continuous improvement.You have a growth mindset and see feedback as a positiveYou are passionate about serving as a mentor and advocate for a group of students that you’ll follow year to year. You’re open to having hard conversations to support students. What You GetSummit offers competitive salaries and benefit options, including covering 75% of the health, dental, and vision plan costs. We fully cover life and disability insurance. We have a “take what you need” PTO policy, 11 paid holidays, 4 weeks of vacation during the year, and a summer break. We value our teachers’ Summit experience, offering stipends for teachers who have been with us for three or more years and helping teachers grow with us through designated time for paid professional development and regular coaching.Summit Public Schools does not discriminate in any programs or activities on the basis of sex, race, creed, religion, color, national origin, age, veteran or military status, sexual orientation, gender expression or identity, disability, or the use of a trained dog guide or service animal and provides equal access to all programs. People from all diverse backgrounds are strongly encouraged to apply. Spanish language proficiency is a plus.We don't just encourage diversity and inclusion—we believe it's a requirement for us to be successful in our mission of helping all children succeed. Since we serve a diverse-by-design community of schools, educators, parents, and students, we need our team members to bring a broad range of lived experiences to the table with them. This is the only way we can ensure we are staying close to the work and building an authentic relationship with the people we serve.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/88363384395d439c8f50e6b2f616c10a-middle-school-computer-science-teacher-summit-public-schools-sunnyvale"
    },
    {
        "position": "Middle School Computer Science Teacher",
        "company": "Summit Public Schools",
        "description": "Site-Based Expeditions Teacher - 2020-2021Current vacancies: Middle School STEM - Sunnyvale, CAMiddle School Visual Art - Sunnyvale, CAMiddle School Computer Science - Sunnyvale, CAWho We AreWhat if all students graduated high school with the knowledge, skills, and habits they need to lead a fulfilled life?  This is the question that guides our mission at Summit Public Schools. Summit is a leading network of public schools that prepare a diverse student population for success in a four-year college and to be thoughtful, contributing members of society. We operate 15 schools serving over 4,500 students in the Bay Area and Washington state. Historically, 98 percent of Summit graduates are accepted to four-year colleges, and Summit graduates complete college at double the national average.We need exceptional, diverse, and mission-aligned teachers to join our team to help prepare our students for a fulfilled life. Join us!Summit’s Expeditions Program:The areas of study, or clusters, which students can explore include Leadership & Social Change, Health and Wellness, Media Studies, Technology, Business, and Art, Design & Engineering. Over the course of their time at Summit, students have the opportunity to explore passions across these clusters or to craft a pathway of deep study that may lead to an internship or independent study.In particular, our middle and high schools are interested in teachers who can offer courses in one of the following areas:Computer ScienceVisual Art STEM EducationThe Expeditions team seeks teachers with a passion for these areas who can design and execute courses in that cluster based on the teacher’s experience and expertise, aimed at middle and high school students. Using the Framework for 21st Century Learning (P21. 2015, May), students should master the skills, knowledge and expertise to succeed in work and life in the 21st century.The role of the Expeditions teacher is to empower students to discover and deepen their passions, as well as serve as a mentor to a group of students they will follow throughout their time in middle and high school. We believe that connecting to one’s passion is crucial for success in college and a career, as this allows students to make better choices about “best fit” colleges based on an understanding of the course of study for possible careers. They can begin college with a career goal in mind that is connected to their passion, and can immediately apply their decision-making and self-direction skills to continuously set and achieve goals. With their own passions and fields of study as expertise, Expeditions Teachers execute this vision by doing the following:Summit Expeditions teachers design and teach a high-quality, challenging, project-based curriculum that guides students towards explorations of potential passions.Summit Expeditions teachers facilitate learning experiences which lead students through deep exploration of fields of study connected to potential majors, hobbies and careers.Summit Expeditions teachers design and guide students through real-life experiences in the field, through guest speakers, field trips, and other connections to community groups.Collaboration & Professional Development - Twice a week, teachers participate in all-faculty after-school meetings where community decisions are made, professional development takes place, and faculty collaborates as a grade-level team or subject-level team. Mentor Time - Build deep relationships and a sense of community when teachers meet with their small group of mentees daily for their entire time at Summit. Daily, teachers meet with their mentor groups, work on Habits of Success as a group, and check in one-on-one with their mentees. Mentors coach and advocate for their mentees both inside and outside of the classroom, and strive to support them as they develop their sense of purpose as they become self-directed learners.See sample teacher schedules here. A student school day is around 8-8:30am to 3-3:30pm, depending on the specific school. Teachers stay until 5pm three days per week. At Summit Public Schools, you are joining a community committed to excellence and continual growth. We prioritize developing leaders from within and have invested in multiple career pathway programs for our teachers and school leaders. If you are looking for the opportunity to drive transformative change in a diverse community of learners and contribute to reimagining what schools should be, we encourage you to apply.What You NeedCommitment to uphold Summit’s values, and the belief that all children deserve a rigorous and equitable education that prepares them for college and for lifeTeaching Credential in California, Washington or another US stateBachelor’s Degree (a Master’s Degree in Education is preferred, but not required)Clear health and background checkTeaching experience in your subject preferred, but not requiredWho You AreYou want to be a world-class project-based learning teacher You thrive while collaborating and are excited to work with mission-aligned, high-performing colleagues. You find positivity in shared successes.You’re excited to teach Summit’s common curriculum and assessment system, which was designed for teachers and by teachers in partnership with learning scientists. You care deeply about working in intentionally heterogeneous schools and are ready to support all diverse students to reach a fulfilled lifeYou’re eager to engage in professional development and be developed as a practitioner in a network that is committed to continuous improvement.You have a growth mindset and see feedback as a positiveYou are passionate about serving as a mentor and advocate for a group of students that you’ll follow year to year. You’re open to having hard conversations to support students. What You GetSummit offers competitive salaries and benefit options, including covering 75% of the health, dental, and vision plan costs. We fully cover life and disability insurance. We have a “take what you need” PTO policy, 11 paid holidays, 4 weeks of vacation during the year, and a summer break. We value our teachers’ Summit experience, offering stipends for teachers who have been with us for three or more years and helping teachers grow with us through designated time for paid professional development and regular coaching.Summit Public Schools does not discriminate in any programs or activities on the basis of sex, race, creed, religion, color, national origin, age, veteran or military status, sexual orientation, gender expression or identity, disability, or the use of a trained dog guide or service animal and provides equal access to all programs. People from all diverse backgrounds are strongly encouraged to apply. Spanish language proficiency is a plus.We don't just encourage diversity and inclusion—we believe it's a requirement for us to be successful in our mission of helping all children succeed. Since we serve a diverse-by-design community of schools, educators, parents, and students, we need our team members to bring a broad range of lived experiences to the table with them. This is the only way we can ensure we are staying close to the work and building an authentic relationship with the people we serve.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/ef0b6066628742e4be4876373d3ca3ef-middle-school-computer-science-teacher-summit-public-schools-sunnyvale"
    },
    {
        "position": "Middle School Arts Teacher",
        "company": "Summit Public Schools",
        "description": "Expeditions Teacher Site-Based (Middle School) - 2020-2021at Summit Public Schools (View all jobs)California Bay AreaSite-Based Expeditions Teacher - 2020-2021Current vacancies: Middle School STEM - Sunnyvale, CAMiddle School Visual Art - Sunnyvale, CAMiddle School Computer Science - Sunnyvale, CAWho We AreWhat if all students graduated high school with the knowledge, skills, and habits they need to lead a fulfilled life?  This is the question that guides our mission at Summit Public Schools. Summit is a leading network of public schools that prepare a diverse student population for success in a four-year college and to be thoughtful, contributing members of society. We operate 15 schools serving over 4,500 students in the Bay Area and Washington state. Historically, 98 percent of Summit graduates are accepted to four-year colleges, and Summit graduates complete college at double the national average.We need exceptional, diverse, and mission-aligned teachers to join our team to help prepare our students for a fulfilled life. Join us!Summit’s Expeditions Program:The areas of study, or clusters, which students can explore include Leadership & Social Change, Health and Wellness, Media Studies, Technology, Business, and Art, Design & Engineering. Over the course of their time at Summit, students have the opportunity to explore passions across these clusters or to craft a pathway of deep study that may lead to an internship or independent study.In particular, our middle and high schools are interested in teachers who can offer courses in one of the following areas:Computer ScienceVisual Art STEM EducationThe Expeditions team seeks teachers with a passion for these areas who can design and execute courses in that cluster based on the teacher’s experience and expertise, aimed at middle and high school students. Using the Framework for 21st Century Learning (P21. 2015, May), students should master the skills, knowledge and expertise to succeed in work and life in the 21st century.The role of the Expeditions teacher is to empower students to discover and deepen their passions, as well as serve as a mentor to a group of students they will follow throughout their time in middle and high school. We believe that connecting to one’s passion is crucial for success in college and a career, as this allows students to make better choices about “best fit” colleges based on an understanding of the course of study for possible careers. They can begin college with a career goal in mind that is connected to their passion, and can immediately apply their decision-making and self-direction skills to continuously set and achieve goals. With their own passions and fields of study as expertise, Expeditions Teachers execute this vision by doing the following:Summit Expeditions teachers design and teach a high-quality, challenging, project-based curriculum that guides students towards explorations of potential passions.Summit Expeditions teachers facilitate learning experiences which lead students through deep exploration of fields of study connected to potential majors, hobbies and careers.Summit Expeditions teachers design and guide students through real-life experiences in the field, through guest speakers, field trips, and other connections to community groups.Collaboration & Professional Development - Twice a week, teachers participate in all-faculty after-school meetings where community decisions are made, professional development takes place, and faculty collaborates as a grade-level team or subject-level team. Mentor Time - Build deep relationships and a sense of community when teachers meet with their small group of mentees daily for their entire time at Summit. Daily, teachers meet with their mentor groups, work on Habits of Success as a group, and check in one-on-one with their mentees. Mentors coach and advocate for their mentees both inside and outside of the classroom, and strive to support them as they develop their sense of purpose as they become self-directed learners.See sample teacher schedules here. A student school day is around 8-8:30am to 3-3:30pm, depending on the specific school. Teachers stay until 5pm three days per week. At Summit Public Schools, you are joining a community committed to excellence and continual growth. We prioritize developing leaders from within and have invested in multiple career pathway programs for our teachers and school leaders. If you are looking for the opportunity to drive transformative change in a diverse community of learners and contribute to reimagining what schools should be, we encourage you to apply.What You NeedCommitment to uphold Summit’s values, and the belief that all children deserve a rigorous and equitable education that prepares them for college and for lifeTeaching Credential in California, Washington or another US stateBachelor’s Degree (a Master’s Degree in Education is preferred, but not required)Clear health and background checkTeaching experience in your subject preferred, but not requiredWho You AreYou want to be a world-class project-based learning teacher You thrive while collaborating and are excited to work with mission-aligned, high-performing colleagues. You find positivity in shared successes.You’re excited to teach Summit’s common curriculum and assessment system, which was designed for teachers and by teachers in partnership with learning scientists. You care deeply about working in intentionally heterogeneous schools and are ready to support all diverse students to reach a fulfilled lifeYou’re eager to engage in professional development and be developed as a practitioner in a network that is committed to continuous improvement.You have a growth mindset and see feedback as a positiveYou are passionate about serving as a mentor and advocate for a group of students that you’ll follow year to year. You’re open to having hard conversations to support students. What You GetSummit offers competitive salaries and benefit options, including covering 75% of the health, dental, and vision plan costs. We fully cover life and disability insurance. We have a “take what you need” PTO policy, 11 paid holidays, 4 weeks of vacation during the year, and a summer break. We value our teachers’ Summit experience, offering stipends for teachers who have been with us for three or more years and helping teachers grow with us through designated time for paid professional development and regular coaching.Summit Public Schools does not discriminate in any programs or activities on the basis of sex, race, creed, religion, color, national origin, age, veteran or military status, sexual orientation, gender expression or identity, disability, or the use of a trained dog guide or service animal and provides equal access to all programs. People from all diverse backgrounds are strongly encouraged to apply. Spanish language proficiency is a plus.We don't just encourage diversity and inclusion—we believe it's a requirement for us to be successful in our mission of helping all children succeed. Since we serve a diverse-by-design community of schools, educators, parents, and students, we need our team members to bring a broad range of lived experiences to the table with them. This is the only way we can ensure we are staying close to the work and building an authentic relationship with the people we serve.\t\t",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/be940a804844408e93b2ae10940acfc2-middle-school-arts-teacher-summit-public-schools-sunnyvale"
    },
    {
        "position": "Middle School STEM Teacher",
        "company": "Summit Public Schools",
        "description": "Expeditions Teacher Site-Based (Middle School) - 2020-2021at Summit Public Schools (View all jobs)California Bay AreaSite-Based Expeditions Teacher - 2020-2021Current vacancies: Middle School STEM - Sunnyvale, CAMiddle School Visual Art - Sunnyvale, CAMiddle School Computer Science - Sunnyvale, CAWho We AreWhat if all students graduated high school with the knowledge, skills, and habits they need to lead a fulfilled life?  This is the question that guides our mission at Summit Public Schools. Summit is a leading network of public schools that prepare a diverse student population for success in a four-year college and to be thoughtful, contributing members of society. We operate 15 schools serving over 4,500 students in the Bay Area and Washington state. Historically, 98 percent of Summit graduates are accepted to four-year colleges, and Summit graduates complete college at double the national average.We need exceptional, diverse, and mission-aligned teachers to join our team to help prepare our students for a fulfilled life. Join us!Summit’s Expeditions Program:The areas of study, or clusters, which students can explore include Leadership & Social Change, Health and Wellness, Media Studies, Technology, Business, and Art, Design & Engineering. Over the course of their time at Summit, students have the opportunity to explore passions across these clusters or to craft a pathway of deep study that may lead to an internship or independent study.In particular, our middle and high schools are interested in teachers who can offer courses in one of the following areas:Computer ScienceVisual Art STEM EducationThe Expeditions team seeks teachers with a passion for these areas who can design and execute courses in that cluster based on the teacher’s experience and expertise, aimed at middle and high school students. Using the Framework for 21st Century Learning (P21. 2015, May), students should master the skills, knowledge and expertise to succeed in work and life in the 21st century.The role of the Expeditions teacher is to empower students to discover and deepen their passions, as well as serve as a mentor to a group of students they will follow throughout their time in middle and high school. We believe that connecting to one’s passion is crucial for success in college and a career, as this allows students to make better choices about “best fit” colleges based on an understanding of the course of study for possible careers. They can begin college with a career goal in mind that is connected to their passion, and can immediately apply their decision-making and self-direction skills to continuously set and achieve goals. With their own passions and fields of study as expertise, Expeditions Teachers execute this vision by doing the following:Summit Expeditions teachers design and teach a high-quality, challenging, project-based curriculum that guides students towards explorations of potential passions.Summit Expeditions teachers facilitate learning experiences which lead students through deep exploration of fields of study connected to potential majors, hobbies and careers.Summit Expeditions teachers design and guide students through real-life experiences in the field, through guest speakers, field trips, and other connections to community groups.Collaboration & Professional Development - Twice a week, teachers participate in all-faculty after-school meetings where community decisions are made, professional development takes place, and faculty collaborates as a grade-level team or subject-level team. Mentor Time - Build deep relationships and a sense of community when teachers meet with their small group of mentees daily for their entire time at Summit. Daily, teachers meet with their mentor groups, work on Habits of Success as a group, and check in one-on-one with their mentees. Mentors coach and advocate for their mentees both inside and outside of the classroom, and strive to support them as they develop their sense of purpose as they become self-directed learners.See sample teacher schedules here. A student school day is around 8-8:30am to 3-3:30pm, depending on the specific school. Teachers stay until 5pm three days per week. At Summit Public Schools, you are joining a community committed to excellence and continual growth. We prioritize developing leaders from within and have invested in multiple career pathway programs for our teachers and school leaders. If you are looking for the opportunity to drive transformative change in a diverse community of learners and contribute to reimagining what schools should be, we encourage you to apply.What You NeedCommitment to uphold Summit’s values, and the belief that all children deserve a rigorous and equitable education that prepares them for college and for lifeTeaching Credential in California, Washington or another US stateBachelor’s Degree (a Master’s Degree in Education is preferred, but not required)Clear health and background checkTeaching experience in your subject preferred, but not requiredWho You AreYou want to be a world-class project-based learning teacher You thrive while collaborating and are excited to work with mission-aligned, high-performing colleagues. You find positivity in shared successes.You’re excited to teach Summit’s common curriculum and assessment system, which was designed for teachers and by teachers in partnership with learning scientists. You care deeply about working in intentionally heterogeneous schools and are ready to support all diverse students to reach a fulfilled lifeYou’re eager to engage in professional development and be developed as a practitioner in a network that is committed to continuous improvement.You have a growth mindset and see feedback as a positiveYou are passionate about serving as a mentor and advocate for a group of students that you’ll follow year to year. You’re open to having hard conversations to support students. What You GetSummit offers competitive salaries and benefit options, including covering 75% of the health, dental, and vision plan costs. We fully cover life and disability insurance. We have a “take what you need” PTO policy, 11 paid holidays, 4 weeks of vacation during the year, and a summer break. We value our teachers’ Summit experience, offering stipends for teachers who have been with us for three or more years and helping teachers grow with us through designated time for paid professional development and regular coaching.Summit Public Schools does not discriminate in any programs or activities on the basis of sex, race, creed, religion, color, national origin, age, veteran or military status, sexual orientation, gender expression or identity, disability, or the use of a trained dog guide or service animal and provides equal access to all programs. People from all diverse backgrounds are strongly encouraged to apply. Spanish language proficiency is a plus.We don't just encourage diversity and inclusion—we believe it's a requirement for us to be successful in our mission of helping all children succeed. Since we serve a diverse-by-design community of schools, educators, parents, and students, we need our team members to bring a broad range of lived experiences to the table with them. This is the only way we can ensure we are staying close to the work and building an authentic relationship with the people we serve.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/fc2621e9648c43cc8059ade4a0d6d6d8-middle-school-stem-teacher-summit-public-schools-sunnyvale"
    },
    {
        "position": "IT Support Specialist (Part Time)",
        "company": "Essential Access Health",
        "description": "IT Support Specialist (Part Time)Essential Access Health (Essential Access) is seeking IT Support Specialist (Part Time). Learn more at www.essentialaccess.org. This position is located in Los Angeles, CA (will be remote during COVID-19 Safe at Home). Essential Access Health is a 50 year old non-profit organization with a $30 million annual budget. The organization champions and promotes quality sexual and reproductive health care for all. As the administrator of California’s Title X (ten) federal family planning program – the largest Title X system in the nation - Essential Access receives federal family planning funds, which it allocates to multiple delegate agencies across the state that provide direct family planning and related preventive health services to mostly low-income and uninsured patients. In addition, Essential Access is funded by numerous state, county, and private foundation grants; contracts with private companies for specific research projects; earns income by providing training to health care providers across the country; and manages a Voluntary Employee Benefits Association plan that manages and administers employee benefits for Essential Access’ 70 employees and other health care employees across the state. Learn more at www.essentialaccess.org.Specific Duties + Responsibilities·      Provides the first line of contact as a help desk operator for local/remote clients experiencing hardware/software communication problems.·      Evaluates, installs, and supports workstation hardware and software. This includes PC and compatibles, Apple, various printers, and storage peripherals.·      Assists with system backups and data recovery on all server equipment.·      Monitors system and user files, as well as user mailboxes ensuring that good housekeeping is practiced (old files are deleted, etc).·      Troubleshoots hardware and general software application problems and takes corrective action.·      Assists and trains staff as designated.·      Provides assistance in presentation equipment setup.·      Maintains the corporate IT inventory control.·      Provides technical support on Essential Access Health web-based applications.·      Maintains a Problem Log for technical reference.·      Provides support on all telecommunications systems.·      Assists the System Administrator + Engineer to ensure the efficient and systematic operation of the entire computer network.·      Assists in researching, recommending and negotiating best prices on hardware and software purchases.·      Assists in all other application installations, testing and maintenance.·      Provides basic maintenance support on all copiers at the headquarters and branch office locations.·      Assist System Administrator + Engineer with cyber security initiatives implementation.·      Carries out all responsibilities in an honest, ethical and professional manner.·      Additional duties, as assigned.Knowledge, Skills, AbilitiesTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required to perform this job.·      A Bachelor’s Degree in Computer Science, Computer Information Systems, or a degree in a related area is preferred; Certifications considered.·      Some experience help desk technician, or other customer support role preferred.·      Active Directory and Exchange experience preferred.·      Tech Savvy with working knowledge of remote support.·      Good understanding of computer systems, mobile devices, and other tech products.·      Ability to diagnose and resolve technical issues.·      Knowledge in Windows 7, Windows 10, Microsoft Office, and Window Servers.·      Excellent communication skills.·      Customer-oriented and cool-tempered.·      Proficient in English.Interested candidates should submit a letter of interest and resume and salary requirements to:Email: resume@essentialaccess.orgWe will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.Essential Access offers a competitive salary + benefits. Essential Access is an M/F, Disabled, and Vet EEO/AA Employer.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/ee8cd50e7e474cf68f94b3e770fbe795-it-support-specialist-part-time-essential-access-health-los-angeles"
    },
    {
        "position": "STEAM Virtual Computer Science Instructor",
        "company": "Geeking Out Kids of Color (GOKiC)",
        "description": "*FOR IMMEDIATE HIRE* Reports To: Lead InstructorPosition Status:  5-28 hours per weekLocation: Different locations in King County; virtual Compensation: $17-$25 per hour DOEContext:  Geeking Out Kids of Color (GOKiC) is focused on bringing tech into communities of color who lack access to technology, wi-fi connectivity, and a culturally-relevant STEM education. A core value at GOKiC is to have instructors that look like the students we serve and/or come from the same type of community. GOKiC teaches computer programming, robotics and Artificial Intelligence through anti-sexist and anti-racist curriculum. We believe that by empowering kids of color with an education in computer science, they will be able to use technology to make a positive impact in their communities. Our mission is to not only close the digital literacy gap among communities of color, but to have communities of color lead the production of new tech knowledge on their own terms. Description of Work: Geeking Out Kids of Color (GOKiC) helps young people to develop a positive attitude and see themselves as successful and competent in Computer Science (CS). We do this by teaching computer programming, facilitating a variety of innovative STEM projects, and engaging participants’ communities through the intersection of  Critical Race & Gender Theory and CS. GOKiC’s year-round afterschool and summer programs teach 3rd - 12th  grade students of color an intro to computer science and coding while fostering social, emotional, and personal development, providing mentorship, and integrating technology and social impact. As the STEM instructor,  you will be responsible for coordinating with the Tech Ed helper / intern to implement the afterschool program at the different sites, including virtual sites. Impact: Engage in one-on-one teachable moments with students that are learning how to code and build robots, while also developing the skills as an instructor to teach STEM through a decolonized lens. Supervisor:  Sam Gil VargasLocations: King County; Virtual Responsibilities Youth Education and Youth Development Work with youth to identify areas of interest, passion, and skill development, and support youth through Computer Science  projects that showcase their learning.Adopt, design, and implement engaging learning activities for youth.Foster a positive, safe, respectful, and engaging environment for all participants.Monitor attendance.Assess the academic and developmental needs of the youth participants.Help track student academic achievement.Maintain positive working relationships with families, partnering personnel, and other key partners.Other duties as assigned.Administrative Maintain key project documents and communication to support different aspects of the program, including periodic reports, student files and updates.Minimum Qualifications Loves Geeking outExperience working with youth in 3rd - 12th gradeKnowledgeable around racial & gender theory, decolonization in education and critical white theory Interest in teaching Computer Science and/or Coding Interest in Roblox, Minecraft and PowerBI Apps. Interest in curriculum building AA or a B.A in education, social work or a related field or Experience in a youth services, or K-12 educational setting for at least 2 yearsknowledgeable best practices for afterschool and summer learning programs.Familiarity with local youth-serving programs.Highly positive and enthusiastic work style, capable of motivating others.Ability to work as a team member in a multicultural organization and community.Knowledge of key computer applications (MS Word, Excel, Outlook, Internet, etc.).Some administrative interest, including excellent written and verbal communication skills.Must be a self-starter, dependable, have strong problem-solving skills, and the ability to use good judgment as necessary.Must have reliable and independent transportation Bilingual Somali, Amharic, or Spanish speaking ability are desired Coming from an under resourced community is desiredEmployment Practice Geeking Out Kids of Color is an Equal Opportunity Employer. Applications are considered without regard to race, age, sex, color, creed, religion, disability, national origin, marital status, mental or physical handicap, sexual orientation and expression of gender identity or any other classification protected by law. We encourage people of color and residents of the communities we serve to apply.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/3a4e3f1e34f24a629d51e5ab775bffe5-steam-virtual-computer-science-instructor-geeking-out-kids-of-color-gokic-seattle"
    },
    {
        "position": "Database Administrator II",
        "company": "The Institute for Health Metrics and Evaluation",
        "description": "The Institute for Health Metrics and Evaluation (IHME) is an independent research center at the University of Washington focused on expanding the quantitative evidence base for health. IHME aims to provide policymakers, donors, and researchers with the highest-quality quantitative data to make decisions that achieve better health. IHME’s research spans multiple disciplines and policy-relevant areas including resource tracking, cost-effectiveness, forecasting, burden of diseases, geospatial analysis, health systems solutions, and impact evaluations. It has established international scientific credibility for developing innovative multidisciplinary methods and producing cutting-edge results. If you join IHME, you’ll be joining a team of mission-oriented people who are committed to creating a welcoming and diverse workforce that respects and appreciates differences, and embraces collaboration.IHME has an outstanding opportunity for a Database Administrator II. Funding is currently available until June 2021 with a possibility of renewal. The Database Administrator will be responsible for supporting and securing multi-terabyte databases used to enhance research efforts, as well as improving our ability to illustrate and disseminate global health trends through innovative means. This individual will also serve the critical function of keeping database technologies up to date to meet research needs effectively and efficiently. This individual will lead the implementation of new database software and hardware in consultation with database and software engineering staff.A successful candidate will be passionate about big data, experienced in open source database administration, and committed to being part of an agile development team in pursuit of turning raw data into global impact.Responsibilities include:Database architecture, administration, and securityResearch, recommend, and implement distributed database software and hardware systems.Work with system and database administrators to build stable, reliable, and scalable data management environments.Lead the installation, configuration, and tuning of development, test, and production database environments.Ensure that backup and archiving procedures are functioning correctly.Devise, implement, and maintain database monitoring and reporting tools.Work to automate database administrative tasks and provide self-service user tools wherever possible.Planning and research learningStay up to date on the latest technologies surrounding high performance operating systems and open source database management systems.Demonstrate a thorough understanding of the components of IHME’s data architecture.Plan and track projects and tasks and provide input to higher level timelines to deliver both iterative milestones and completed products.GeneralCommunicate clearly and effectively while contributing as a productive member of the database team and the Institute as a whole.Requirements:Bachelor’s degree in computer science, management information systems, or related field plus five years’ related experience or equivalent combination of education and experience.Extensive knowledge of backing up, restoring, and maintaining databases with extremely large datasetsDeep understanding of multiple open source database systems such as MySQL, PostGres, MariaDB Spider, Columnstore, or ClustrixFamiliarity with Linux Containers and Virtualization (Docker/LXC, VSphere, OpenStack)Experience with monitoring and metrics gathering tools (ELK stack, Nagios, Sensu, MonYog)Outstanding interpersonal skills, including a team ethic and focus on relationship buildingDemonstrated organizational skills, self-motivation, flexibility, strong communication skills, and the ability to thrive in a fast-paced, energetic, highly creative, entrepreneurial environmentEquivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration.DesiredExperience with distributed storage systems such as Qumulo, CEPH, Stornext, etc.Solid systems administration and automation skills (i.e., Salt, Ansible, Chef)Experience in MPP databasesConditions of Employment:Evening/weekend work may be required",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/5bf1211f1a5847f7b32e084a0afba753-database-administrator-ii-the-institute-for-health-metrics-and-evaluation-seattle"
    },
    {
        "position": "Full Stack Web Developer",
        "company": "The Institute for Health Metrics and Evaluation",
        "description": "The Institute for Health Metrics and Evaluation (IHME) is an independent research center at the University of Washington. Its mission is to monitor global health conditions and health systems, as well as to evaluate interventions, initiatives, and reforms. It uses cutting-edge techniques to tackle some of the most difficult and most critical questions in global health and find answers that will become the foundation for better policies and, ultimately, better health.IHME has an outstanding opportunity for a Full Stack Web Developer on the Central Computation Team. The Central Computation Team is looking for an experienced developer who can leverage PHP, Python, various frameworks, and other technologies to create custom web applications and internal tools, many of which support the workflows of IHME staff. The developer is responsible for implementing and modifying features and performing routine maintenance and support for IHME’s sites, web applications, and tools. The Full Stack Web Developer will report to the Software Development Manager.Responsibilities:Website and Application development and maintenanceDevelop new websites and extend functionality of existing sites for Institute projectsUtilize PHP, Python, JavaScript, application frameworks, APIs, and SQL databases to create, extend, and maintain custom internal- and external-facing applicationsBuild reusable code and libraries for future use and improve existing code and its design by applying appropriate refactoringTest code, features, business rules, and integrationsAutomate testing by writing test codeInstall and maintain application dependenciesWrite and maintain thorough documentation of all programs and proceduresTroubleshoot and fix website, application, and server issuesDocument and fix bugsPlanningWork closely with Project Managers and other staff members to collect requirements, estimate work, and ensure that projects are delivered according to schedulePlan for, coordinate, and execute software deploymentAssist with design for new websites and featuresResearch commandBecome familiar with the components of IHME disease modeling tools and databasesExplore new technologies and make recommendations as to their adoptionLearn cutting-edge methods and how to apply themGeneralCommunicate clearly and effectively while contributing as a productive member of the team and the Institute as a wholeParticipate in the overall community of the Institute, carrying out duties as requiredRequirements:Bachelor’s degree in computer science or related field, or equivalent experience plus a minimum 2 years’ experience as a full stack web developerAdditional RequirementsOutstanding interpersonal skills, including a strong team ethicSolid grasp of technologies including PHP, Python, JavaScript, SQL, HTML, and CSSExperience implementing Web UIs from conceptual designsExperience querying and manipulating data and structures in an RDBMS such as MySQLExperience with the Unix/Linux command line and CLI toolsExperience with source code management tools such as GitEquivalent education/experience will substitute for all minimum qualifications except when there are legal requirements, such as a license/certification/registration.DesiredExperience with unit testing, continuous integration, and CI tools such as JenkinsExperience with Drupal 7 or 8 module development, configuration, and migrationExperience with user-centered designExperience consuming and implementing Web APIsExperience with Node.js, React, and other JavaScript libraries and frameworksExperience with Docker or other containerization technologiesExperience with Agile development methodologiesConditions of Employment:Weekend and evening work sometimes required.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/3b564bc1f8d148be84ec26c63bc0939b-full-stack-web-developer-the-institute-for-health-metrics-and-evaluation-seattle"
    },
    {
        "position": "OCaml - Senior Software Engineer",
        "company": "Asemio",
        "description": "SummaryThe colleague we are searching for will join our product development team as a senior software engineer. You will design solutions to complex or unusual problems; the work will range from high-level architectural design to low-level performance optimizations, and will require considerable ingenuity and judgment. Our engineering team is highly collaborative and closely aligned to our goal of enabling communities to more easily improve health and economic well-being. At Asemio, you will be in a position to work on virtually all aspects of projects and have a strong voice in product and technology strategy.About the workYou’ll be working on the Asemio Community Integration Platform. It features state-of-the-art privacy-preserving, pre-processing and pipeline management, as well as record linkage technology.  The back end is written in OCaml. The front end is compiled from OCaml to JavaScript and uses a modern MVC framework. The work you’ll be doing will touch numerous technical disciplines, including cryptography, distributed systems, language design and implementation, data analytics, and data visualizations.Skills and experience Education and professional experience:BS degree in computer science or related technical field, or equivalent practical software development experience.At least five years of professional software development experience.You know at least one compiled language inside and out, both the pretty and the ugly. You can tell when a piece of code is inefficient and you know how to optimize it. You’re constantly thinking about the fragile balance between readability, maintainability, and efficiency while writing code. You will be asked to break down technical concepts in a conversational manner so that anyone can understand. You should be able to explain the impact of technical decisions on business workflows and users. You see software as merely one of many tools to help our partners. Programming experience and technical communications requirements:Strong computer science fundamentals.Excellent ability to explain complex concepts to others.Mastery of at least one programming language, all the way to the language internals and FFI.Experience with at least one functional language (e.g., OCaml, Haskell, Scala, Clojure, etc.).Proficiency with SQL, relational databases, and data modeling.A strong intuition when it comes to code organization.Proficiency with at least one front-end framework (e.g., Backbone, Angular, React, etc.).A solid understanding of low-level programming (C++, static and dynamic linking, portable ELFs, etc.) is a plus.DevOps experience:Experience with Google Cloud Platform, AWS, Docker, and other DevOps technologies is a plus.Experience with continuous integration and delivery pipelines (e.g., CircleCI) is a plus.Process experience:Experience in a product development environment is a plus.Experience with collaborative, iterative, and human-centered processes (e.g., agile, extreme programming, human-centered design, continuous quality improvement) is a plus.Community contributions: Participation in the larger tech community, such as contributing to open source projects, or involvement in industry events is a plus.Ability to actively engage with less experienced developers to impart skills and wisdom is a plus.Community volunteer experience is a plus.",
        "currentURL": "https://www.idealist.org/en/social-enterprise-job/871c587a6e864fbc898e03e8f1b0c6be-ocaml-senior-software-engineer-asemio-tulsa"
    },
    {
        "position": "Salesforce Implementation Consultant",
        "company": "Robert R. McCormick Foundation",
        "description": "Salesforce Implementation Consultant  Location: Chicago, ILCompensation: $100,000 for six to nine months, with the possibility of extensionDepartment: The McCormick Foundation is funding and advertising this position. This position will be a contractor for the Foundation, not a regular full-time employee.  Opportunity In partnership with the City of Chicago’s Department of Family and Support Services, the McCormick Foundation is currently seeking a Salesforce Implementation Consultant to support and launch a large data infrastructure project for early childhood. The goal is to implement a new solution that leverages Salesforce to help the city serve Chicago residents more effectively and equitably. The Salesforce Implementation Consultant will provide counsel regarding the design and development of the Salesforce solution based on the agency’s strategic business and technical requirements. Specifically, this position will serve as lead project manager and a transitional resource to guide the initial stages of the project to ensure that the operational system is functional, effective, and meets stakeholder goals. The Consultant will collaborate across teams (program managers, technical peers, and business partners) to ensure that maximum value is delivered to clients. The ideal candidate will demonstrate progressive leadership in the full lifecycle of the software development environment and bring experience in Salesforce implementation for government or other large entities. We are looking for someone with superb project and time management, communication, and analytical skills. Additionally, they must be enthusiastic and energized by continually learning new technologies in a changing environment. This is a temporary position budgeted for six to nine months (30-40 hours per week), with a possibility of extension based on project timelines. The Salesforce Implementation Consultant will be a contractor for the McCormick Foundation and will be supported by a cross-functional team at the McCormick Foundation and the City of Chicago’s Department of Family and Support Services. ResponsibilitiesComplete, on behalf and in service of DFSS, the Task Order Proposal Request to submit to the City of Chicago’s IT Department to begin the initiativeDevelop and/or support other technical proposals for the procurement of services or vendorsHelp support vendor selection (in coordination with the City of Chicago’s IT Department)Define, at a high level, the necessary capacity, expertise, and change management processes that DFSS will need internally to mobilize to support the successful development and maintenance of a Salesforce instance (in partnership with a Salesforce implementation vendor)Map all outside dataflows and dependencies to and from COPA from outside DFSS (particularly with Chicago Public Schools data)Serve as project manager responsible for creating workflows, timelines, and moving the project forward to meet objectivesSynthesize and understand all prior work by third party partners to help with this effort; integrate this analysis into future plans where needed; highlight gaps in prior analysis that need to be filled/correctedDefine, at a high level, initial actionable implementation plans, major tasks, roles and responsibilities, timelines, and budgets to successfully meet DFSS internal deadlines to launch the Salesforce instanceDevelop and maintain strong relationships with stakeholders with DFSS, CPS, and other players to using strong leadership and influence skillsCollaborate with leadership and across teams to uncover challenges, limitations, department capacity, and design solutions or workarounds for future useRequirementsBachelor’s degree in Computer Science or related fieldMinimum of five years of direct experience in all aspects of developing and implementing CRM or Salesforce platform applications, Salesforce.com certifications preferredDemonstrated track record of leading the development of Salesforce systems for government clients or other large entities/enterprisesExperience in Salesforce with end-to-end implementation in the following areas:Experience with implementation projects using Agile and Iterative approachUnderstanding of key architectural concepts (integration styles, architecture styles, patterns) and how they influence designKnowledge of any limitations of the platform (e.g. API and governor limits)Evaluation of Salesforce.com with 3rd party solutionsStrong knowledge of software quality assurance best practices and methodologies Knowledge of Business Process Management (BPM) techniques and tools Experience in the development of technical proposals for the procurement of services or vendorsExcellent verbal and written communication to technical audiences, non-technical audiences, and senior managementStrong relationship management skills and understanding of formal and informal organizational structuresExcellent project management skills, specifically the ability to develop schedules and workflows and implement and adapt tools and techniques to an organizationFlexibility, resilience, comfort with ambiguity, and the ability to keep projects moving toward successful completion in the face of discouraging developments or aggressive timelinesAll offers are contingent upon successful completion of a criminal background check and drug screening ",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/857a012dfbb54d849fc39f1cbccc7875-salesforce-implementation-consultant-robert-r-mccormick-foundation-chicago"
    },
    {
        "position": "Senior Medical Data Analyst",
        "company": "Cystic Fibrosis Foundation - Cff.org",
        "description": "The Senior Data Analyst works as part of an integrated medical team and is a key resource in delivering various data analyses, reports, and visualizations to provide support for strategic initiatives and measuring the performance of the Medical Department in achieving its strategic vision and objectives. The role will be responsible for the development and maintenance of database and information systems to monitor the progress of drug discovery and development projects, research programs and the clinical trials network supported by the Foundation. The Senior Data Analyst is responsible for aggregating appropriate data sources to conduct analyses to gain an understanding of the Cystic Fibrosis Foundation’s portfolio of research awards and Medical Department operations and generating data analytics and visualizations for internal and external communications. This may include the integration of multiple types of data sources including medical awards, company interactions, and financial. This position requires a strong understanding of data analytics, statistical approaches, data visualization, query languages, implementation of database management systems and is charged with upholding the principles of data quality and assurance. The role is responsible for complete life cycle data generation and the utilization of tools to analyze data and make recommendations for improvements to optimize current data management processes. ESSENTIAL DUTIES AND RESPONSIBILITIES: Data Analytics Maintain data systems to track the progress of medical drug discovery and development projects, clinical trials and basic research grantsModels, analyzes and forecasts metrics that support budgeting, forecasting, and organizational decisionsIntegrate data from various systems into an analytics platform; verifies data integrityCollaborates with the IT department to identify and define business rules, metrics, KPIs and business intelligence reports required to support the Medical Department and CFF operationsReports monthly on defined and new operating metricsAssists in the characterization of portfolio of grants, awards, and contracts using data analytics and visualizationsMonitors compliance with controls and systems, and develops new processes to support the organizationInfluences major work efforts and projects; identifies issues and opportunities and influences others toward resolution; supports team members and works cross-functionally to move projects forwardCommunicate with program officers & CFF leadership to obtain and provide progress updates and high-level briefings; prepares supporting details for meetingsWork with IT department in areas of systems implementation, enhancements and application issues.Experience in developing, launching and maintaining data management and statistical packages. This may include SharePoint, Excel, MS Dynamics, and Tableau.Work closely with Communications Team for messaging transparency regarding CF research portfolio Financial ReportingWorks with financial analyst to ensure database is maintained with accurate informationAssists with providing reports to medical leadership for the financial oversight of executed grants, awards and contractsParticipates in the annual financial audit of grants, contracts and awardsSupports data input into financial models for the Medical Department and Program Officers KNOWLEDGE, SKILLS AND ABILITIES REQUIRED:Bachelor’s Degree in Computer Science, Data Science, Computer Engineering, Information Management, Statistics, or relevant degree preferred; Masters degree preferredMinimum of 8 years relevant work experienceDemonstrate analytical and problem-solving skills with the ability to analyze a system and document its processes through integration with technologyTechnical expertise regarding data models, database design development, data mining and segmentation techniquesKnowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)Experience using statistical computer languages (R, Python, SLQ, etc) to manipulate data and draw insights from large data setsStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracyAdept at querying datasets, report writing and presenting findings with relevant visualizationsProven ability to consolidate extensive data findings from multiple sources into relevant insightsExperience visualizing/presenting data for stakeholders (PowerBI experience preferred)Excellent verbal and written communication skills: must be able to communicate confidently and effectively with project team members and executive managementProficient in standard operating systems Windows and OSX REPORTING RELATIONSHIPS: The Data Analyst will work within the Research Affairs Department & will report to the Sr Director, Medical Business Operations. No direct reports. The CF Foundation is an equal opportunity employer that is committed to being an employer of choice, not just a good place to work, but a great and inclusive place to work. We strive to recruit and maintain a diverse workforce. Qualified applicants will receive consideration for employment without regard to race, physical or mental disability, color, religious creed, ancestry, national origin, religion, age, sex, marital status, genetic information or testing, gender identity and expression, sexual orientation or status as a Vietnam-era or special disabled veteran or any characteristic protected by law. Reasonable Accommodation Notice The CF Foundation is committed to providing reasonable accommodations for qualified individuals with disabilities in our job application procedures. If you need assistance or would like to request an accommodation due to a disability, please contact us at HROps@cff.org .",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/45732aa554234e4e8b9d4fa6dfe9c5e9-senior-medical-data-analyst-cystic-fibrosis-foundation-cfforg-bethesda"
    },
    {
        "position": "SharePoint Developer",
        "company": "National Association of Community Health Centers",
        "description": "The SharePoint Developer will work as a team member to design, develop, deploy, and support custom built and third party applications for Microsoft Office SharePoint (MOSS) 2007, 2010, 2013 and Office365 SharePoint Online environments. Customize out of the box SharePoint sites to suit business needs. Participate in the architectural design, development, customization, and integration efforts involving Collaboration, Portals, Enterprise Search, Enterprise Content Management, Business Process and Forms. Handle support incidents escalated through helpdesk, monitor and improve server performance, plan and carry out server maintenance such as patching and upgrade.Responsibilities:Design, enhance, implement and maintain SharePoint sites and applications ensuring access, reliability, availability and usability to current and new usersDevelop new SharePoint sites/sub-sites, applications and enhancementsCustomize sites, including setting up security, designing site structure and maintaining content typesIntegrate SharePoint with processes, workflows using SharePoint Designer and Visual Studio, e-mail alerts, data visualization, relational database managementBuild custom forms using InfoPath, including integration with back-end databasesAbility to create reports, dashboards, and scorecards using Microsoft Excel, SQL Report Builder, Power BI, or similar technologiesWork with end users on portal development, including graphics, branding, layout, and navigationsPerform maintenance operationsCreation/review documentationPREFERRED EDUCATION/EXPERIENCE:4-year degree in Computer Science or related curriculum along with 3+ years of progressive experience with .NET and C# in addition to the technical skills noted below (or an equivalent combination of work experience and education)Experience with SharePoint DesignerExperience with InfoPath FormsExperience with SharePoint Migration Tools.Experience using jQuery, XML, XSLT, WCF, HTML5 and CSS3Visual C#, VB.Net, Classic ASPMS SQLJavaScript, jQueryVisual Studio 2008/2010/2012/2013/2017Team Foundation ServerPersonal QualitiesA thorough understanding of current software applications and technology. Proficiency in utilizing multiple programming languages (.NET, Visual Basic, SQL, etc.). Strong Problem solving and analytical skills. Written and oral communication skills appropriate for the position, including the ability to speak with authority on technical issues in various professional settings and to persuade listeners regarding best approach to resolving user's problem (may include communication via telephone, in person, presenting to large groups, community events). Ability to write complex documents (may include policies, procedures, and presentations). Communicates with a wide variety of individuals (employees and all levels of management) throughout the organization and outside of the organization.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/5c4190bbc28749df869cb736ddef07cc-sharepoint-developer-national-association-of-community-health-centers-bethesda"
    },
    {
        "position": "Data Quality and Assurance Manager",
        "company": "Heifer International",
        "description": "Heifer International is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, gender, gender identity, sexual orientation, age, status as a protected veteran, among other things, or status as a qualified individual with disability.*Primary Work Location: Washington D.C. or Little Rock, ARFUNCTIONThe selected candidate will work in the Monitoring, Evaluation, and Learning (MEL) sub-team, situated in the Program Effectiveness (PE) division within the Mission Effectiveness Department. This team manages a large portfolio of data products and platforms, including Heifer International’s Global Indicators (GI) database, country databases, and other topical databases. The PE team also manages data quality procedures for analytical data collection. The team is responsible for Heifer’s global reporting, supporting country and project offices in their data collection efforts, and Heifer’s general data collection system regarding data collection, review, and sharing workflow.The PE team is currently developing a work plan to streamline and modernize the entire pipeline for its data products and modernize its monitoring report outs. The primary goals are to increase efficiency, improve data quality, and standardize reporting. On the user side, the long-term goal is to make measurable improvements data users can access and the quality of reports, including leading database infrastructure development and reporting analysis. We are looking for an individual with a strong understanding of the latest tool and approaches to data analysis and use, a track record of innovation, and a dedication to user outreach and satisfaction.The Data Quality and Assurance Manager will be accountable for a range of monitoring and evaluation processes. From validating data and leading monitoring reporting, including bi-annual project progress reports and annual Global Indicator reports, to running statistical analyses and creating dashboards visualizations to tell clear stories and allowing Heifer staff to explore the data, we are looking for a data scientist with well-rounded skills and experience with current tools and approaches for modernizing Heifer’s entire data production and use chain. The selected candidate will be a technical expert with specific duties related to data reporting, data documentation and storage, data management and use, promoting data use.ESSENTIAL CHARACTER TRAITSResult oriented, Self-starter, positive attitude, stellar communications, collaborative, creative, organized, team-oriented, effective manager, and realistic with timelines and deliverables. RESPONSIBILITIES & DELIVERABLESA.   Lead high-quality data reporting (30%)Produce periodic standard reporting as well as request specific reporting, including data collection, data analysis, data visualization, and reporting.Responsible for high-quality data stored in Heifer’s databases and electronic files.Develop and effectively implement field monitoring tools for data quality assurance, including standardizing methodologies for reviewing, approving/rejecting, consolidating, and reporting on the data.Create a clearly defined process for informing project stakeholders and follow-up data collection when the data is not in-line with the expected results.Complete timely and high-quality progress and GI reporting, including documentation of procedures for quality assuring Heifer’s monitoring data for each Heifer project.B. Develop data documentation and storage (25%)Responsible for progress data at the project and organization levels, including the documentation of data structures at both levels and the updating as needed for project and HQ teams to use.Responsible for developing databases for data de-identification and storing all project data over time.Ensure that data is in a format that can be easily lifted and used for revenue and programmatic needs.C. Lead data management and use (15%)Serve as primary curator and point of contact for Heifer country and project staff, including leading through the initial data deposit process, and facilitating routine updates to data and metadata.Organize and tag quantitative and qualitative data to facilitate easy future access.Create code-based tools and approaches (using tools like Excel, PowerBi, SPSS, Stata, and SurveyCTO) to perform data wrangling and quality review, as well as streamline the collection and sharing of data.Develop training curriculum on best practices and standards concerning data management, dissemination, and metadata for project data, including a focus on high-quality data production and review.D. Promote data use (15%)Survey data producers and users to understand pain points in the data production and use cycle.Develop visualizations and other bespoke services to provide value-added data dissemination.Deliver presentations to Heifer staff and other audiences on the availability and use of Heifer data.Develop ideas for the continuous improvement of data tools, data collection platforms, and databases, including dashboards for projects and the whole organization.E. Build organizational staff capacity in the field and across departments to up-grade the MERL functions to include Heifer developing areas (10%)Ensure that HQ and field teams own and implement standard data collection practices within all projects. Provide a key mentorship role for MEL staff who support field staff growth and improvement.Ensure that MEL staff effectively provide service to field teams by soliciting feedback from the field and HQ teams bi-annually at a minimum.Develop the internal capacity to participate in industry-led forums and think-tanks regarding monitoring and evaluation systems and its growth industry-wide including Heifer’s living income benchmarks and thought leadership in accelerate focus areas.F. May perform other job-related duties as assigned (5%)Minimum RequirementsMaster’s Degree in Data Science, International Development, Social Science, Statistics, Computer Science, or a related field. 6-10 years’ job-related experience with a minimum of 3 years in management roles. Or PhD in related field with 3-7 years’ of job-related experience with a minimum of 2 years in a management role. Preferred RequirementsExperience with advanced statistical programming tools, for example Python or R. Machine learning expertise. Working knowledge of SQL and database platforms as well as data visualization tools lie PowerBI, D3, Tableau, ggplot.Most Critical ProficienciesWell-grounded in the discipline of project monitoring and evaluation, quantitative and qualitative data capture protocols, methodologies, and approaches.Experience working with field teams/operations.Demonstrated experience in developing and supporting data architecture, including data production, data management, metadata, quality control, data design, cleaning and validation, and publishing.Excellent working knowledge of data science tools, relevant programming languages (Excel, SPSS, Stata, PowerBI, SurveyCTO) and related statistics and visualization modules. Excellent working knowledge of SQL and database platforms as well as data visualization tools (such as PowerBI).Exceptionally high attention to detail and a demonstrated ability to identify and resolve errors and inconsistencies as part of a comprehensive quality control process.Demonstrated familiarity and experience with GIS systems (ESRI and/or QGIS, rasterio, GDAL) and data formats, satellite imagery, sensor data, big data and other alternative approaches to conventional statistics.Domain expertise in one or more subject areas of development data, such as demographic data, gender, socio-economic statistics, poverty, energy, infrastructure, agriculture, environment, etc. would be considered a plus.Strong communication skills, including the ability to clearly and concisely articulate complex ideas both in writing and verbally. Demonstrated experience in giving presentations to a range of different audiences.Strong interpersonal skills, particularly the ability to comfortably work across diverse teams and cultural backgrounds to understand a range of perspectives and communicate effectively.High level of professional enthusiasm and commitment to the Heifer’s core values and mission.Proven ability to build capacity in junior staff levels in MEL.Demonstrated ability to get things done when working across the organization – taking a pragmatic approach and applying influence when working outside of formal authority.Ability to focus, prioritize, and deflect distractions in a fast-paced, dynamic environment.Fluency in English required and ability to travel to field sites.Essential Job Functions and Physical DemandsConstant face-to-face, telephone and electronic communication with colleagues and the public, including colleagues in different time zones.May require constant sitting and moving, working at a computer for extended periods of time.Ability to assign and review the work of direct reports, as well as motivate and engage team members.Willingness and ability to work outside of normal business hours.Willingness and ability to travel domestically and internationally as needed and currently estimated as 25%.Ability to work with sensitive information and to maintain confidentiality.Ability to work in a culturally diverse and global setting.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/d82d42b942b247efbf5d051c9e010b83-data-quality-and-assurance-manager-heifer-international-washington"
    },
    {
        "position": "IT Technician",
        "company": "Hampton Roads Community Action Program",
        "description": "Purpose of the Position:      Will install and maintain computer systems and networks aiming for the highest functionality. Will support/promote and implement administrative efforts.Supervisor:                           Program Operations Team LeaderQualifications:                      At least an Associate’s Degree in Computer Science or a related field, and at least three (3) years proven experience as an IT Technician or relevant position. Excellent diagnostic and problem-solving skills.    Good knowledge of internet security. Must possess a valid VA Driver’s License. Must be well organized with excellent verbal and written communication skills. Must be resourceful and familiar with communities of service. Must pass Criminal Background Check and Child Protective Service registryDuties:Manages and maintains Microsoft Windows applications and systems including but not limited to Windows 7, Windows 10, various android apps and iOS (Apple) integration.Manages the acquisition, installation and maintenance of the organization’s local area network hardware/software.Manages network operations to include: troubleshooting connectivity problems; installing & maintaining routers; assessing and reporting operational status; performing backups and restores; etc.Ensures technology documents/certificates such as product registrations, SSL certificates, maintenance agreements, service contracts, etc. related to technology operations and/or technology services are evaluated, updated and processed.As needed and appropriate but no less than annually, provides written technology policy guidance to managers, supervisors, staff and consumers/participants.Performs routine preventive maintenance on hardware and software.Analyzes technology requirements and develops functional specifications. Conducts comparative analysis and competitive bidding when necessary.Assists staff in understanding and using technology; conducts regular staff technology presentations and trainings.Presents and implements technological alternatives to streamline functions and improve productivity.Manages technology inventory to include procurement and disposal.Ensures compliance with all software licensing agreements. Manages and safeguards software media and associated licenses. Tracks software versions. Maintains centralized software use log.Develops annual technology goals and detailed plans for goal accomplishment.Creates and maintains LAN/WAN maintenance logs.Responsible for the discovery, mitigation and documentation of information technology risks. Responsible for the completion of monthly risk management reports. Ensures networks, workstations, operating systems and software applications are operational; ensures hardware and software is patched and/or updated; ensures all analog and broadband circuits are operational in accordance with vendor specifications.Ensures for the availability, continuity and security of data and information pertaining to the organization.Prepares, maintains and tests a technology disaster recovery plan.Develops and maintains an excellent working relationship with other organizations, ensuring the organization is well received and presented professionally and positively.Respects confidentiality in discussing consumer/participant, staff, volunteer and organizational matters; also maintains confidentiality of organization, project, fiscal and personnel related information.Maintains knowledge on current technology by reading technology periodicals, evaluating new technologies and attending trade-shows, technical seminars and training sessions.Develops and manages technology budget and monitors and approves related expenditures. Reviews and approves cost pool expenditures.Prepares reports for workshops, seminars, conferences, meetings and trainings attended pertinent to the efficient dispatch of duties; overnight travel occasionally required.Reports to work regularly and on time.Ability to travel to the Southside and the Peninsula to perform IT functions for all HRCAP sites.Assists in other duties as needed and directed.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/5b0238371527464a97d73156f8f6306f-it-technician-hampton-roads-community-action-program-newport-news"
    },
    {
        "position": "Curriculum Developer",
        "company": "Black Girls CODE",
        "description": "ABOUT BLACK GIRLS CODESince 2011 Black Girls CODE (BGC) has been devoted to showing the world that black girls can code, and do so much more. By reaching out to the community through workshops and after school programs, Black Girls CODE introduces computer programming and technology to girls from underrepresented communities in technology areas such as web design, robotics, gaming, mobile app development and more. By cultivating the next generation of coders we hope to grow the number of women of color in technology and give underrepresented girls a chance to become the future leaders in technology and the masters of their technological worlds. We thrive on working in a collaborative, fast-paced environment. We represent a diversity of backgrounds, a wealth of experience and a lot of fun.POSITION SUMMARY: The Curriculum Developer will develop curriculum and lesson plans to support all Black Girls CODE programs and workshops. Our Curriculum Developer will work closely with the education team to develop an organizational curricular platform which includes course development, implementation, evaluation, research, and continuous improvement of the curricula models. S/he will support the development and implementation of chapter educational program initiatives and work with instructors and staff as needed in a high-performance non-profit environment. The Curriculum Developer will observe, supervise, evaluate and support BGC in the development and implementation of our curriculum. Ensure that there is a sound scope and sequence of curriculum and integration within our primary areas of focus.RESPONSIBILITIES:Develop and design detailed curriculum plans across various technical subjects; ensure that curriculum tools meet program goals and student learning objectivesScope, design, and develop curriculum content that is both engaging and informative for our tech divas and alumnaeEnsure there is curricula alignment and adequate curriculum materials and equipment available and accessible across all sites and locationsWork collaboratively with the Education/Curriculum team to develop a curricular platform that meets organizational objectives and that will scale across all of our chapter programs and by varying age demographicsDesign and write learning support tools such as, but not limited to Powerpoint presentations, facilitator/instructor guides, participant guides, quick reference guides, and other student learning tools as course accompaniments.QUALIFICATIONS:This is an extraordinary opportunity to be part of a small and growing team in a dynamic startup environment. The position offers great potential for learning and affords real opportunity to have a tangible impact on communities across the country. The successful candidate will have experience with developing, launching and managing computer science or other related STEM curricula in a K-12, nonprofit environment and/or corporate environment. Only candidates with a background in engineering, science, or technology will be considered for this role. Direct experience working with youth (or experience coordinating programs for youth) is a plus. Professional software development experience is a plus but not a requirement.REQUIREMENTS:Minimum of 3-5 years experience as CS educator, software engineer, or designer OR 4 years of related university training in a CS or Education discipline. Prior non-profit or start-up work experience is preferred.Exceptional organizational skills and ability to balance multiple priorities in a changing environmentEffective writing skills and proven ability to develop lessons plans and instructional toolsStrong experience and outgoing personality in fostering relationships and partnerships with community organizations and corporationsCreativity- able to think of new ways to engage studentsStrong interpersonal skills and ability to work well in a team environmentExceptional communication and presentation skillsIntegrity, maturity, credibility, and a demonstrated commitment to Black Girls CODE's missionBA/BS/MS in Computer Science or related technical field is ideal and preferred; however relevant professional experience will be considered.Position opens immediately.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/c0c0ddf9dfb84f358eea1d12e476c8eb-curriculum-developer-black-girls-code-new-york"
    },
    {
        "position": "Senior Manager/Director - Education and Alumni Programs",
        "company": "Black Girls CODE",
        "description": "ABOUT BLACK GIRLS CODELaunched in 2011, Black Girls CODE (BGC) is devoted to showing the world that black girls can code, and do so much more. By reaching out to the community through workshops and after school programs, Black Girls CODE introduces computer programming and technology to girls from underrepresented communities in technology areas such as web design, robotics, gaming, mobile app development and more. By cultivating the next generation of coders we hope to grow the number of women of color in technology and give underrepresented girls a chance to become the future leaders in technology and the masters of their technological worlds. We thrive on working in a collaborative, fast-paced environment. We represent a diversity of backgrounds, a wealth of experience and a lot of fun.  POSITIONThe Sr. Manager/Director of Education and Alumni Programs will lead all aspects of BGC’s alumni engagement, programming, activities, and support. S/he will lead organizational efforts to continue the leadership development and advancement of BGC alumnae, build and strengthen connections within the alumnae community – including incorporating new alumnae into the network and creating innovative pathways for alumnae integration into other aspects of BGC’s work. The successful candidate will have experience in developing and managing an alumni program with a K-12, higher education, nonprofit and/or association setting with an alumni constituency.  The Sr. Manager/Director of Education and Alumni Programs will be a full-time position reporting to the VP of Educational Programs.RESPONSIBILITIESDevelop alumni pipeline program to foster and activate alumni community engagement and continuing education opportunities for BGC alumnae and college studentsPartner with marketing, curriculum and program teams to ensure the execution of alumni engagement strategies are consistent with organizational goals and objectivesCreate research methodologies to track program alumnae through their postsecondary and career journeys. Establish protocols to map alumnae into organization as mentors, volunteers, advisees, etc.Develop an internship model to link BGC students and alumnae to summer internship, apprenticeship, and career opportunities with partners, volunteers and our overall community.Coordinate the annual BGC Alumnae Summit and other conference events to engage, educate, and expose BGC students and alumnae to career growth, networking, and other opportunities to expand their skills and resources.Create the BGC College Loop program by working to establish a network of partner colleges and universitiesQUALIFICATIONSThis is an extraordinary opportunity to be part of a small and growing team in a dynamic startup environment. The position offers great potential for learning and affords real opportunity to have a tangible impact on communities across the country.REQUIREMENTS Minimum of 8 years experience in education, nonprofit or association setting, specifically managing alumni programming Experience working in a fast paced environment, with a focus on developing mission-driven engagement strategiesStrong leadership skills Exceptional organizational skills and ability to balance multiple priorities in a changing environmentAbility to pay close attention to detail and be highly organized, staying productive and accurate under pressure with tight deadlines (a sense of humor helps, too).Strong problem-solving skills, including the ability to proactively provide solutions that circumvent anticipated problems.Excellent verbal and written communication skills, with exceptional attention to detailStrong experience and outgoing personality in fostering relationships and partnerships with community organizations and corporationsStrong interpersonal skills and ability to work well in a team environmentLooking for team member with self-discipline, carefulness, thoroughness, self-organization, solid deliberation skillsIntegrity, maturity, credibility, and a demonstrated commitment to BGC’s missionBA/BS in Education, Computer Science, Business Management or related disciplines is preferredInterested candidates should apply via the attached application portal only:  Position open immediately.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/2b7b250472174b7b9f1e5e8ceab1f4a4-senior-managerdirector-education-and-alumni-programs-black-girls-code-new-york"
    },
    {
        "position": "Multimedia/Web Editor, Quanta Magazine",
        "company": "Simons Foundation",
        "description": "POSITION SUMMARY Quanta Magazine seeks a talented multimedia/web editor with a strong visual journalism background and a passion for science storytelling to develop and lead the magazine's growing video and interactive aspirations. The perfect candidate will be a technologically savvy creative thinker and visualizer who is enthusiastic about science and also an experienced journalist and editor. Candidates should have impeccable editorial judgment, ideally honed by solid newsroom experience. Devotion to the highest standards in journalistic ethics and scientific accuracy are a must.In addition to working with Quanta's editorial staff to dream up high-impact multimedia features and assigning, developing and managing those projects, this editor will collaborate with the art director and production staff on the publication and presentation of all web content on all platforms. This editor will also coordinate the development of new and improved website features with our in-house developers.This full-time position will report either to the editor in chief or to the art director is based at the Simons Foundation offices in New York City.MINIMUM QUALIFICATIONSExperience and Skills:\n\nAt least 3 years of video, photo, multimedia or web producing or editing experience for an established newspaper, magazine or news website, with a proven track record of conceiving and creating impactful multimedia features.\nExperience and proficiency with video and visual asset direction, production and editing.\nA background in journalism is required. A background in science journalism is a plus.\nMust be comfortable producing high-end journalistic presentations in a content-management system like WordPress under tight deadlines and be up-to-date on the latest publishing, SEO and internet conventions.\nMust be detail-oriented and highly organized, with strong project management skills, and demonstrate the highest standards of written English and visual communication.\nSome knowledge of or experience with HTML5/CSS3/JavaScript is a plus.\nMust be an excellent communicator and team player and have the ability to coordinate multimedia production with editors, reporters and the art staff.\n\nREQUIRED APPLICATION MATERIALS\n\nRsum and cover letter\nThree references\n10 multimedia work samples (with metrics or other supporting data when available)\n\nABOUT QUANTAQuanta Magazine is an award-winning, editorially independent online publication launched by theSimons Foundationto enhance public understanding of science. Our reporters and editors focus on developments in mathematics, theoretical physics, theoretical computer science and the basic life sciences, with an emphasis on delivering timely, accurate, in-depth and well-crafted articles for our broad, discerning audience. In addition to winning awards and accolades for its science writing, Quanta is a 2020 finalist for a National Magazine Award for general excellence. Quanta has syndication partnerships with Wired, The Atlantic, Scientific American, The Washington Postand other publications, has published two books (Alice and Bob Meet the Wall of Fire and The Prime Number Conspiracy) and our articles have been translated into several languages.The Simons Foundation's Diversity CommitmentMany of the greatest ideas and discoveries come from a diverse mix of minds, backgrounds and experiences, and we are committed to cultivating an inclusive work environment.The Simons Foundation provides equal opportunities to all employees and applicants for employmentwithout regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability,veteran status or any other protected category under federal, state and local law.\n\n\nPI120744720",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/8ef9e798e5f84db78105db3dda72f7c1-multimediaweb-editor-quanta-magazine-simons-foundation-new-york"
    },
    {
        "position": "Social Worker",
        "company": "Unity Preparatory Charter School of Brooklyn",
        "description": "Our Social Workers are absolutely essential to our success as a faculty and school. They manage a wide variety of student needs, ensuring that barriers to student learning are identified and that supports are put in place for our students and families. In doing so, they guide our students to be empowered, critical, and engaged members of their school, their community, and the world at large. Overview of Unity - Our Model and Approach: Unity Preparatory Charter School of Brooklyn (Unity) is a tuition-free, open-enrollment, independent charter school that offers a progressive education in the liberal arts & sciences to over 600 students in grades 6-12. As a community-based school, we proudly serve the communities of central Brooklyn in New York City. Our middle school and high school campuses are located in the neighborhoods of Bedford Stuyvesant and Williamsburg, respectively.  Unity’s mission is to empower students as scholars and citizens so they may lead fulfilling academic, personal, and professional lives. We accomplish our mission through the integration of seven key elements that serve as the backbone of our school’s design. Collectively, these elements reflect our beliefs on what makes for an exceptional secondary education in today’s world: 1.    A Grades 6-12 College Preparatory Curriculum:​ a college-preparatory liberal arts and sciences program of study in mathematics, English language arts (ELA), science, and history that fosters in students the desire and capacity to learn independently, think critically, and communicate proficiently so that they are fully prepared to succeed in their postsecondary studies 2.    Excellent Teaching:​ ​​an enthusiastic faculty of expert educators who are demonstrably successful in promoting student learning, couple high expectations with high support, go above and beyond the call of duty for students as scholars and as citizens, and serve as role models for students as life-long learners and as individuals who take the utmost pride in perfecting their craft 3.    More Time for Learning:​ ​​an extended day, week, and year that provide approximately 20% more time than the local district average for academic enrichment and extracurricular activities that deepen learning and engagement, accelerate academic growth, and expose students to new pursuits 4.    Intensive and Differentiated Academic Support:​ customized settings and support provided by caring specialists for remediation and acceleration, including small class sizes, integrated co-teaching, literacy interventions, after-school and weekend tutoring, as well as advanced-level course offerings at our middle school and high school 5.    Ample Enrichment Courses and Extra-Curricular Activities:​ enrichment courses in the performing arts, visual arts, computer science, and foreign languages, as well as elective clubs, athletic teams, internships, and other “beyond-the-classroom” activities that serve to reinforce what students learn in their core courses, accommodate individual student interests, and develop important professional and citizenship skills through real-world, meaningful application 6.    A Positive and Supportive School Culture:​ ​​a culture built on a framework of Positive Behavioral Interventions & Supports (PBIS) in which compassionate adults explicitly guide students in the following: o      modeling the behaviors that contribute to a positive and productive learning environmento      developing socio-emotional skills needed to be successful, including how to manage emotions, reduce stress, make healthy decisions, and learn from one’s mistakes 7.    Active Family and Community Involvement: ample opportunities for family engagement and community service that promotes open communication, meaningful collaboration, and active involvement and service within Unity’s community and beyond Our Recent Accomplishments: Regardless of where students are academically or otherwise as they enter our school, our focus is on accelerating growth and on cultivating long-term academic and non-academic success. This focus has reaped impressive results for our students and families in recent years. Among our accomplishments:●     Our 8th grade students have consistently outperformed their district peers in mathematics and ELA on state exams.●     Our students who comprise subgroups that are traditionally least effectively served by our education system, including students classified as economically disadvantaged, black, Latino, and students with disabilities, have consistently outperformed their district and state peers on state exams.●     Approximately 75% of our high school upperclassmen enroll in at least one Advanced Placement (AP) course each year. This compares favorably with the 33% of NYC graduates who enroll in AP courses during their high school tenure.●     In holding true to our belief in providing a truly empowering education:o      90% of our students participated in an afternoon extra-curricular activity.o      80% of our students participated in a formal community service initiative.o      90% of students successfully completed their end-of-year Roundtable presentation, a 45-minute oral presentation given to families, Unity faculty, and community members.o      100% of high school students completed a full-year course in college and career readiness.ResponsibilitiesOur faculty plays an essential role in establishing Unity as a model educational institution. Most critically, faculty members equip students with the knowledge and skills needed – including the desire and capacity to learn independently, think critically, and communicate proficiently – in order to experience secondary and postsecondary success. Key responsibilities of a Unity School Social Worker include but are not limited to the following:\tI. Assessment and Intervention●      Manage and provide assessment of counseling referrals for students from school staff, the Committee on Special Education (CSE), parent/guardians, and student self-referral using a school-wide Response to Intervention (RTI) framework●      Provide one-on-one or group counseling in compliance with student Individualized Education Programs (IEPs) and work closely with all interdisciplinary teams, school staff, SPED team, parents/families, and other collaterals to support student growth●      Provide one-on-one/ group/ drop-in counseling or other intervention for “at-risk” students who require support but do not have an IEP, and work closely with all interdisciplinary teams, school staff, parents/families, and other collaterals to support student growth●      Conduct regular needs-assessments of current and emerging student and family needs and identify and implement services as indicated/possible\tII. Referral●      Provide referrals to families for mental health, therapy and psychiatric services as needed●      Provide linkages to families to community referrals and supports (i.e.: medical or insurance related needs, public assistance, housing assistance, etc.)●      Identify students and families who are in transitional housing and manage implementation of school-based support as per McKinney Vento guidelines●      Act as the liaison between outside service providers and the school (i.e.: ACS workers, mental health, therapists, caseworkers, etc.) by maintaining regular contact in order to facilitate holistic student support \tIII. Crisis Intervention●      Serve as Crisis Intervention Team (CIT) member who helps address school response to incidents of suspected abuse, maltreatment, or neglect as well as student self-harm or suicidal ideation●      Provide training and professional development to staff on mandated reporting responsibilities as well as high-risk behavior protocol●      Support staff in making mandated reporter calls as necessary and serve as liaison between staff, child welfare organizations, families and the school●      Assess students who present with high-risk behaviors such as suicidal/homicidal ideation and self-harm and respond as indicated●      Assess cases of suspected abuse/maltreatment/neglect and respond as indicated      IV. Interdisciplinary Teams and Professional development●      Serve as a member of several interdisciplinary teams providing mental health/counseling expertise and executing delegated tasks as appropriate (ie: Grade Level Teams, Crisis Intervention Team (see above), Attendance Team (see below), Interdisciplinary Team (IDT.)●      Provide professional development and support to all staff in socio-emotional learning and mental health \tV. Attendance●      Attend regular meetings to analyze data and address intervention●      Create and implement ongoing attendance interventions for chronically absent students as per RTI framework ●      Manage referrals to ACS for Educational Neglect \tVI. Health Education ●      Serve as a Condom Availability Program (CAP) staff member trained to provide health/sexual health resources and referrals to students\tVII. Compliance, Record Management and Supervision●      Completes timely, accurate and professional documentation of services including progress notes●      Completes all documentation necessary for IEP reports as well as other documents required by the Committee on Special Education ●      Completes necessary portions of Functional Behavior Assessments (FBA) and Behavior Intervention Plans (BIP)●      Receives weekly clinical supervision from Director of Social Work (with a potential to obtain hours towards LCSW)●      Participates in regular social work group supervision \tVIII. Other●      Performs other operations-related tasks consistent with the goals and objectives of this positionQualificationsThe ideal candidate for this position is equipped with:●      LCSW or LMSW degree●      A proven track record of supporting student learning; at least two years of formal social work experience in schools preferred●      NYS School Social Worker Certification must be obtained within six months of hire●      Seminar in Field Instruction (SIFI) certification preferred ●      Interest in supporting students and families via a restorative justice lens●      Expertise in working with diverse populations of students and families●      An acumen for actively engaging students in their own learning and social and emotional development●      Highly efficient, attentive to detail, motivated and able to multi-task, set priorities and establish and meet deadlines●      Strong written and oral communication skills including an acumen for participating in sensitive conversations●      A disposition toward teamwork and collaboration●      A demonstrated openness and responsiveness to constructive feedback and a strong commitment to continuous improvement and professional growth●      Approaches the profession with maturity, humility, versatility (i.e., embraces the ambiguity and excitement associated with start-ups), and, of course, a sense of humor",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/687843038e114ea99d982c9c8cb67d38-social-worker-unity-preparatory-charter-school-of-brooklyn-brooklyn"
    },
    {
        "position": "Salesforce Developer",
        "company": "Local Initiatives Support Corporation",
        "description": "Position Title:              Salesforce DeveloperReports To:                    Director of Business ApplicationsJob Classification:      Exempt / Full TimeLocation:                         LISC Headquarters Office, New York, NYTHE ORGANIZATIONWhat We DoWith residents and partners, LISC forges resilient and inclusive communities of opportunity across America – great places to live, work, visit, do business and raise families.Strategies We PursueEquip talent in underinvested communities with the skills and credentials to compete successfully for quality income and wealth opportunities.Invest in businesses, housing and other community infrastructure to catalyze economic, health, safety and educational mobility for individuals and communities.Strengthen existing alliances while building new collaborations to increase our impact on the progress of people and places.Develop leadership and the capacity of partners to advance our work togetherDrive local, regional, and national policy and system changes that foster broadly shared prosperity and well-being.Over the last 40 years, LISC and its affiliates have invested approximately $20 billion in businesses, affordable housing, health, educational mobility, community and recreational facilities, public safety, employment and other projects that help to revitalize and stabilize underinvested communities. Headquartered in New York City, LISC’s reach spans the country from East coast to West coast in 36 markets with offices extending from Buffalo to San Francisco. Visit us at www.lisc.orgABOUT THE DEPARTMENTThe Information Technology (IT) Department manages and maintains all technology systems for ~450 staff dispersed across 35 offices.ABOUT THE POSITIONWe are looking for a Salesforce Developer who will play a key role in expanding our Salesforce Fundraising/CRM instance to serve as our organization wide ERP platform. The ERP project will replace two legacy applications, moving their functionality to Salesforce. Working with the IT team and the ERP Implementation partner, you will help translate business needs into effective and scalable solutions within the Salesforce environment. Responsible for design and development of customizations, extensions, configurations, and integrations. The Salesforce Developer will be in charge of design, development, testing, and change management. Drive highly visible Salesforce initiatives across the organization including building applications on the Force.com platform and supporting integrations with Salesforce.RESPONSIBILITIESBuild Salesforce applications using Apex and Visualforce and leverage the full capabilities of the Salesforce platform to support the company's programs.Create/modify existing controllers, controller extensions, and triggers across all platforms.Develop highly interactive UI using Visualforce, JavaScript and JQuery technologies.Develop custom applications using Salesforce. com and integrating salesforce.com with other systems.Apply best practices and design patterns of best-of-breed applications developed on the Salesforce. com platform.Create and execute unit, integration and user acceptance test plans, including use cases and test data.Gather, analyze and document functional and technical requirements for new projects, enhancements to existing solutions and production issues reported by end users.Performs additional duties, as required. EXPERIENCE & QUALIFICATIONSBachelor's Degree from an accredited college or university in Computer Science, Engineering or related technical field.Minimum 3 years’ experience with Force.com developer toolkit – Apex, VisualForce, Force.com IDE, Form.com Migration Tool, Web Services/SOA & Metadata APIsProficiency with Salesforce.com development including modification of standard objects and fields and creation of custom objects and fieldsApex and Visualforce development, design, configuration, testing and deployment of Salesforce.com solutionsExperience in customization, configuration, Eclipse IDE, Apex, Visualforce pages with JavaScript and tools like Apex Data loader, and WorkbenchIn depth knowledge of REST/SOAP APIs, Dell Boomi and experience building integrations with Salesforce.comCOMPENSATIONLISC offers a competitive salary and excellent benefits.To apply, please send cover letter and resume via email MRosoff@lisc.org LISC IS AN EQUAL OPPORTUNITY EMPLOYERCOMMITTED TO DIVERSITY AND INCLUSION",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/72bdb90572c2415ab7e0b1e5fcec9096-salesforce-developer-local-initiatives-support-corporation-new-york"
    },
    {
        "position": "SQL Business Intelligence Developer/Analyst",
        "company": "Local Initiatives Support Corporation",
        "description": "Position Title:              SQL Business Intelligence Developer/AnalystReports To:                    Lead Developer & ArchitectJob Classification:     Exempt / Full TimeLocation:                        LISC Headquarters Office, New York, NYTHE ORGANIZATIONWhat We DoWith residents and partners, LISC forges resilient and inclusive communities of opportunity across America – great places to live, work, visit, do business and raise families.Strategies We PursueEquip talent in underinvested communities with the skills and credentials to compete successfully for quality income and wealth opportunities.Invest in businesses, housing and other community infrastructure to catalyze economic, health, safety and educational mobility for individuals and communities.Strengthen existing alliances while building new collaborations to increase our impact on the progress of people and places.Develop leadership and the capacity of partners to advance our work togetherDrive local, regional, and national policy and system changes that foster broadly shared prosperity and well-being.Over the last 40 years, LISC and its affiliates have invested approximately $20 billion in businesses, affordable housing, health, educational mobility, community and recreational facilities, public safety, employment and other projects that help to revitalize and stabilize underinvested communities. Headquartered in New York City, LISC’s reach spans the country from East coast to West coast in 36 markets with offices extending from Buffalo to San Francisco. Visit us at www.lisc.orgABOUT THE DEPARTMENTThe Information Technology (IT) Department manages and maintains all technology systems for ~450 staff dispersed across 35 offices.ABOUT THE POSITION:The SQL Business Intelligence Developer/Analyst will report to the Lead Developer & Architect and play an integral role in the Application Development team, located at the NYC headquarters. This position will be responsible for data collection, transformation and data management using best practices established. The position will work closely with other business units to gather requirements, formulate request documents, implement and deliver business intelligence and reporting solutions in collaboration with their supervisor. In addition, the role will be required to fulfill ongoing ad-hoc request demands.IT is currently working on a data centralization project that will replace two legacy applications and move their functionality to Salesforce, which is currently being used for fundraising and CRM. One key component of this project is the development of a centralized data repository to allow for flexible reporting across all applications.LISC offers the opportunity to put your experience in programming, design and development of data warehouse (DW) models, ETL transformations, and Business Intelligence reporting to help transform LISC’s ability to manage and effectively report on data across the enterprise.RESPONSIBILITIES:The position will be responsible for providing enterprise-wide business intelligence and MDM expertise with emphasis on data design, access, usage, security and quality of information assets. The SQL Business Intelligence Programmer Analyst will work collaboratively with members of the Application Development team and business management to design and develop reporting systems and structures to support critical processes and systems, which currently involves NetSuite, Salesforce and Adaptive, as well as other applications across the enterprise. This position will develop detailed specifications (requirements) and BI artifacts that provide accessible information for decision-making. With minimum supervision, the SQL Business Intelligence Programmer Analyst will also facilitate use of data to solve organizational problems through development of reports, stored procedures, and SQL objects supporting analysis and data visualization. Responsibilities Define and implement database solutions to manage how data will be stored, consumed, integrated and managed across the enterprise by different business applications and users.Work with business and IT teams to manage data integration between applications and develop and maintain mappings/rules between business applications and business data and interfaces.Map configurations and complex data architectures, ensuring documentation meets current and forecasted needs.Design and develop complex data models, queries and reports.Provide information about the data definitions, schemas and lineageCollaborate on adhering to data security policies & best practices.Serve as the liaison between the department leaders and application developers.Collaborate and work with end users to ensure that data and reports meet their business needsWork with IT and other business units on the roll out of Domo, LISC’s BI tool for delivering consolidated reporting solutions.Organize and conduct Domo and other trainings as needed.Work with business management and other stakeholders to gather, understand and document business processes and project requirements, and to translate them into business application and Domo-based solutions.Prepare professional technical documentation.Think analytically, utilize creative thinking skills, as well as problem solving, and design skills.Keep abreast of technology trends and best practices in data management and governance in order to propose improvements and technology advancementsQUALIFICATIONS:Bachelor’s degree from an accredited college or university in Computer Science, Information Technology or related field.Minimum 5 years of experience in IT with data warehousing or business intelligence applications.Minimum 3 years of experience with Domo, Tableau or other data visualization tools.Extensive knowledge of Master Data Management (MDM) systems.Experience in Data Modeling, Data Architecture and Data GovernanceStrong experience with TSQL, SSIS and SSRS (4+ years)Familiarity with DOMO Workbench preferred. Excellent knowledge & skills in data analysis, data modeling, data profile and data management of structured and unstructured data. Experience in database design, from conceptualization to database optimization.Proven ability to work collaboratively and communicate complex ideas to all audiences.Exceptional problem solving techniques. Strong attention to detail.Maintain a flexible work schedule in order to respond to the department’s needs or emergencies as they arise.Excellent communication and customer service skills.Problem solve analytically and creatively Exceptional design skills.CompensationLISC offers a competitive salary and excellent benefits.To apply, please send cover letter and resume via email to: srahman@lisc.org LISC IS AN EQUAL OPPORTUNITY EMPLOYERCOMMITTED TO DIVERSITY AND INCLUSION",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/f6535017828241a8accbb1db9fe61a82-sql-business-intelligence-developeranalyst-local-initiatives-support-corporation-new-york"
    },
    {
        "position": "Hiring High School Teachers! (All Content Areas)",
        "company": "New Visions for Public Schools",
        "description": "DescriptionThe Support You Need for the Career You Want. About UsNew Visions for Public Schools was founded in 1989 and is dedicated to ensuring that all New York City public school students, regardless of race or economic class, have access to a high-quality education that prepares them for the rigors of college and the workforce. New Visions has been a driving force behind some of the most significant reforms to public education in New York city, including pioneering the model of small high schools in New York City and creating nearly 150 new small schools; producing free open-source curriculum used by thousands of teachers in New York State and across the country; and launching a nationally-recognized Urban Teacher Residency program to train new teachers. New Visions currently supports 709 schools citywide with school management tools, instructional resources and coaching, and more. This includes 10 charter high schools in Brooklyn, the Bronx, and Queens; and 71 district high schools in all five boroughs that are part of our Affinity network. In 2018-19, graduation rates in our Charter and Affinity networks were 89.7% and 85.6% and our college readiness rates were 54.9% and 61.5%. Advantages of Teaching at a New Visions School Include:Emphasis on knowledge sharing practices, frequent trainings and targeted professional development opportunitiesEligibility to apply for grants and fellowships to support the personal and professional development of exceptional teachersAccess to leadership development programs and career opportunities from the classroom to school administration to educational reformHighly competitive compensation and benefitsNew Visions equips teachers with the data tools they need to succeed. Position SummaryNew Visions seeks the most talented and dedicated educators to bring their skills, experience, and energy to a collaborative and innovative learning environment where teachers are empowered to meet each student's unique learning needs and open the doors to new and rich opportunities. Our teachers are dynamic and innovative pedagogues who are committed to urban students and the issues they face every day.Every New Visions teacher can expect to receive enhanced instructional support, a range of professional development opportunities and the opportunity to be part of a passionate team of colleagues. If you have the following qualities, credentials and experience, please consider joining our team.QualificationsSuccessful New Visions teaching candidates will:Approach learning via growth mindsetBe reflective, seek feedback, learn from those around them, and effectively apply feedbackMake informed decisions, based on evidence and data, about their lesson planningDemonstrate strong content knowledge and be familiar with the Common Core State StandardsHave a proven track record for planning lessons with clear learning objectives and a means for assessing whether those objectives have been metHave a proven track record for engaging students in their own learningHave strong organizational and communication skillsHave demonstrated success in tailoring instruction to the needs of diverse learnersBe committed to serving all students and respect children from all backgroundsDemonstrate an ability to work collaboratively with others to achieve common goalsTo see a list of our district schools, click here.To see each of our charter schools, please click on the links below:New Visions Charter High School for Advanced Math and ScienceNew Visions Charter High School for the HumanitiesNew Visions Charter High School for Advanced Math and Science IINew Visions Charter High School for the Humanities IINew Visions Charter High School for Advanced Math and Science IIINew Visions Charter High School for the Humanities IIINew Visions Charter High School for Advanced Math and Science IVNew Visions Charter High School for the Humanities IV New Visions AIM Charter High School INew Visions AIM Charter High School IINew Visions for Public Schools is looking for teachers certified in Grades 7 through 12 in the following subject areas:BiologyChemistryCTE (Computer Science and Graphic Design)Earth ScienceEnglish Language ArtsEnglish as a Second/New LanguageForeign Language (All Concentrations)MathematicsPhysicsSocial StudiesSpecial EducationApply today at: https://grnh.se/d2bbde961Additionally, candidates must have at least a Bachelor’s degree, hold valid New York State certification*, and must be cleared for employment by fingerprint-supported background checks. We are committed to diversity in our hiring and employment practices, and encourage all qualified candidates to apply.*There are limited opportunities for qualified teachers who do not possess a NY State certification to work in one of our Charter High Schools.New Visions for Public Schools is an equal opportunity employer. It is the policy of New Visions that all employees and applicants for employment will be treated in all respects on the basis of their merit and qualifications and without regards to their race, color, national origin, age, disability, sexual orientation, religion, gender, military status, marital status, ancestry, or any other reason prohibited by law. New Visions believes that our teams should reflect the diverse communities we serve and that our culture and internal structures should be inclusive and equitable for all employees. We also recognize that perspectives from communities that have been historically marginalized are critical to the work we do. Hence, we strongly encourage applications from individuals living in the communities that we serve or who are members of historically marginalized communities. New Visions provides a comprehensive and competitive compensation and benefits package in addition to the opportunity to make a significant impact on education reform and in the lives of urban youth.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/96828a5c1dde417f898560f94ea840c9-hiring-high-school-teachers-all-content-areas-new-visions-for-public-schools-new-york"
    },
    {
        "position": "Jr. Application Developer, Information Technology Services",
        "company": "UJA-Federation of New York",
        "description": "About us:UJA-Federation of New York is the largest local philanthropy in the world. For more than 100 years, we’ve brought New Yorkers together to solve some of the most pressing problems facing our community. Thanks to our network of hundreds of non-profits, we can leverage our expertise across any number of areas — including health and human services, arts and culture, and education — to care for Jews everywhere and New Yorkers of all backgrounds, respond to crises close to home and far away, and shape our Jewish future. Our reach extends from New York to Israel to nearly 70 other countries around the world, touching 4.5 million people each year.Position Summary:Do you love to solve problems? Do you have a passion for coding? UJA Federation of NY is looking for a dedicated individual to join our software development team, creating software for our in-house CRM system that drives the success of our company.This collaborative position will be involved in product design, software development, testing, roll out and support of new features to our users. This position will develop solutions across the full-stack of our technology and will impact both the client-side and server environment.Responsibilities:Write code to deliver new features and correct coding defect on existing software. Software involved are written using C#, WPF, SQL Server, React and TypescriptWork with business analyses and other developers on feature and coding designLearn and utilize our existing codebase to write clean and highly maintainable code that adhere to the coding standards of the organizationWrite Unit TestsPerform Code ReviewMaintain existing software systems by identifying and correcting software defectsCreate and deliver data-driven SSRS reportsTechnical Qualifications:At least 1 year of solid coding experience in C# .NET SQL Web API/WPF TypescriptGood understanding of Object-Oriented design patterns, data structures, collections and Multi-threaded ProgrammingProficient in N-tier application designProficient writing stored procedures in T-SQLA Bachelor’s degree in Computer Science, Information Systems or related fieldOther Qualifications:Fast learnerStrong analytical skillsAbility to successfully work in a team environment and communicate clearlyMust have a desire to learn new technologies and love writing codeAbility to function in a fast paced environment handling multiple projects at the same timeDesired:C#, WPF MVVM, Telerik WPF Controls, SQL Server, GIT, Web API, Kafka, Jenkins, Entity Framework, React, Typescript, SSRS, Github, JIRAExperience designing user interfacesExperience writing SSRS ReportsNot-for-profit industry experienceKnowledge of Windows and Linux Environment",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/ced160ff3a1647fa861c8f56cced60b1-jr-application-developer-information-technology-services-uja-federation-of-new-york-new-york"
    },
    {
        "position": "IT Help Desk Associate",
        "company": "Foundation for a Just Society",
        "description": "Reports to: IT AdministratorDirect Reports: NoneFLSA Status: Non-ExemptORGANIZATIONAL OVERVIEWFoundation for a Just Society (FJS) envisions a world where all people are equally valued and lead self-determined lives. It advances the rights of women, girls, and LGBTQI people and promotes gender and racial justice by ensuring those most affected by injustice have the resources they need to cultivate the leadership and solutions that transform our world.FJS makes grants to local, national, regional, and global organizations and networks with an emphasis on Francophone West Africa, Mesoamerica, South and Southeast Asia, and the US Southeast. The foundation supports efforts that advance long-term, structural change and meet immediate needs that enable women, girls, and LGBTQI people most affected by injustice to be leaders, strategists, and agents of change.POSITION SUMMARYThe IT Help Desk Associate is responsible for assisting the IT Administrator with the management, support, strategy, and execution of IT infrastructure for FJS and through service agreement for other entities including, but not limited to, Felicity House, Nick Simons Foundation, and MJS Foundation.ESSENTIAL DUTIES + RESPONSIBILITIESKey responsibilities include, but are not limited to:Technical Support:Provide technical assistance and support for incoming inquiries and issues related to computer systems, software, and hardware.Diagnose and resolve system errors, network problems, and other computer systems issues.Respond to inquiries via chat, email, or phone. Ask questions to determine the nature of the problem and walk staff through problem-solving processes.Remotely access hardware or software for staff to make changes and fix problems.Follow up with staff to ensure full resolution of issues.Install, update, configure, or repair hardware, software, and operating systems.Resolve technical problems with Local Area Networks (LAN), Wide Area Networks (WAN), and other systems.Install and configure computer peripherals for users.Provide entry-level website support – Wordpress, image editing, and video editing.Monitoring and Reporting:Maintain optimal daily performance of computer systems.Monitor operations of devices and systems such as copy machines, NAS, servers, data backups, and antivirus. Generate reports to analyze common complaints and problems.Request feedback and/or monitor calls and other methods of correspondence to improve support and training methods.Other Related Duties:Train staff members on ways to self-troubleshoot and self-diagnose problems.Review training manuals and other IT documentation to suggest edits as needed.Stay informed on current related news, trends, and best practices.Research and suggest new ways to improve systems.Train staff on proper use and best practices for any software and hardware used.Ad hoc projects – work with IT Administrator and other departments to assist with their projects, as needed.Perform any other duties or tasks as assigned.QUALIFICATIONSMinimum of two years experience in IT support role.Excellent customer service and communication skills.Excellent troubleshooting skills.Experience in configuring and troubleshooting Apple products including MacBook Pro, iPad, and iPhone.Experience working with Windows and Synology servers.Experience working with software packages and platforms such as Microsoft Office, Google Suite, video conferencing solutions, and remote desktop software.Working knowledge with networking configuration.Strong familiarity with digital security best practices.Highly professional and able to maintain tact and confidentiality at all times.Eligibility to work in the United States.PREFERRED ASSETSExperience working or volunteering in the women’s human rights and social justice movements and/or philanthropy.Associate degree in computer science or related field.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/20806d16a6554b01a2e8ff1c4a796a68-it-help-desk-associate-foundation-for-a-just-society-new-york"
    },
    {
        "position": "Middle School & High School English Language Arts Teachers for the 2020-21 School Year",
        "company": "Unity Preparatory Charter School of Brooklyn",
        "description": "START DATE: Preparation for the 2020-21 School Year Begins in the Summer of 2020Overview of Position: A strong and dedicated faculty is paramount to best serving our students and families and to establishing Unity as an exemplary school. Most critically, our faculty equip students with the knowledge and skills needed, including the desire and capacity to learn independently, think critically, and communicate proficiently, to experience secondary and postsecondary success. Our English Language Arts Teachers have the privilege and responsibility of delivering on these outcomes as they advance students’ knowledge and skills as powerful readers and writers.Overview of Unity - Our Model and Approach: Unity Preparatory Charter School of Brooklyn (Unity) is a tuition-free, open-enrollment, independent charter school that offers a progressive education in the liberal arts & sciences to over 600 students in grades 6-12. As a community-based school, we proudly serve the communities of central Brooklyn in New York City. Our middle school and high school campuses are located in the neighborhoods of Bedford Stuyvesant and Williamsburg, respectively. Unity’s mission is to empower students as scholars and citizens so they may lead fulfilling academic, personal, and professional lives. We accomplish our mission through the integration of seven key elements that serve as the backbone of our school’s design. Collectively, these elements reflect our beliefs on what makes for an exceptional secondary education in today’s world:A Grades 6-12 College Preparatory Curriculum:​ a college-preparatory liberal arts and sciences program of study in mathematics, English language arts (ELA), science, and history that fosters in students the desire and capacity to learn independently, think critically, and communicate proficiently so that they are fully prepared to succeed in their postsecondary studiesExcellent Teaching:​ ​​an enthusiastic faculty of expert educators who are demonstrably successful in promoting student learning, couple high expectations with high support, go above and beyond the call of duty for students as scholars and as citizens, and serve as role models for students as life-long learners and as individuals who take the utmost pride in perfecting their craftMore Time for Learning:​ ​​an extended day, week, and year that provide approximately 20% more time than the local district average for academic enrichment and extracurricular activities that deepen learning and engagement, accelerate academic growth, and expose students to new pursuitsIntensive and Differentiated Academic Support:​ customized settings and support provided by caring specialists for remediation and acceleration, including small class sizes, integrated co-teaching, literacy interventions, after-school and weekend tutoring, as well as advanced-level course offerings at our middle school and high schoolAmple Enrichment Courses and Extra-Curricular Activities:​ enrichment courses in the performing arts, visual arts, computer science, and foreign languages, as well as elective clubs, athletic teams, internships, and other “beyond-the-classroom” activities that serve to reinforce what students learn in their core courses, accommodate individual student interests, and develop important professional and citizenship skills through real-world, meaningful applicationA Positive and Supportive School Culture:​ ​​a culture built on a framework of Positive Behavioral Interventions & Supports (PBIS) in which compassionate adults explicitly guide students in the following: modeling the behaviors that contribute to a positive and productive learning environmentdeveloping socio-emotional skills needed to be successful, including how to manage emotions, reduce stress, make healthy decisions, and learn from one’s mistakesActive Family and Community Involvement: ample opportunities for family engagement and community service that promotes open communication, meaningful collaboration, and active involvement and service within Unity’s community and beyondOur Recent Accomplishments: Regardless of where students are academically or otherwise as they enter our school, our focus is on accelerating growth and on cultivating long-term academic and non-academic success. This focus has reaped impressive results for our students and families in recent years. Among our accomplishments:Our 8th grade students have consistently outperformed their district peers in mathematics and ELA on state exams.Our students who comprise subgroups that are traditionally least effectively served by our education system, including students classified as economically disadvantaged, black, Latino, and students with disabilities, have consistently outperformed their district and state peers on state exams.Approximately 75% of our high school upperclassmen enroll in at least one Advanced Placement (AP) course each year. This compares favorably with the 33% of NYC graduates who enroll in AP courses during their high school tenure.In holding true to our belief in providing a truly empowering education:90% of our students participated in an afternoon extra-curricular activity.80% of our students participated in a formal community service initiative.90% of students successfully completed their end-of-year Roundtable presentation, a 45-minute oral presentation given to families, Unity faculty, and community members.100% of high school students completed a full-year course in college and career readiness.Core Responsibilities: Key responsibilities of Unity’s English Language Arts Teachers include but are not limited to the following:Plan a rigorous and engaging curricula that caters to the unique physical talents, needs, and multiple intelligences of studentsCollaborate in the planning and implementation of a rigorous and engaging curricula that cater to the unique physical talents, needs, and multiple intelligences of studentsExecute specially designed lesson plans that are guided by clear objectives, focus on conceptual understanding, and that are assessed routinely for student masteryProvide remediation and acceleration based on formative and summative assessments so that individual students are appropriately challenged according to their zones of proximal developmentCollaborate with colleagues to create, implement, and refine schoolwide and classroom-based systems, routines, and procedures Ensure that classroom time is utilized through sound management practices and by developing strong and trusting relationships with studentsDevelop, implement, and/or manage individualized behavioral intervention plans to support students meeting established academic and non-academic goalsActively participate in opportunities to strengthen their own pedagogical skills as well as contribute to the learning of colleaguesContribute to the school’s smooth and efficient operation by fulfilling required administrative duties and responsibilities and maintaining open and proactive communication with colleaguesBuild strong relationships with students and families as an Advisor and through consistent communication and in following through on commitmentsAs professionals, all Unity teachers may participate in the school’s innovative teacher-career ladder, which provides a formal and transparent pathway for teachers to: develop their craft and improve as educators through multiple forms of support and training assume titles with commensurate responsibilities while remaining classroom practitioners be generously compensated and formally recognized for their positive contributions to the school. For more information on our unique professional ladder and a teaching career at Unity, visit: http://www.unityprep.org/careers/why-teach-at-unity/Core Qualifications: An ideal candidate for this position is equipped with:At least two years of formal teaching experience in New YorkA proven track record in accelerating student growth and masteryA demonstrated capacity to plan rigorous and engaging curricula that align to Common Core standards using the Understanding by Design frameworkA balance of high expectations and high support, a growth mindset, and an innate joy in working with adolescentsStrong interpersonal and classroom/course management skillsAn openness and responsiveness to constructive feedback and a strong commitment to continuous improvement and professional growthA strong work ethic that features organization, multi-tasking, flexibility, an orientation toward solutions, and a pride in meeting deadlinesExpertise in working with diverse populations of students and families, and in differentiating instruction to fully support the needs of diverse learnersApproaches the profession with maturity, humility, versatility and, of course, a sense of humorA Master’s Degree and certified as a teacher in New York",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/fa0c4789e07242f2bc3d2162f0219c71-middle-school-high-school-english-language-arts-teachers-for-the-2020-21-school-year-unity-preparatory-charter-school-of-brooklyn-brooklyn"
    },
    {
        "position": "Director of Finance",
        "company": "Unity Preparatory Charter School of Brooklyn",
        "description": "Overview of Position: Our Director of Finance is an essential member of our staff and faculty. They manage the school's finances and ensure its fiscal health. As they manage the school’s finances, they demonstrate high levels of professionalism with all parties, excellent organization skills, consistency and reliability, and grace under pressure. In doing so, they fulfill a role that is critical to Unity in delivering on its mission.Overview of Unity - Our Model and Approach: Unity Preparatory Charter School of Brooklyn (Unity) is a tuition-free, open-enrollment, independent charter school that offers a progressive education in the liberal arts & sciences to over 600 students in grades 6-12. As a community-based school, we proudly serve the communities of central Brooklyn in New York City. Our middle school and high school campuses are located in the neighborhoods of Bedford Stuyvesant and Williamsburg, respectively. Unity’s mission is to empower students as scholars and citizens so they may lead fulfilling academic, personal, and professional lives. We accomplish our mission through the integration of seven key elements that serve as the backbone of our school’s design. Collectively, these elements reflect our beliefs on what makes for an exceptional secondary education in today’s world: 1.    A Grades 6-12 College Preparatory Curriculum:​ a college-preparatory liberal arts and sciences program of study in mathematics, English language arts (ELA), science, and history that fosters in students the desire and capacity to learn independently, think critically, and communicate proficiently so that they are fully prepared to succeed in their postsecondary studies 2.    Excellent Teaching:​ ​​an enthusiastic faculty of expert educators who are demonstrably successful in promoting student learning, couple high expectations with high support, go above and beyond the call of duty for students as scholars and as citizens, and serve as role models for students as life-long learners and as individuals who take the utmost pride in perfecting their craft 3.    More Time for Learning:​ ​​an extended day, week, and year that provide approximately 20% more time than the local district average for academic enrichment and extracurricular activities that deepen learning and engagement, accelerate academic growth, and expose students to new pursuits 4.    Intensive and Differentiated Academic Support:​ customized settings and support provided by caring specialists for remediation and acceleration, including small class sizes, integrated co-teaching, literacy interventions, after-school and weekend tutoring, as well as advanced-level course offerings at our middle school and high school 5.    Ample Enrichment Courses and Extra-Curricular Activities:​ enrichment courses in the performing arts, visual arts, computer science, and foreign languages, as well as elective clubs, athletic teams, internships, and other “beyond-the-classroom” activities that serve to reinforce what students learn in their core courses, accommodate individual student interests, and develop important professional and citizenship skills through real-world, meaningful application 6.    A Positive and Supportive School Culture:​ ​​a culture built on a framework of Positive Behavioral Interventions & Supports (PBIS) in which compassionate adults explicitly guide students in the following:o      modeling the behaviors that contribute to a positive and productive learning environmento      developing socio-emotional skills needed to be successful, including how to manage emotions, reduce stress, make healthy decisions, and learn from one’s mistakes 7.    Active Family and Community Involvement: ample opportunities for family engagement and community service that promotes open communication, meaningful collaboration, and active involvement and service within Unity’s community and beyond Our Recent Accomplishments: Regardless of where students are academically or otherwise as they enter our school, our focus is on accelerating growth and on cultivating long-term academic and non-academic success. This focus has reaped impressive results for our students and families in recent years. Among our accomplishments:●     Our 8th grade students have consistently outperformed their district peers in mathematics and ELA on state exams.●     Our students who comprise subgroups that are traditionally least effectively served by our education system, including students classified as economically disadvantaged, black, Latino, and students with disabilities, have consistently outperformed their district and state peers on state exams.●     78% of our founding 11th graders are presently enrolled in at least one Advanced Placement (AP) course. This compares favorably with the 33% of NYC graduates who enroll in AP courses during their high school tenure.●     In holding true to our belief in providing a truly empowering education:o      90% of our students participated in an afternoon extra-curricular activity.o      80% of our students participated in a formal community service initiative.o      90% of students successfully completed their end-of-year Roundtable presentation, a 45-minute oral presentation given to families, Unity faculty, and community members.o      100% of high school students completed a full-year course in college and career readiness. Core Responsibilities: Key responsibilities of Unity’s Director of Finance & Development include but are not limited to the following:●     Managing the annual budget for the school and related documents to forecast financial metrics, goals, and contingency plans in a solutions-oriented and timely manner●     Providing oversight of the school’s day-to-day financial management, including accounts payable, accounts receivable, grants management, and the general ledger in accordance with Generally Accepted Accounting Principles●     Bookkeeping duties for school-based revenues and expenses, including bank deposits●     Preparing financial reports for the New York State Education Department, Head of School, and Board of Trustees, including the preparation of monthly financial statements for monthly board meetings●     Creating and maintaining detailed systems for financial backup documentation●     Administering payroll and 403(b) benefit/contributions and pre-tax transit and childcare benefit/contribution, along with the management of yearly W2 creation●     Managing all financial audits and 990 preparation with external auditors and the yearly closing process●     Issuing tax notices (1099’s) to vendors and contractors as required●     Contributing to the school’s smooth and efficient operation by fulfilling required administrative duties and responsibilities, including maintaining open and proactive communication with colleaguesCore Qualifications: The ideal candidate for this position is equipped with:●     A Master’s Degree and at least three years of experience in a management/operations/finance role●     A Certified Public Accountant qualification●     Extensive experience in financial modeling, reporting, and excellent quantitative skills●     Experience in leading development and fundraising initiatives●     Budget development and implementation in a complex organization●     An openness and responsiveness to constructive feedback and a strong commitment to continuous improvement and professional growth●     A strong work ethic that features organization, multi-tasking, flexibility, an orientation toward solutions, and a pride in meeting deadlines●     Expertise in a nonprofit setting, including working with diverse populations of students and families●     Strong written and oral communication skills and experience working collaboratively in team settings●     Approaches the profession with maturity, humility, versatility (i.e., embraces the ambiguity and excitement associated with start-ups), of course, a sense of humor",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/c02caa4cfdda4a818d0f80ecb419ecb7-director-of-finance-unity-preparatory-charter-school-of-brooklyn-brooklyn"
    },
    {
        "position": "School Operations Manager",
        "company": "Unity Preparatory Charter School of Brooklyn",
        "description": " Overview of Position: Our Manager of Operations is an essential member of our school team. They manage the school's daily operations, which includes managing the school's operations team and administrative office. They demonstrate high levels of professionalism and urgency with all parties, excellent organization skills, consistency and reliability, and grace under pressure. In doing so, they ensure operational excellence every day, which is critical to Unity in delivering on its mission: empowering students as scholars and citizens so they may lead fulfilling academic, personal, and professional lives. Overview of Unity - Our Model and Approach: Unity Preparatory Charter School of Brooklyn (Unity) is a tuition-free, open-enrollment, independent charter school that offers a progressive education in the liberal arts & sciences to over 600 students in grades 6-12. As a community-based school, we proudly serve the communities of central Brooklyn in New York City. Our middle school and high school campuses are located in the neighborhoods of Bedford Stuyvesant and Williamsburg, respectively. Unity’s mission is to empower students as scholars and citizens so they may lead fulfilling academic, personal, and professional lives. We accomplish our mission through the integration of seven key elements that serve as the backbone of our school’s design. Collectively, these elements reflect our beliefs on what makes for an exceptional secondary education in today’s world: 1.    A Grades 6-12 College Preparatory Curriculum:​ a college-preparatory liberal arts and sciences program of study in mathematics, English language arts (ELA), science, and history that fosters in students the desire and capacity to learn independently, think critically, and communicate proficiently so that they are fully prepared to succeed in their postsecondary studies 2.    Excellent Teaching:​ ​​an enthusiastic faculty of expert educators who are demonstrably successful in promoting student learning, couple high expectations with high support, go above and beyond the call of duty for students as scholars and as citizens, and serve as role models for students as life-long learners and as individuals who take the utmost pride in perfecting their craft 3.    More Time for Learning:​ ​​an extended day, week, and year that provide approximately 20% more time than the local district average for academic enrichment and extracurricular activities that deepen learning and engagement, accelerate academic growth, and expose students to new pursuits 4.    Intensive and Differentiated Academic Support:​ customized settings and support provided by caring specialists for remediation and acceleration, including small class sizes, integrated co-teaching, literacy interventions, after-school and weekend tutoring, as well as advanced-level course offerings at our middle school and high school 5.    Ample Enrichment Courses and Extra-Curricular Activities:​ enrichment courses in the performing arts, visual arts, computer science, and foreign languages, as well as elective clubs, athletic teams, internships, and other “beyond-the-classroom” activities that serve to reinforce what students learn in their core courses, accommodate individual student interests, and develop important professional and citizenship skills through real-world, meaningful application 6.    A Positive and Supportive School Culture:​ ​​a culture built on a framework of Positive Behavioral Interventions & Supports (PBIS) in which compassionate adults explicitly guide students in the following:o      modeling the behaviors that contribute to a positive and productive learning environmento      developing socio-emotional skills needed to be successful, including how to manage emotions, reduce stress, make healthy decisions, and learn from one’s mistakes 7.    Active Family and Community Involvement: ample opportunities for family engagement and community service that promotes open communication, meaningful collaboration, and active involvement and service within Unity’s community and beyond Our Recent Accomplishments: Regardless of where students are academically or otherwise as they enter our school, our focus is on accelerating growth and on cultivating long-term academic and non-academic success. This focus has reaped impressive results for our students and families in recent years. Among our accomplishments:●     Our 8th grade students have consistently outperformed their district peers in mathematics and ELA on state exams.●     Our students who comprise subgroups that are traditionally least effectively served by our education system, including students classified as economically disadvantaged, black, Latino, and students with disabilities, have consistently outperformed their district and state peers on state exams.●     Approximately 80% of our founding 12th graders have completed at least one Advanced Placement (AP) course. This compares favorably with the 33% of NYC graduates who enroll in AP courses during their high school tenure.●     In holding true to our belief in providing a truly empowering education:o      90% of our students participated in an afternoon extra-curricular activity.o      80% of our students participated in a formal community service initiative.o      90% of students successfully completed their end-of-year Roundtable presentation, a 45-minute oral presentation given to families, Unity faculty, and community members.o      100% of high school students completed a full-year course in college and career readiness. Core Responsibilities: Key responsibilities of our Middle School Manager of Operations include:●     Manages a team of school operations professionals in overseeing all logistics for school-wide events, stakeholder communications, interior aesthetics, safety, student records, technology, and inventory management●     Champions and upholds all operational policies, procedures, and communications across the school community●     Ensures operational excellence and high level of detail in all areas of operations●     Establishes and maintains strong relationships and communication with all stakeholders, including staff, faculty, families and community partners, in alignment with the school’s mission●     Reports directly to the Middle School Co-Principal of Culture & OperationsCore Qualifications: An ideal candidate for this position is equipped with:●     At least 2 years of experience as an Operations Manager in a school or a comparable position in a comparable organization - explicit experience in leading and managing adults and teams●     A strong work ethic that features preparation, organization, multi-tasking, flexibility, an orientation toward solutions, and a pride in meeting deadlines●     Excellent verbal and written communication skills; strong interpersonal skills with students, parents, colleagues, and community members; experience working collaboratively in team settings●     Demonstrates high levels of professionalism and urgency with all parties, excellent organization skills, consistency and reliability, and grace under pressure●     An openness to giving and receiving constructive feedback and a strong commitment to continuous improvement and professional growth●     A balance of high expectations and high support, a growth mindset, and an innate joy in serving families and adolescents●     Approaches the profession with maturity, humility, versatility, of course, a sense of humor●     Fluency in Spanish preferred",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/7ae58ec347b344e5887ee1714c921064-school-operations-manager-unity-preparatory-charter-school-of-brooklyn-brooklyn"
    },
    {
        "position": "Chairperson of the Mathematics Department",
        "company": "Unity Preparatory Charter School of Brooklyn",
        "description": "Overview of Position: A strong and dedicated faculty is paramount to best serving our students and families and to establishing Unity as an exemplary school. Most critically, our faculty equip students with the knowledge and skills needed, including the desire and capacity to learn independently, think critically, and communicate proficiently, to experience secondary and postsecondary success. Our Chairperson of the Middle School Mathematics Department has the privilege and responsibility of leading our team of social science teachers in the delivery of these outcomes as they advance students’ knowledge and skills as burgeoning social scientists and informed members of society. Overview of Unity - Our Model and Approach: Unity Preparatory Charter School of Brooklyn (Unity) is a tuition-free, open-enrollment, independent charter school that offers a progressive education in the liberal arts & sciences to over 600 students in grades 6-12. As a community-based school, we proudly serve the communities of central Brooklyn in New York City. Our middle school and high school campuses are located in the neighborhoods of Bedford Stuyvesant and Williamsburg, respectively. Unity’s mission is to empower students as scholars and citizens so they may lead fulfilling academic, personal, and professional lives. We accomplish our mission through the integration of seven key elements that serve as the backbone of our school’s design. Collectively, these elements reflect our beliefs on what makes for an exceptional secondary education in today’s world: 1.    A Grades 6-12 College Preparatory Curriculum:​ a college-preparatory liberal arts and sciences program of study in mathematics, English language arts (ELA), science, and history that fosters in students the desire and capacity to learn independently, think critically, and communicate proficiently so that they are fully prepared to succeed in their postsecondary studies 2.    Excellent Teaching:​ ​​an enthusiastic faculty of expert educators who are demonstrably successful in promoting student learning, couple high expectations with high support, go above and beyond the call of duty for students as scholars and as citizens, and serve as role models for students as life-long learners and as individuals who take the utmost pride in perfecting their craft 3.    More Time for Learning:​ ​​an extended day, week, and year that provide approximately 20% more time than the local district average for academic enrichment and extracurricular activities that deepen learning and engagement, accelerate academic growth, and expose students to new pursuits 4.    Intensive and Differentiated Academic Support:​ customized settings and support provided by caring specialists for remediation and acceleration, including small class sizes, integrated co-teaching, literacy interventions, after-school and weekend tutoring, as well as advanced-level course offerings at our middle school and high school 5.    Ample Enrichment Courses and Extra-Curricular Activities:​ enrichment courses in the performing arts, visual arts, computer science, and foreign languages, as well as elective clubs, athletic teams, internships, and other “beyond-the-classroom” activities that serve to reinforce what students learn in their core courses, accommodate individual student interests, and develop important professional and citizenship skills through real-world, meaningful application 6.    A Positive and Supportive School Culture:​ ​​a culture built on a framework of Positive Behavioral Interventions & Supports (PBIS) in which compassionate adults explicitly guide students in the following:o      modeling the behaviors that contribute to a positive and productive learning environmento      developing socio-emotional skills needed to be successful, including how to manage emotions, reduce stress, make healthy decisions, and learn from one’s mistakes 7.    Active Family and Community Involvement: ample opportunities for family engagement and community service that promotes open communication, meaningful collaboration, and active involvement and service within Unity’s community and beyond Our Recent Accomplishments: Regardless of where students are academically or otherwise as they enter our school, our focus is on accelerating growth and on cultivating long-term academic and non-academic success. This focus has reaped impressive results for our students and families in recent years. Among our accomplishments:●     Our 8th grade students have consistently outperformed their district peers in mathematics and ELA on state exams.●     Our students who comprise subgroups that are traditionally least effectively served by our education system, including students classified as economically disadvantaged, black, Latino, and students with disabilities, have consistently outperformed their district and state peers on state exams.●     78% of our founding 11th graders are presently enrolled in at least one Advanced Placement (AP) course. This compares favorably with the 33% of NYC graduates who enroll in AP courses during their high school tenure.●     In holding true to our belief in providing a truly empowering education:o      90% of our students participated in an afternoon extra-curricular activity.o      80% of our students participated in a formal community service initiative.o      90% of students successfully completed their end-of-year Roundtable presentation, a 45-minute oral presentation given to families, Unity faculty, and community members.o      100% of high school students completed a full-year course in college and career readiness. Core Responsibilities: Unity’s Chairperson of the Middle School Mathematics Department has the privilege and responsibility of ensuring that our students acquire the essential knowledge and skills as mathematicians, as measured by academic growth and grade-level proficiency. To this end, key responsibilities of the Mathematics Chairperson include, but are not limited to, the following:●      Leads classroom instruction at dept. level / ensures high quality of classroom instruction at dept. level●      Leads in the development of MS-ready and engaging course curricula and standards-aligned, spiraled assessments at dept. level●      Builds, manages, and retains strong dept. team●      Trains, supports, and supervises teachers and learning specialists at dept. level – is responsible for developing teacher’s capacities in accordance with instructional vision●      Ensures that teachers and learning specialists at dept. level manage classrooms in accordance with classroom essentials●      Collaborates with Deans to support teachers in effectively managing students who consistently struggle behaviorally and are disruptive to classmates’ learning[1]●      Manages the utilization of formative and summative assessment data to drive instruction and student proficiency/growth at dept. levelCore Qualifications: An ideal candidate for this position is equipped with:●     At least two years of instructional leadership experience●     A proven track record in accelerating student growth and mastery●     A demonstrated capacity to plan rigorous and engaging curricula that align to Common Core standards using the Understanding by Design framework●     A balance of high expectations and high support, a growth mindset, and an innate joy in working with adolescents●     Strong interpersonal and adult management skills●     An openness to giving and receiving constructive feedback and a strong commitment to continuous improvement and professional growth●     A strong work ethic that features preparation, organization, multi-tasking, flexibility, an orientation toward solutions, and a pride in meeting deadlines●     Expertise in working with diverse populations of students and families, and in differentiating instruction to fully support the needs of diverse learners●     Strong written and oral communication skills and experience working collaboratively in team settings●     Approaches the profession with maturity, humility, versatility, of course, a sense of humor[1] Dept. chair, dean, and teacher collaborate in devising plan that effectively maintains high quality classroom environment in instances where students consistently struggle behaviorally and infringe negatively on the learning of others. The coach would focus on developing the teacher’s capacities and the dean would focus on developing the student’s capacities.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/6eba1be37eb24e528fc7b98ef0d14658-chairperson-of-the-mathematics-department-unity-preparatory-charter-school-of-brooklyn-brooklyn"
    },
    {
        "position": "Middle School & High School Science Teachers  for 2020-21 School Year",
        "company": "Unity Preparatory Charter School of Brooklyn",
        "description": "START DATE: Preparation for the 2020-21 School Year Begins in the Summer of 2020Overview of Position: A strong and dedicated faculty is paramount to best serving our students and families and to establishing Unity as an exemplary school. Most critically, our faculty equip students with the knowledge and skills needed, including the desire and capacity to learn independently, think critically, and communicate proficiently, to experience secondary and postsecondary success. Our Science Teachers have the privilege and responsibility of delivering on these outcomes as they advance students’ knowledge and skills as burgeoning scientists.Overview of Unity - Our Model and Approach: Unity Preparatory Charter School of Brooklyn (Unity) is a tuition-free, open-enrollment, independent charter school that offers a progressive education in the liberal arts & sciences to over 600 students in grades 6-12. As a community-based school, we proudly serve the communities of central Brooklyn in New York City. Our middle school and high school campuses are located in the neighborhoods of Bedford Stuyvesant and Williamsburg, respectively. Unity’s mission is to empower students as scholars and citizens so they may lead fulfilling academic, personal, and professional lives. We accomplish our mission through the integration of seven key elements that serve as the backbone of our school’s design. Collectively, these elements reflect our beliefs on what makes for an exceptional secondary education in today’s world:A Grades 6-12 College Preparatory Curriculum:​ a college-preparatory liberal arts and sciences program of study in mathematics, English language arts (ELA), science, and history that fosters in students the desire and capacity to learn independently, think critically, and communicate proficiently so that they are fully prepared to succeed in their postsecondary studiesExcellent Teaching:​ ​​an enthusiastic faculty of expert educators who are demonstrably successful in promoting student learning, couple high expectations with high support, go above and beyond the call of duty for students as scholars and as citizens, and serve as role models for students as life-long learners and as individuals who take the utmost pride in perfecting their craftMore Time for Learning:​ ​​an extended day, week, and year that provide approximately 20% more time than the local district average for academic enrichment and extracurricular activities that deepen learning and engagement, accelerate academic growth, and expose students to new pursuitsIntensive and Differentiated Academic Support:​ customized settings and support provided by caring specialists for remediation and acceleration, including small class sizes, integrated co-teaching, literacy interventions, after-school and weekend tutoring, as well as advanced-level course offerings at our middle school and high schoolAmple Enrichment Courses and Extra-Curricular Activities:​ enrichment courses in the performing arts, visual arts, computer science, and foreign languages, as well as elective clubs, athletic teams, internships, and other “beyond-the-classroom” activities that serve to reinforce what students learn in their core courses, accommodate individual student interests, and develop important professional and citizenship skills through real-world, meaningful applicationA Positive and Supportive School Culture:​ ​​a culture built on a framework of Positive Behavioral Interventions & Supports (PBIS) in which compassionate adults explicitly guide students in the following: modeling the behaviors that contribute to a positive and productive learning environmentdeveloping socio-emotional skills needed to be successful, including how to manage emotions, reduce stress, make healthy decisions, and learn from one’s mistakesActive Family and Community Involvement: ample opportunities for family engagement and community service that promotes open communication, meaningful collaboration, and active involvement and service within Unity’s community and beyondOur Recent Accomplishments: Regardless of where students are academically or otherwise as they enter our school, our focus is on accelerating growth and on cultivating long-term academic and non-academic success. This focus has reaped impressive results for our students and families in recent years. Among our accomplishments:Our 8th grade students have consistently outperformed their district peers in mathematics and ELA on state exams.Our students who comprise subgroups that are traditionally least effectively served by our education system, including students classified as economically disadvantaged, black, Latino, and students with disabilities, have consistently outperformed their district and state peers on state exams.Approximately 75% of our high school upperclassmen enroll in at least one Advanced Placement (AP) course each year. This compares favorably with the 33% of NYC graduates who enroll in AP courses during their high school tenure.In holding true to our belief in providing a truly empowering education:90% of our students participated in an afternoon extra-curricular activity.80% of our students participated in a formal community service initiative.90% of students successfully completed their end-of-year Roundtable presentation, a 45-minute oral presentation given to families, Unity faculty, and community members.100% of high school students completed a full-year course in college and career readiness.Core Responsibilities: Key responsibilities of Unity’s Science Teachers include but are not limited to the following:Plan a rigorous and engaging curricula that caters to the unique physical talents, needs, and multiple intelligences of studentsCollaborate in the planning and implementation of a rigorous and engaging curricula that cater to the unique physical talents, needs, and multiple intelligences of studentsExecute specially designed lesson plans that are guided by clear objectives, focus on conceptual understanding, and that are assessed routinely for student masteryProvide remediation and acceleration based on formative and summative assessments so that individual students are appropriately challenged according to their zones of proximal developmentCollaborate with colleagues to create, implement, and refine schoolwide and classroom-based systems, routines, and procedures Ensure that classroom time is utilized through sound management practices and by developing strong and trusting relationships with studentsDevelop, implement, and/or manage individualized behavioral intervention plans to support students meeting established academic and non-academic goalsActively participate in opportunities to strengthen their own pedagogical skills as well as contribute to the learning of colleaguesContribute to the school’s smooth and efficient operation by fulfilling required administrative duties and responsibilities and maintaining open and proactive communication with colleaguesBuild strong relationships with students and families as an Advisor and through consistent communication and in following through on commitmentsAs professionals, all Unity teachers may participate in the school’s innovative teacher-career ladder, which provides a formal and transparent pathway for teachers to: develop their craft and improve as educators through multiple forms of support and training assume titles with commensurate responsibilities while remaining classroom practitioners be generously compensated and formally recognized for their positive contributions to the school. For more information on our unique professional ladder and a teaching career at Unity, visit: http://www.unityprep.org/careers/why-teach-at-unity/Core Qualifications: An ideal candidate for this position is equipped with:At least two years of formal teaching experience in New YorkA proven track record in accelerating student growth and masteryA demonstrated capacity to plan rigorous and engaging curricula that align to Common Core standards using the Understanding by Design frameworkA balance of high expectations and high support, a growth mindset, and an innate joy in working with adolescentsStrong interpersonal and classroom/course management skillsAn openness and responsiveness to constructive feedback and a strong commitment to continuous improvement and professional growthA strong work ethic that features organization, multi-tasking, flexibility, an orientation toward solutions, and a pride in meeting deadlinesExpertise in working with diverse populations of students and families, and in differentiating instruction to fully support the needs of diverse learnersStrong written and oral communication skills and experience working collaboratively in team settingsApproaches the profession with maturity, humility, versatility and, of course, a sense of humorA Master’s Degree and certified as a teacher in New York",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/64d49737d3a049e08c0f00ed0f8eff10-middle-school-high-school-science-teachers-for-2020-21-school-year-unity-preparatory-charter-school-of-brooklyn-brooklyn"
    },
    {
        "position": "High School Calculus & Pre-Calculus (Math) Teacher",
        "company": "Unity Preparatory Charter School of Brooklyn",
        "description": "START DATE: Preparation for the 2020-21 School Year Begins in the Summer of 2020Overview of Position: A strong and dedicated faculty is paramount to best serving our students and families and to establishing Unity as an exemplary school. Most critically, our faculty equip students with the knowledge and skills needed, including the desire and capacity to learn independently, think critically, and communicate proficiently, to experience secondary and postsecondary success. Our Mathematics Teachers have the privilege and responsibility of delivering on these outcomes as they advance students’ knowledge and skills as burgeoning mathematicians.Overview of Unity - Our Model and Approach: Unity Preparatory Charter School of Brooklyn (Unity) is a tuition-free, open-enrollment, independent charter school that offers a progressive education in the liberal arts & sciences to over 600 students in grades 6-12. As a community-based school, we proudly serve the communities of central Brooklyn in New York City. Our middle school and high school campuses are located in the neighborhoods of Bedford Stuyvesant and Williamsburg, respectively.  Unity’s mission is to empower students as scholars and citizens so they may lead fulfilling academic, personal, and professional lives. We accomplish our mission through the integration of seven key elements that serve as the backbone of our school’s design. Collectively, these elements reflect our beliefs on what makes for an exceptional secondary education in today’s world: 1.    A Grades 6-12 College Preparatory Curriculum:​ a college-preparatory liberal arts and sciences program of study in mathematics, English language arts (ELA), science, and history that fosters in students the desire and capacity to learn independently, think critically, and communicate proficiently so that they are fully prepared to succeed in their postsecondary studies 2.    Excellent Teaching:​ ​​an enthusiastic faculty of expert educators who are demonstrably successful in promoting student learning, couple high expectations with high support, go above and beyond the call of duty for students as scholars and as citizens, and serve as role models for students as life-long learners and as individuals who take the utmost pride in perfecting their craft 3.    More Time for Learning:​ ​​an extended day, week, and year that provide approximately 20% more time than the local district average for academic enrichment and extracurricular activities that deepen learning and engagement, accelerate academic growth, and expose students to new pursuits 4.    Intensive and Differentiated Academic Support:​ customized settings and support provided by caring specialists for remediation and acceleration, including small class sizes, integrated co-teaching, literacy interventions, after-school and weekend tutoring, as well as advanced-level course offerings at our middle school and high school 5.    Ample Enrichment Courses and Extra-Curricular Activities:​ enrichment courses in the performing arts, visual arts, computer science, and foreign languages, as well as elective clubs, athletic teams, internships, and other “beyond-the-classroom” activities that serve to reinforce what students learn in their core courses, accommodate individual student interests, and develop important professional and citizenship skills through real-world, meaningful application 6.    A Positive and Supportive School Culture:​ ​​a culture built on a framework of Positive Behavioral Interventions & Supports (PBIS) in which compassionate adults explicitly guide students in the following: o      modeling the behaviors that contribute to a positive and productive learning environmento      developing socio-emotional skills needed to be successful, including how to manage emotions, reduce stress, make healthy decisions, and learn from one’s mistakes 7.    Active Family and Community Involvement: ample opportunities for family engagement and community service that promotes open communication, meaningful collaboration, and active involvement and service within Unity’s community and beyond Our Recent Accomplishments: Regardless of where students are academically or otherwise as they enter our school, our focus is on accelerating growth and on cultivating long-term academic and non-academic success. This focus has reaped impressive results for our students and families in recent years. Among our accomplishments:●     Our 8th grade students have consistently outperformed their district peers in mathematics and ELA on state exams.●     Our students who comprise subgroups that are traditionally least effectively served by our education system, including students classified as economically disadvantaged, black, Latino, and students with disabilities, have consistently outperformed their district and state peers on state exams.●     Approximately 75% of our high school upperclassmen enroll in at least one Advanced Placement (AP) course each year. This compares favorably with the 33% of NYC graduates who enroll in AP courses during their high school tenure.●     In holding true to our belief in providing a truly empowering education:o      90% of our students participated in an afternoon extra-curricular activity.o      80% of our students participated in a formal community service initiative.o      90% of students successfully completed their end-of-year Roundtable presentation, a 45-minute oral presentation given to families, Unity faculty, and community members.o      100% of high school students completed a full-year course in college and career readiness. Core Responsibilities: Key responsibilities of Unity’s Mathematics Teachers include but are not limited to the following:●     Plan a rigorous and engaging curricula that caters to the unique physical talents, needs, and multiple intelligences of students●     Collaborate in the planning and implementation of a rigorous and engaging curricula that cater to the unique physical talents, needs, and multiple intelligences of students●     Execute specially designed lesson plans that are guided by clear objectives, focus on conceptual understanding, and that are assessed routinely for student mastery●     Provide remediation and acceleration based on formative and summative assessments so that individual students are appropriately challenged according to their zones of proximal development●     Collaborate with colleagues to create, implement, and refine schoolwide and classroom-based systems, routines, and procedures ●     Ensure that classroom time is utilized through sound management practices and by developing strong and trusting relationships with students●     Develop, implement, and/or manage individualized behavioral intervention plans to support students meeting established academic and non-academic goals●     Actively participate in opportunities to strengthen their own pedagogical skills as well as contribute to the learning of colleagues●     Contribute to the school’s smooth and efficient operation by fulfilling required administrative duties and responsibilities and maintaining open and proactive communication with colleagues●     Build strong relationships with students and families as an Advisor and through consistent communication and in following through on commitments As professionals, all Unity teachers may participate in the school’s innovative teacher-career ladder, which provides a formal and transparent pathway for teachers to: ●     develop their craft and improve as educators through multiple forms of support and training ●     assume titles with commensurate responsibilities while remaining classroom practitioners ●     be generously compensated and formally recognized for their positive contributions to the school. For more information on our unique professional ladder and a teaching career at Unity, visit: http://www.unityprep.org/careers/why-teach-at-unity/Core Qualifications: An ideal candidate for this position is equipped with:●     At least two years of formal teaching experience in New York●     A proven track record in accelerating student growth and mastery●     A demonstrated capacity to plan rigorous and engaging curricula that align to Common Core standards using the Understanding by Design framework●     A balance of high expectations and high support, a growth mindset, and an innate joy in working with adolescents●     Strong interpersonal and classroom/course management skills●     An openness and responsiveness to constructive feedback and a strong commitment to continuous improvement and professional growth●     A strong work ethic that features organization, multi-tasking, flexibility, an orientation toward solutions, and a pride in meeting deadlines●     Expertise in working with diverse populations of students and families, and in differentiating instruction to fully support the needs of diverse learners●     Strong written and oral communication skills and experience working collaboratively in team settings●     Approaches the profession with maturity, humility, versatility (i.e., embraces the ambiguity and excitement associated with start-ups), of course, a sense of humor●     A Master’s Degree and certified as a teacher in New York",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/01fcf68ee7ac430fac86ba8ad77419cf-high-school-calculus-pre-calculus-math-teacher-unity-preparatory-charter-school-of-brooklyn-brooklyn"
    },
    {
        "position": "Part-Time Upper School Computer Science Teacher",
        "company": "Maimonides School",
        "description": "Maimonides School, a Modern Orthodox day school in Brookline, MA, seeks an energetic and experienced part-time computer science teacher to teach 9th, 10th, and 12th grade elective courses for the 2020-21 academic year. The school is looking for a dynamic, creative teacher with demonstrated enthusiasm for developing learners’ academic and critical thinking skills while nurturing their social, emotional, and spiritual growth; interest and experience in curriculum development; and a commitment to innovative pedagogy.  We are looking for a candidate who understands and addresses the diverse learning styles of children; works collegially as a team member; can demonstrate a student-centered pedagogical approach; and communicates effectively with students, parents, and colleagues. The successful candidate will be eager to grow in the position and develop professionally. Responsibilities will include teaching computer science three times per week to students in grades 9, 10, and 12 who elect this course above and beyond their core curriculum, a diverse community of learners. Maimonides’ commitment to our families requires significant written and oral communication about student work and progress. Our commitment to our students often requires individualized attention outside of the classroom. A total of 20 hours/week on campus is expected. Candidates should have a minimum of two years’ computer science teaching experience and a commitment to work as part of a collaborative team that prepares students with the skills, critical thinking abilities, and content knowledge to succeed as they develop as learners and progress toward graduation from high school. A Master’s degree is preferred. Competitive salary and benefits commensurate with years of experience and highest degree.  We want you to be part of our team! Maimonides offers an unparalleled dual curriculum in Judaic and general studies, with an emphasis on moral and spiritual development. From early childhood (2-year-olds) through 12th grade, our students are avid learners, eager to engage with each other, their teachers, and their community.  Join our family of outstanding educators and administrators who recognize each new day as an opportunity for creative ideas, collaboration, and connection. Maimonides is more than a school; it is a vibrant community whose members embody kindness and compassion for others. Maimonides School is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture. Maimonides does not discriminate based on disability, veteran status, or any other basis protected under federal, state or local laws.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/d8fe510c58334f05917f75fcdff957b6-part-time-upper-school-computer-science-teacher-maimonides-school-brookline"
    },
    {
        "position": "Solution Architect",
        "company": "Dimagi",
        "description": "Solution ArchitectCambridge, Massachusetts, United StatesSolutions Team - Full-timeAbout Us:Dimagi was born from the belief that there’s a better way to provide services to those in need. Our mission is to create digital products that support global development efforts and help accelerate the end of extreme poverty. CommCare, our mobile data collection platform, is designed to improve data collection and the quality of frontline services in low-resource settings around the world. We work across various sectors with organizations of all sizes providing mobile solutions that put end-users first. Working with partners that include the Bill & Melinda Gates Foundation, USAID, CARE International, and the World Bank, Dimagi has successfully implemented CommCare and supported 2,000 projects across 80 countries. Dimagi is a certified Benefit Corporation and leading social enterprise, working since 2002 towards our commitment to making an impact.About the position:Dimagi is looking for a Solution Architect to join the technology arm of our Solutions Division. Dimagi’s technology is being utilized for the COVID-19 response, and we are seeking someone who wants to use their technical background to get things done and find solutions to complex problems to help in this response. In this role, you will take on accountability for the optimal solution strategy, solution architecture, design, and development of mobile applications built on our flagship platform CommCare.This position will be based out of our Cambridge, MA office but is also open to remote employment within the US.The Solutions Division helps to bridge the in-depth domain-knowledge of our partners and field team with the power of our technology platform. This position will work directly with partners in the field on national-scale health projects, alongside our product team driving requirements on the next generation of our tools. You will also have the opportunity to work with our software team translating real-world experience to design.You’ll develop a deep understanding of our software platform and push the boundaries of what CommCare can do. That experience and training will help you to design the architecture, best practices, and design patterns that our field teams apply to their work. You’ll work with our world-class services team to help them adopt those patterns and build Dimagi’s global capacityResponsibilities include:Serve as the technical solution lead across several CommCare engagements, carefully weighing the balance between introducing new feature design and platform complexity to maximize partner impact realizationDemonstrate mastery of our platform feature limitation and upper boundsUnderstand common integration points (PowerBI, Tableau, DHIS2) and recommend technology pairings for complete use casesImplement advanced CommCare app features for Dimagi projects which require platform expertise and a high level of technical competencyProvide early-stage design support for projects to scope the value and risk of complex technical componentsCommunicate product feedback and technical requirements to the tech team to inform the design of advanced features for the platformWork with Dimagi’s support team to backstop issues requiring in-depth knowledge of the platform. Develop tools and procedures to build capacity in the support team to resolve complex problems independentlySkills and Requirements:Bachelor’s degree in computer science, engineering or an equivalent technical field and 5+ years of experience in a professional technical role, OR  8+ years of experience in a professional technical roleAble to rapidly build a trusted advisor relationship with key stakeholders by communicating complex technical concepts in clear, straightforward, readily consumable languageAptitude and self-direction to quickly learn new technical systemsCapacity to seek out, identify, and interpret unfamiliar technical components (configuration files, Http response, etc.) to identify and address problemsStrong debugging skillsReliable, self-directed, and resourcefulEligible to work in the United States Dimagi is an Equal Opportunity Employer. We celebrate and support diversity and are committed to providing a work environment that is inclusive and free of discrimination and harassment. All employment decisions are based on individual qualifications without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, family or parental status, veteran, or disability status.",
        "currentURL": "https://www.idealist.org/en/social-enterprise-job/188cb09e311c42c99bf035ec175fe145-solution-architect-dimagi-cambridge"
    },
    {
        "position": "Executive Director",
        "company": "On-Ramps",
        "description": "ABOUT THE ORGANIZATION:The Scratch Foundation’s mission is to provide all children, from all backgrounds, with opportunities to imagine, create, and share with new technologies – so they can shape the world of tomorrow. Scratch has become the world’s largest coding community for kids. With Scratch, kids can create their own interactive stories, games, and animations -- and share them with one another in an active online community. In the past year alone, more than 20 million children created projects with Scratch.After being developed and supported at MIT for more than 15 years, Scratch recently spun out of MIT and into the Scratch Foundation, now relocated to a new headquarters in Boston. This transition is designed to support the continued growth and long-term sustainability of Scratch as a free, open, creative platform for children around the world.  To learn more about Scratch, please visit: https://www.scratchfoundation.org/ &  https://scratch.mit.edu/ABOUT THE POSITION:At this important stage in its growth, the Scratch Foundation is looking for a creative and entrepreneurial Executive Director to lead the organization’s next phase of growth.  This is an exciting opportunity for a leader who would like to work at the intersection of education and technology in a high-growth, playful, creative environment that strongly values diversity, collaboration, and respect in the workplace.The Executive Director will manage a growing team (currently roughly 40 people), report to the Scratch Foundation’s Board of Directors, and work closely with Mitchel Resnick, founder of Scratch and chair of the Scratch Foundation Board.RESPONSIBILITIES:Strategic LeadershipPartner with other Scratch team members to undertake a strategic planning process that will set clear priorities for the next three to five years of the Scratch Foundation’s workOperationalize the strategic plan to support existing partnerships and establish new ones and guide program growth, with an emphasis on quality and access, as Scratch continues its expansion in school-based educational environmentsManage the development of a methodology of assessing and communicating Scratch Foundation progress that combines quantitative data and compelling user-storiesCultivate a strong working relationship with the Scratch Foundation Board, communicating openly about program performance and financial performance, while creating a plan for board growth and development with support from Board ChairWork Culture and Organization DesignSupport and sustain a creative, caring, and collaborative work environment, so that Scratch continues to attract a diverse, innovative, motivated, mission-driven staffAssess organizational strengths and weaknesses, and build and lead a high performing team that enjoys working togetherEnsure high-quality infrastructure and operations throughout the organization, including HR, facilities, finance, and developmentEstablish effective and inclusive decision-making processesDetermine the most effective staffing strategy for overseeing the financial status of the organization, including establishing financial plans and controls, monitoring of the budget, and setting financial prioritiesExternal RelationsPartner with development department to oversee fundraising and other revenue-generating strategies - including support from individual donors, foundations, governments, and corporations - to consistently support current and new initiativesDevelop partnerships that amplify the mission and ambition of the Scratch Foundation; oversee the cultivation of new partnerships, while sustaining current and future outreach activities (e.g., Scratch Day and Scratch Conferences)Create, support, and refine strategies to reach all children from all backgrounds (with a particular focus on Black and Latinx youth in the US), promote equity in Computer Science, and ensure activities and partnerships remain aligned with the four P’s of Scratch’s creative learning approach: Projects, Passion, Peers, and PlayAssure the integrity and growth of the Scratch brand, capitalizing on new opportunities (licensing deals, program adoption), while stewarding and protecting the Scratch brandCANDIDATE REQUIREMENTS:Deep commitment to the mission and values of the Scratch Foundation, with strong interest in children, learning, creativity, and technology10+ years of senior leadership experience, with a track record of leading an organization through a period of growth and changeDemonstrated success managing and mentoring staff, with a successful track record of recruiting, inspiring, and retaining a diverse, mission-driven teamTrack record of building and supporting a culture that nurtures inclusiveness, creativity, and respect Demonstrated success in developing and executing revenue-generating strategiesExcellent coalition-building and consensus-building skills, with the ability to work with professionals across a range of disciplines (e.g.: education, engineering, design) Exceptional presentation, communication, and interpersonal skills, and the capacity to serve as a compelling ambassador for Scratch with the full range of stakeholders interested in Scratch’s workExperience managing internal operations and building structures and systems to ensure efficient use of resourcesKeen analytic and strong problem-solving skills, in support of sound decision makingUnderstanding of branding and marketing opportunities and challenges, with the ability to develop and promote a consistent and compelling global brandLOCATION:  Boston, MACOMPENSATION AND BENEFITS:Salary and benefits will be competitive and commensurate with experience.The Scratch Foundation is an equal opportunity employer. All qualified candidates will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national or ethnic origin, disability, age, genetic information, veteran status, ancestry, or any other characteristic protected by law.On-Ramps is deeply committed to diversity, equity, and inclusion. We believe social change happens when people with a wide range of backgrounds, experiences, and identities come together with common purpose. We’re partnering with the team at the Scratch Foundation to build a diverse team that contributes a variety of perspectives to their mission and work. We encourage candidates from all backgrounds to apply.",
        "currentURL": "https://www.idealist.org/en/job/07cbb78cdc4f4b13be41a0d466a78aca-executive-director-on-ramps-boston"
    },
    {
        "position": "IT Coordinator",
        "company": "ASI - Assurance Services International",
        "description": "We are looking for an IT Coordinator (full time, maternity cover) to join our team in Bonn!Application Deadline: 22 June 2020We are aiming to fill this position as soon as possible. About ASIASI – Assurance Services International – is an assurance partner for leading voluntary sustainability standards and initiatives (read more about them here). ASI offers third-party accreditation for voluntary certification schemes – in short, “auditing the auditors”. We also design and oversee bespoke alternative assurance models to increase effectiveness and manage oversight in our clients’ systems. We are a team of more than 70 sustainability professionals with diverse backgrounds and expertise. With our headquarters in Bonn, Germany, we have an office in Kuala Lumpur, Malaysia and colleagues based on every continent. We are proud of the diversity represented in our team: 20+ languages, 35+ nationalities and experience in dozens of sectors. Read more about us on our website: www.asi-assurance.orgAbout You•   You are passionate about developing and maintaining IT systems•   You enjoy interacting with an international team and clients from all over the worldYour roleAs the IT Coordinator, you will join ASI’s IT team and report directly to the ASI Business Director.Your core responsibilities will include:•   General IT and administration: To support and maintain ASI’s IT and communications infrastructure and to ensure that the tools utilized are adequate for the requirements of our team. •   Salesforce support and development: To provide support and work towards the development of ASI’s Salesforce based Assurance Management System (AMS), serving as a primary system administrator for ASI. Work with internal and external users and the management team to gather system requirements, make proposals and implement the necessary changes to improve business processes. •   IT process improvements: To ensure that proper information security related policies and procedures are established in ASI and to also evaluate internal processes for their effectiveness. To identify areas of improvement and to coordinate the implementation of IT projects, ensuring that all activities are completed according to the project plan. What you bringOur ideal candidate brings a combination of knowledge, skills and experience:•   Degree in Computer Science or other related degree; a combination of relevant academic qualifications and professional experience may be accepted in lieu of a degree.•   Solid understanding of G Suite and network infrastructure.•   5 years of professional work experience as salesforce administrator or developer.•   Proven fluency in oral and written English. Proficiency in German language would be an asset.•   Able to prioritize, plan and organize work independently.•   Well-developed analytical and systematic problem-solving skills and the ability to quickly grasp complex systems.•   Readiness to work in a multicultural, multi- ethnic environment and to maintain effective working relations with people of different national and cultural backgrounds, both remotely and in person.•   Ability to work in the international arena.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/e5d87fc1afcf4debb460a62d1c25cfe2-it-coordinator-asi-assurance-services-international-bonn"
    },
    {
        "position": "PHP / Wordpress Developer",
        "company": "Women First Digital",
        "description": "JOB DESCRIPTIONPosition:  PHP / Wordpress DeveloperLocation: RemoteContract Term: 6 months with possibility of extensionWomen First Digital (WFD) is a collection of online platforms that provide information and counseling services on safe abortion, contraception and SRHR. WFD leverages the reach, innovation and power of the internet to reach as many people as possible. Through these platforms we connect women all around the world to accurate information, allowing them to make informed decisions about comprehensive abortion care and services. The following platforms comprise the WFD Program: 1. HowToUseAbortionPill.org (also known as PinkShoes.org in regions of the world where criminalization or stigma make abortion resources inaccessible)HowToUse is a one stop global resource for safe abortion, providing simple instructions on how to use the medical abortion pills. HowToUse also provides abortion eLearning courses, country-specific abortion information and is currently translated into 24 languages.2. safe2choose.orgsafe2choose connects women all around the world to accurate and individualized information on medical abortion pills, so that they can have a safe abortion where, when and with whom they feel most comfortable. Our team includes multilingual counselors, medical doctors and experts in the field of public health and international development that work together to provide women with accurate information about safe abortion.3. Findmymethod.orgCreated in collaboration with Bedsider.org and partners around the world, findmymethod.org shares information on contraception that is easy to understand, comprehensive, and globally representative.We are looking for a Full-time PHP / Wordpress Developer:Overall Objectives:The Developer will be responsible to maintain and make improvements to the Organization’s projects. This includes but is not limited to the front-end and backend development, API integration, responsive design and security protocols.ResponsibilitiesDesigning and building the website front-end.Designing and managing the website back-end including database and server integration.Troubleshooting content issues.Conducting website performance tests.Creating HTML for standalone pages / emailers from PSD.Strict adherence to the security and data management policies defined.Work with internationally based staff via email, online meetings and phone / specified messenger services.Report directly to the Tech Manager in India.Use the tools specified for task / project management. Update the task status on a daily basis.Brainstorm and give solutions / feedback to the team on complex problems.Provide full-time maintenance to the website and other projects.Availability to respond in emergency situations.Flexibility to have occasional meetings outside work hours with the rest of the team based internationally.Remain informed on latest and upcoming technologies.QualificationsStrong understanding of core PHP conceptsExperience with a PHP framework like Codeigniter / Laravel will be a plus.Extensive experience generating WordPress themes and plugins.Extensive experience with PHP and HTML5/CSS3Experience with LESS or SASS.Knowledge of technical and on-page SEOStrong understanding of mobile, responsive web patterns and UX/UI design.Strong understanding of any Front-end technology - Angular2 / Vue.js / Other is a plus.Experience building layouts and responsive web pages with HTML5, CSS3 and JavaScript is a plus.Experience with Wordpress, Jekyll, Responsive Design, AMP, PWA is a plus.Good Communication - English Mandatory.Must have independent access to a computer and high speed internet as this is a remote job.University degree in computer science, IT, etc, or at least three years’ work experience in website/mobile development.Working knowledge of other languages (French, Arabic, Portuguese, Spanish etc.) is a plus.Interest in social justice and / or reproductive rights is a plus.Experience:Wordpress: 2 years (Required)PHP: 2 years (Required)Location:The Web Developer will work online from any location, but should be in constant communication with the Women First tech team. Work schedule will be defined according to candidate’s availability and WFD needs.Benefits and Compensation: the position includes a monthly salary (based on experience), and paid leave days.",
        "currentURL": "https://www.idealist.org/en/social-enterprise-job/077d9782470845c8b7541255cf26614f-php-wordpress-developer-women-first-digital-delhi"
    },
    {
        "position": "PHP / Wordpress Developer",
        "company": "Women First Digital",
        "description": "JOB DESCRIPTIONPosition:  PHP / Wordpress DeveloperLocation: RemoteContract Term: 6 months with possibility of extensionWomen First Digital (WFD) is a collection of online platforms that provide information and counseling services on safe abortion, contraception and SRHR. WFD leverages the reach, innovation and power of the internet to reach as many people as possible. Through these platforms we connect women all around the world to accurate information, allowing them to make informed decisions about comprehensive abortion care and services. The following platforms comprise the WFD Program: 1. HowToUseAbortionPill.org (also known as PinkShoes.org in regions of the world where criminalization or stigma make abortion resources inaccessible)HowToUse is a one stop global resource for safe abortion, providing simple instructions on how to use the medical abortion pills. HowToUse also provides abortion eLearning courses, country-specific abortion information and is currently translated into 24 languages.2. safe2choose.orgsafe2choose connects women all around the world to accurate and individualized information on medical abortion pills, so that they can have a safe abortion where, when and with whom they feel most comfortable. Our team includes multilingual counselors, medical doctors and experts in the field of public health and international development that work together to provide women with accurate information about safe abortion.3. Findmymethod.orgCreated in collaboration with Bedsider.org and partners around the world, findmymethod.org shares information on contraception that is easy to understand, comprehensive, and globally representative.We are looking for a Full-time PHP / Wordpress Developer:Overall Objectives:The Developer will be responsible to maintain and make improvements to the Organization’s projects. This includes but is not limited to the front-end and backend development, API integration, responsive design and security protocols.ResponsibilitiesDesigning and building the website front-end.Designing and managing the website back-end including database and server integration.Troubleshooting content issues.Conducting website performance tests.Creating HTML for standalone pages / emailers from PSD.Strict adherence to the security and data management policies defined.Work with internationally based staff via email, online meetings and phone / specified messenger services.Report directly to the Tech Manager in India.Use the tools specified for task / project management. Update the task status on a daily basis.Brainstorm and give solutions / feedback to the team on complex problems.Provide full-time maintenance to the website and other projects.Availability to respond in emergency situations.Flexibility to have occasional meetings outside work hours with the rest of the team based internationally.Remain informed on latest and upcoming technologies.QualificationsStrong understanding of core PHP conceptsExperience with a PHP framework like Codeigniter / Laravel will be a plus.Extensive experience generating WordPress themes and plugins.Extensive experience with PHP and HTML5/CSS3Experience with LESS or SASS.Knowledge of technical and on-page SEOStrong understanding of mobile, responsive web patterns and UX/UI design.Strong understanding of any Front-end technology - Angular2 / Vue.js / Other is a plus.Experience building layouts and responsive web pages with HTML5, CSS3 and JavaScript is a plus.Experience with Wordpress, Jekyll, Responsive Design, AMP, PWA is a plus.Good Communication - English Mandatory.Must have independent access to a computer and high speed internet as this is a remote job.University degree in computer science, IT, etc, or at least three years’ work experience in website/mobile development.Working knowledge of other languages (French, Arabic, Portuguese, Spanish etc.) is a plus.Interest in social justice and / or reproductive rights is a plus.Experience:Wordpress: 2 years (Required)PHP: 2 years (Required)Location:The Web Developer will work online from any location, but should be in constant communication with the Women First tech team. Work schedule will be defined according to candidate’s availability and WFD needs.Benefits and Compensation: the position includes a monthly salary (based on experience), and paid leave days.",
        "currentURL": "https://www.idealist.org/en/social-enterprise-job/2b7d404cf3a5458c88848d1e78b55b98-php-wordpress-developer-women-first-digital-gurugram"
    },
    {
        "position": "CRM Specialist",
        "company": "Medair",
        "description": "Role & ResponsibilitiesThe Customer Relationship Management (CRM) Specialist will support our Global Engagement Channel Team in the overall marketing CRM strategy. Your role is to be the go-to person for CRM and how it is used to enable the business plan to succeed through more effective and efficient ways of working and engaging with our broad range of target audiences. You’ll flex your skills within the marketing, fundraising and content teams. If you are a proactive, troubleshooting and passionate CRM professional, we would like to meet you. Ultimately, you should help bridge the gap between our CRM systems and marketing ambitions.Project OverviewMedair Global Support Office (GSO) provides operational guidance for country programmes, along with both technical and compassionate support for our relief workers. Within our headquarters and affiliate offices, we are also responsible for promoting the work of Medair to the world, to raise and manage the funds needed to run our life-saving and sustaining programmes, and to recruit international and GSO staff.The Engagement Department is responsible for Medair marketing content and channels communication to support communities to reach their audiences and raise private funding to help our existing programmes care for the most-vulnerable.Workplace & ConditionsMedair Global Support Office (GSO), Lausanne, Switzerland.Swiss or eligible EU citizens, or those with a valid work permit for Switzerland, can apply.This is a GSO based position in Lausanne Switzerland, some field travel may be required.Starting Date / Initial Contract DetailsAs soon as possible. Full time, open-ended contract.Key Activity AreasCRM Systems and ApplicationsUnderstand current CRM practices, identify gaps, recommend CRM system development and ideal state.Assess various options for customising and optimising the systems to meet ambitious business needs/targets.Assist in creation of long-term strategic goals.Monitor data quality, data migrations, and support data integration activities for audience engagement and management reporting.Training and SupportSupport and empower different stakeholders by proposing marketing-oriented solutions to their business requests.Provide relevant training, including documentation, to ensure team proficiency with the systems.Work closely with various team members to review implementation in order to better bridge the gap between systems, users and engagement opportunities.InnovationKeep abreast of CRM system releases, features, processes, best practices and make recommendations accordingly.Research and propose relevant CRM integrations to streamline business practice.Team Spiritual LifeReflect the values of Medair with staff, beneficiaries, and external contacts.Work and pray together in our Christian faith-based team settings. Fully contribute to the rich spiritual life of your team, including team devotions, prayers, and words of encouragement.Encouraged to join and contribute to Medair’s international prayer network.This job description covers the main tasks that are anticipated. Other tasks may be assigned as necessary.QualificationsBachelor degree in Computer Science, Business, Management Information Systems or equivalent job experience.Strong working knowledge of English and French (spoken and written).Working knowledge of German (spoken and written) is an asset.Experience / CompetenciesExperience in managing CRM systems in support of marketing activities (i.e. Salesforce, Pardot, Hootsuite, Google Analytics…).Experience and understanding of key end-to-end CRM processes with good knowledge of industry best practices in CRM space.Advanced Microsoft Excel/spreadsheet/Qlik skills (formulas, data cleansing and data manipulation).Understanding of Marketing audience engagement techniques.Understanding of CMS, XML, SQL, and enterprise application integration a plus.Ability to effectively translate and communicate system complex concepts.Ability to grasp future trends in technologies and act proactively.Team-player who takes full ownership of responsibilities with rapid autonomy.Able to think critically and analytically while working in a fast-paced environment.Excellent multitasking, business analysis, interpersonal and communication skills.Excellent listening skills to fully understand requirements and opportunity areas.Attention to detail, quick learner and problem-solver.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/0861a3528c9148cab777252b30204525-crm-specialist-medair-ecublens"
    }
]