[
    {
        "position": "Financial Controller",
        "company": "Sustainable Fisheries Partnership Foundation",
        "description": "Background on SFP: The mission of Sustainable Fisheries Partnership (SFP) is to work toward rebuilding depleted fish stocks, reducing the environmental impacts of fishing and fish farming, and ensuring sustained economic opportunities for fishing communities worldwide. SFP improves access to information that can guide responsible seafood sourcing, and enhances the ability of seafood companies and partners to work with governments to improve policies and management practices in support of sustainable fisheries and aquaculture sectors. Visit www.sustainablefish.org to learn more. Position Description and Responsibilities: This is a remote-work position, for which candidates should be based in Hawaii or the US West Coast. The anticipated start date for this position is 3 August 2020. The Controller is responsible for oversight of all accounting operations of the organization, to include the production of periodic financial reports for internal, external and donor constituents, maintenance of an adequate system of accounting records and a comprehensive set of controls and budgets designed to mitigate risk, enhancing the accuracy of the company's reported financial results, and ensuring that reported results comply with generally accepted accounting principles (US-GAAP).Reporting to the CFO, the Controller oversees all day-to-day accounting operations of the organization and supervises a team of 3 staff members. The Controller has functional responsibility over accounting, accounts payable, accounts receivable, payroll, and grants administration and accounting, as well as training and identification of training needs. The Controller ensures that SFP has the systems and procedures in place to support effective program implementation and support flawless audits of its financial reports and systems.  This position also works closely with program leaders and their staffs, not only to educate them regarding finance and accounting procedures but also to explore how the finance function can support program operations.In addition, the Controller partners with the CFO, senior leadership, human resources (HR) and information technology (IT) staff to enhance and better integrate finance, HR, and IT functions and streamline information flows. Key Responsibilities and Activities:(20%) Oversee all accounts, financial ledgers, and reporting systems to ensure compliance with appropriate GAAP standards and regulatory requirements; maintain internal control and safeguards for receipt of revenue, costs, and program budgets and actual expenditures; maintain a documented system of accounting policies and procedures, oversee training of finance team staff and identify training needs.  (20%) Consistently analyze financial data and present financial reports in an accurate and timely manner; clearly communicate periodic donor and program status reports, as well as monthly, quarterly, and annual financial statements; monitor progress and changes and keep senior leadership abreast of SFP’s financial status. (20%) Oversee all financial, projects/programs, and grants accounting; ensure that expenditures are consistently aligned with grant, project and program budgets throughout the grant/fund period; and work with Development division and CFO to prepare financial reporting materials for government, corporate, and foundation grants. (15%) Manage the day-to-day financial and accounting activities including accounts payable, accounts receivable, bank reconciliations, and payroll. (10%) Support the CFO in engaging the board’s audit and finance committees around issues and trends in financial operating models and delivery. (5%) Coordinate the annual financial statement audit with external auditor and provide requested documents; coordinate preparation of Form 990 and ensure timely filing with the IRS; and ensure timely and accurate regulatory and tax filings to state and federal government. (5%) Assist CFO in the annual budgeting and planning process; administer and review all financial plans and funding proposals and compare to actual results with a view to identify, explain, and correct variances as appropriate. (5%) Other administrative matters and assigned projects.Essential Qualifications and Skills:Seven to ten years of progressively responsible accounting and finance experience.BS or equivalent in Accounting or Finance, MBA and/or CPAKnowledge of finance, accounting, budgeting, and cost control principles including Generally Accepted Accounting Principles (GAAP) and non-profit regulatory filings.Advanced skills in Excel, with ability to create and maintain complex pivot table reports.Knowledge of automated financial and accounting report systems. Ability to analyze financial data and prepare financial reports, statements and projections. Working knowledge of short and long term budgeting, forecasting, and project accounting.Strong interpersonal and communication skills. Ability to work with and motivate multicultural teams to produce quality materials within tight timeframes and simultaneously manage several projects. Ability to participate in and facilitate group meetings, both face-to-face and virtual.Demonstrable leadership skills in managing a teamAbility to work productively and manage a team in a remote office setting (i.e., primarily via Skype, email, webinars, and other electronic means, etc.) Scheduling flexibility to accommodate a virtual organization with staff working from home offices around the globe e.g., ability to work with Indonesia based staff during their work day, ability to work with European based staff during their work day, etc.Personal qualities of integrity, credibility, and a commitment to SFP mission.Desirable Qualifications and Skills:·        Experience working for a non-profit organization, charity or NGO ·        Experience working with government and foundation grantsDuration/Level of Effort: This is a full-time/ position. Level of Effort is expected to be 40 hours per week. Compensation: Competitive and based on experience.Application:  The deadline is 10 July 2020. All inquiries will be kept in the strictest confidence. Qualified candidates should submit the following to jobs@sustainablefish.org with the subject line “Controller”:·        Resume/CV·        Letter of interest (no more than 1 page)",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/61561094df9a44d298a4fb05094ecb69-financial-controller-sustainable-fisheries-partnership-foundation-honolulu-or-elsewhere-in-hawaii"
    },
    {
        "position": "Resource Coordinator",
        "company": "EAH Housing",
        "description": "This position is for a full-time Resource Coordinator to work at Kalani Gardens and Villages of Moa'e Ku, two multi-family communities in Mililani and Ewa Beach, HI. Qualified candidates will have a BA degree in Social Services, Healthcare or related field and have 1+ years of social service experience working with families. Position pays between $20.34/hr to $24.12/hr DOE.COMPANY OVERVIEWEAH Housing has been developing, managing and promoting affordable housing since 1968. We are one of the largest and most respected nonprofit housing development and management organizations in the western United States. With a staff of over 450, EAH develops multi-family housing, manages over 100 properties in California and Hawaii, and plays a leadership role in local, regional and national housing advocacy efforts.At EAH, we put our core values into action on a daily basis. We recognize that training is a critical investment in the success of our employees and in the continued excellence of EAH. Please visit our website to learn more about our culture and read employee comments to learn more about what it would be like to work at EAH.For immediate consideration please apply to requisition RESOU02092 on our website at  www.eahhousing.org/careersPOSITION OVERVIEWThe Resource Coordinator assists residents by connecting them with existing social services provided by public agencies or private practitioners within the community, examines the needs for on-site services and explores ways programs and services can be brought to the property.RESPONSIBILITIESCoordinates and oversees the delivery of services and program activities to residents both on and off-site.Utilizes intake survey/needs assessments to determine what types of programs and services would benefit the residentsRecruits, assists and links residents with services and program activitiesAttends all resident council meetingsDefines and monitors individual service plans for seniors and people in transitionInterfaces with provider agencies, public agencies and community volunteer agenciesQUALIFICATIONSBA Degree in Social Services, Healthcare or related field, or equivalent combination of education and/or experience.1-2 years of social service experience working with elderly, familiesCRIMINAL BACKGROUND CHECK REQUIREMENTSEAH Housing conducts criminal background checks on all candidates who have received a conditional job offer. Once you have receive such an offer, you will be required to submit and pass our criminal background requirements. Please be advised that certain roles may also require fingerprinting due to legal requirements. If onsite housing is a requirement of the position, any household members over 18 years of age who will be living onsite with the candidate must also undergo a criminal background check and tenant screening. Satisfactory completion of background check and fingerprinting requirements is a requirement of employment with EAH.    BENEFITSWe offer a comprehensive benefits package that includes medical, dental, vision, disability and life insurance, as well as a 403(b) retirement plan with a percentage match. We also offer a generous vacation accrual, holiday schedule and work schedule flexibility.EAH Housing is an AA/EEO/Veterans/Disabled Employer. CA BRE #00853495 | HI RB-16985",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/3d460557ac4442a0b06bd1397a5ca236-resource-coordinator-eah-housing-mililani"
    },
    {
        "position": "Behavioral Health Lead",
        "company": "Mendocino Coast Clinics",
        "description": "The Behavioral Health Lead reports directly to the Operations Director and will will be responsible for providing on going counseling to their assigned clients and providing Clinical Supervision to the Behavioral Health Professionals and the Case Managers. Supervise the Behavioral Health and Suboxone Case ManagersMinimum QualificationsMust posses a current and active license as an LCSW, Psychologist, to practice counseling in the State of CaliforniaOne to two years Lead experience preferredTwo to three years Behavorial Health clinic experience required",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/5c377c6a71fb4457b0e585b8a898e9fc-behavioral-health-lead-mendocino-coast-clinics-fort-bragg"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/f99515afca004197b7baf5a21a294c61-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/d997b9716707480eae1ce56864ed9597-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/cea2135f51764029bb563b8ea5d655cf-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/9efa7c8ed78446f3a283fd55ee07d2c8-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/7e7d8a0f79f844e9a451ce0600b4bdec-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/51f04a3734f741aa9cfe7b83cf5e88f7-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/22697f20c28a4ddfab72d5e4ec40e40d-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/2198f6da483c4b1885a9799fa749dc94-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "Bilingual Housing Counselor and Investigations Coordinator",
        "company": "Fair Housing Advocates of Northern California",
        "description": "DUTIES AND RESPONSIBILITIES:Under supervision of the Supervising Attorney, provide direct fair housing counseling services to tenants and homeowners in protected classes, including providing information on coverage of fair housing laws, making reasonable accommodation requests, providing advocacy, intervention and/or mediation services, and acting as representative in administrative complaintsIn collaboration with other senior staff, coordinate fair housing investigations, implement testing programs to identify potential violations of federal, state and local civil rights laws, evaluate test methodology, provide feedback on structuring complaint and audit-based tests, analyze completed rental/lending/other tests, and prepare administrative complaints for filingWith other investigative staff, recruit, train, hire, and manage a diverse and highly trained tester pool, overseeing work quality, while maintaining accurate and updated records for tester applicants and trained testersMaintain accurate and complete records of complaint-based, systemic and/or audit investigationsConduct timely preliminary analysis of testing results prior to referral to attorneysPresent at fair housing training sessions for housing providers; present fair housing information to social service providers, advocacy organizations, and/or community membersAssist in education and outreach efforts, including attending community and advocacy organization meetings, municipal/local government hearings and/or meetings, public housing authority meetings, and other relevant outreach events as agency representative as appropriate; prepare formal written comments on any relevant documents or topicsREQUIRED QUALIFICATIONS:Commitment to fair housing and civil rightsExcellent oral communication skills, including public speaking and interpersonal skills in English and SpanishStrong analytical and organization skills and ability to manage multiple cases and investigationsAbility to meet project deadlines and maintain accurate recordsSelf-motivation and ability to work with limited supervisionAbility to work effectively with a diverse community and with patience, tact and respect when interacting with the public and other staff membersValid California driver's license and use of carDESIRED QUALIFICATIONS:Spanish writing skillsAbility to understand legal documents, federal and state fair housing statutes and regulationsExperience with Microsoft Word, Excel, Salesforce, PowerPoint, and other softwareKnowledge of federal and state fair housing lawsSupervisory skillsEDUCATION AND EXPERIENCE:Experience in social service or public entity and on behalf of civil rights protections desirable. Candidates must have a desire to work and interact with, as well as demonstrate respect for individuals and groups without regard to race, religion, sex, color, national origin, age, sexual orientation, familial status, or disability. Spanish speaking skills required; Spanish writing skills ideal.This position requires the use of a car and some infrequent non-traditional work hours for enforcement activities.Position open until filled.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/c7b36613c1a84171b5d5fbe928c0e691-bilingual-housing-counselor-and-investigations-coordinator-fair-housing-advocates-of-northern-california-san-rafael"
    },
    {
        "position": "Director of Litigation and Policy",
        "company": "Eviction Defense Collaborative",
        "description": "The Director is tasked with providing overall leadership, management and direction to EDC’s Legal Assistance Program to ensure high quality intake and referral processes, legal advocacy and representation. EDC often works with impacted-community member-led organizations and regularly works in coalition with grassroots and community-based organizations on public education and community engagement strategies. The Director is a member of the Senior Management team, aiding in the management, planning, coordination, and implementation of organization-wide policies and procedures. QualificationsFirst and foremost, the applicant must profoundly share EDC’s mission and vision of social justice and be able to manage stressful situations with empathy and calm. Below are additional qualifications.Legal/Litigation Experience●      Active membership in the California State Bar●      Minimum of ten (10) years’ legal practice experience with unlawful detainers●      Minimum of five (5) years’ experience as lead counsel litigating unlawful detainer cases, preferably in San Francisco Superior Court●      Experience working within a litigation team providing holistic legal services●      Experience litigating affirmative cases●      Superior oral, written communication and editing skills●      Commitment to a flexible, comprehensive view of representation on behalf of low income people that values both individual and systemic advocacy●      Ability to identify and respond to shifting trends in legal practice and policies affecting the poorPolicy Experience●      Significant experience leading non-litigation advocacy efforts (e.g., organizing, social media, etc.)●      Previous experience leading collaborative programs involving legal services organizations,     community based organizations, the court, and/or other government agencies ●      Experience testifying before and working with local, state or national governmental bodies ●      Experience in writing legislation●      Experience participating and presenting at local, regional, and national conferencesWorking conditionsThe position requires working with individuals during moments of extreme stress and instability. The position also requires the provision of culturally-sensitive and empathetic services. Some evening and weekend work may be required. Commitment to Equity, Diversity and InclusionWe are strongly committed to diversity and encourage applications from people who can contribute to our diversity. All qualified applicants will receive consideration for employment. The Eviction Defense Collaborative believes that all persons are entitled to equal employment opportunity and does not discriminate on any basis prohibited by applicable law.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/5afc4174ddea45c9b80949cb78e4a50e-director-of-litigation-and-policy-eviction-defense-collaborative-san-francisco"
    },
    {
        "position": "Support + Safety Ambassador at Compass Family Services",
        "company": "Tipping Point Community",
        "description": "Tipping Point Community is posting on behalf of Compass Family Services as a part of our Chronic Homelessness InitiativeAbout Compass Family Services:Compass Family Services helps homeless and at-risk families achieve housing stability, family well-being and self-sufficiency. We help at-risk families to stabilize and work to rapidly re-house families that have become homeless. Our continuum of services includes intake and referral to shelter, family shelter, transitional housing, rental assistance, and childcare, as well as counseling and therapy, parenting education, prevention, and support services.Organizational Core Competencies:AccountableAdaptableClient-centeredCollaborativeCommitted to diversity, equity, and inclusionResourcefulResponsibilities: Support responsibilities Serve as a welcoming first point of contact for clients and other visitors.Greet employees, clients and guests, quickly assess their needs, and provide them with appropriate solutions (i.e. temporary or visitor badge, connect them to their appointments or for triage intake, first aid supplies, where to find a conference room, etc.).Monitor and authorize entrance of clients and other visitors to the building, including oversight of sign-in logs.Assess what services clients are here for and direct them to appropriate staff member or program.Alert case managers, therapists and other staff when their appointments have arrived.Maintain the cleanliness and appearance of their work area and lobby.Respond to all requests for assistance relayed by othersSafety responsibilitiesPrevent access by individuals who are not employees, clients, or invited visitors. Maintain a safe and secure environment for employees, clients, and visitors by controlling building access points and patrolling building premises.Monitor waiting area for potentially disruptive situations; de-escalate when appropriate and alert the FRC Program Director or COO as necessary.Monitor surveillance equipment to identify disruptions or trouble spots.Complete and submit incident reports as needed.Immediately respond to emergencies to provide necessary assistance to employees, clients, and other visitors to the premises.Notify appropriate staff about concerning situations or behaviors.Oversee protocol for opening the building at the start of the day and closing at the end of the day.Respond to emergencies and problematic situations by investigating and assessing the situation and providing necessary assistance, and alert 911 or other law enforcement when appropriate.Protect the organization’s assets relative to theft, assault, fire and other safety issues.Follow procedures for various initiatives, including fire prevention, property patrol, traffic control, and accident investigations.Maintain knowledge of disaster protocols.Report maintenance and safety conditions which might endanger employees, operations, or public safety, including fires, natural disasters, hazardous situations, or other facility-related eventsOther responsibilitiesAttend all agency, staff and group clinical meetings to implement a trauma informed approach.Complete additional assignments as assigned and required.Minimum qualifications:Minimum two years’ experience as front desk/office receptionAbility to work calmly and stay organized under pressureMature, professional, and capable of working under minimal supervisionFriendly, approachable, and knowledgeable of company policies and resourcesStrong interpersonal skillsUnderstanding of the population served by the organizationExcellent written and verbal communication skillsGood judgment and ability to make good decisionsMust always be at alert to avoid being caught unawareKnowledge of Security Operations and ProceduresAbility to communicate via email, use agency-wide database and Outlook calendarAbility to successfully handle multiple tasks at onceSafety ManagementCPR and First Aid certified (certification can be obtained on the job)Ability to work autonomously with minimal direct supervisionOutstanding work habits: punctual, reliable, cooperative, team-orientedCommitment to working on a diverse, multi-disciplinary teamPositive outlook and can do attitudeOutstanding work habits: punctual, reliable, cooperative, team-orientedExperience working in crisis situations and ability to assess and de-escalate quicklyExperience working effectively with culturally-diverse staff, families and communitiesMust be able to lift at least 20 lbs.Compensation + benefits: Compass Family Services offers a competitive wage and benefits package that includes employer-paid major medical, dental and vision coverage, long-term disability insurance, an employer-contributed retirement plan, and generous paid vacation, sick, and holiday leave. This is non-exempt, full time (37.5 hours per week) position reporting to the COO.To apply: Please submit a detailed cover letter and resume. Resumes sent without cover letters will not be considered. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. We are an equal opportunity employer and actively seek to recruit a diverse workforce.Tipping Point Community is posting on behalf of Compass Family Services as a part of our Chronic Homelessness Initiative",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/4fe2051bab404302bbbcd92eca263e66-support-safety-ambassador-at-compass-family-services-tipping-point-community-san-francisco"
    },
    {
        "position": "Teacher, Compass Clara House at Compass Family Services",
        "company": "Tipping Point Community",
        "description": "Tipping Point Community is posting on behalf of Compass Family Services as a part of our Chronic Homelessness InitiativeAbout Compass Family Services:Compass Family Services helps homeless and at-risk families achieve housing stability, family well-being and self-sufficiency. We help at-risk families to stabilize and work to rapidly re-house families that have become homeless. Our continuum of services includes intake and referral to shelter, family shelter, transitional housing, rental assistance, and childcare, as well as counseling and therapy, parenting education, prevention, and support services.About Compass Clara House:Compass Clara House is a service-enriched transitional housing program for homeless families. Families live for up to two years in private apartments during which time parents engage in educational and vocational programs which lays the framework for a living wage career. The program provides licensed on-site childcare and afterschool programs as well as an array of support services.Organizational core competencies:AccountableAdaptableClient-centeredCollaborativeCommitted to diversity, equity, and inclusionResourcefulResponsibilities: Help foster an environment that can meet children's basic needs.Attend PFA trainings and on-site coaching sessions.Complete ASQ and DRDP assessments per PFA guidelines.Develop curriculum and classroom environment that promotes goals of PFA.Organize daily activities that stimulate children's physical, emotional, intellectual, and social growth and promote self-esteem.Establish and maintain a safe and healthy environment: plan and implement nutritious snacks, promote good hygiene, maintain a clean, orderly and wellstocked learning environment.Develop weekly and monthly lesson plans that incorporate physical, intellectual, and social-emotional learning experiences.Assist with all children as needed for coverage and staffing purposes.Promote good personal hygiene and independent care skills (when appropriate).Establish positive and productive relationships with parents: promote communication with parents through daily exchanges of information and quarterly parent-teacher conferences.Encourage parent participation and offer on-going parent education and support.Capitalize on children's play to further language development and introduce scientific and mathematical concepts.Establish daily routines with structured transition times.Promote the program's philosophy and educational objectives.Model appropriate behavior to children, parents, and staff.Attend weekly staff meetings, weekly childcare staff meetings, weekly supervision, and other scheduled in-services and trainings to improve personal and professional skills.Plan and coordinate field trips and special eventsDevelop a positive working relationship and effective teaching team with other staff members.Other tasks as assigned by childcare coordinator and/or program director.Minimum qualifications:Current Teacher PermitGood interpersonal and communication skillsAble to lift up to 30 poundsPhysical clearance (including TB clearance) and fingerprint clearanceFlexible and open to feedbackAbility to work within a team setting Compensation + benefits: Compass Family Services offers a competitive wage and benefits package that includes employer-paid major medical, dental and vision coverage, long-term disability insurance, an employer-contributed retirement plan, and generous paid vacation, sick, and holiday leave.This is non-exempt, full time (37.5 hours per week) position reporting to the Childcare Coordinator.To Apply: Please submit a detailed cover letter and resume. Resumes sent without cover letters will not be considered. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. We are an equal opportunity employer and actively seek to recruit a diverse workforce.Tipping Point Community is posting on behalf of Compass Family Services as a part of our Chronic Homelessness Initiative",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/d59966aea7504b5a916eb95bd84c23e8-teacher-compass-clara-house-at-compass-family-services-tipping-point-community-san-francisco"
    },
    {
        "position": "Director of Safety Programs",
        "company": "Golden Gate National Parks Conservancy",
        "description": "The Golden Gate National Parks Conservancy is the nonprofit support partner of the Golden Gate National Recreation Area — 84,000 acres of national parkland spanning the San Francisco Bay Area, including Muir Woods, Ocean Beach, Crissy Field, and Alcatraz. The Parks Conservancy is a membership organization created to preserve the Golden Gate National Parks, enhance the experiences of park visitors, and build a community dedicated to conserving the parks for the future. The Golden Gate National Parks Conservancy is looking for a Director of Safety Programs. As a new position, this role will initially focus on assessing needs and developing organization-wide strategy for over 400 employees at multiple sites and within multiple departments.  This role has a wide range of responsibilities and we’re looking for someone who is excited to strengthen our organization through systems and on-the-ground practices that center the safety and well-being of all employees.  If you work well with people, have experience in safety program development, and would like to grow professionally as a collaborative leader, we encourage you to apply. As a public-serving organization, justice, equity, diversity and inclusion are vital to our staff, and we are committed to the active work of being anti-racist.  Description of Duties  Program development and improvement ·        Sets priorities, leads and manages a comprehensive safety program that incorporates justice, equity, diversity and inclusion values and principles ·        Collaborates with employees, teams, supervisors, Safety Committee, Diversity, Equity and Inclusion Committee and partners including the National Park Service in improving safety practices and systems ·        Develops a comprehensive employee training program including incident response (reporting, investigation, and remedy process), emergency response (including for remote locations), PPE, and other topics Compliance and best practices ·        Oversees plans and programs—including Incident and Injury Prevention Program and Emergency Response—as required by federal and state standards (e.g., OSHA, NIOSH, CalOSHA, EPA, etc.) ·        Ensures programs and practices meet the needs of the Parks Conservancy while also satisfying any requirements from the external partners ·        Provides guidance and oversight for environmental, safety and security inspections/audits ·        Provides guidance and oversight for Emergency Action Plans  Employee support ·        Fosters a sense of security for employees; regularly assesses employees’ needs and program progress ·        Assists employees and partner organizations in how to manage interactions with visitors ·        Responds to emergencies in addition to health and safety issues that affect employees, interns, volunteers, external partners, contractors, and program participantsOperations and Administration ·        Manages safety budget with support from Executive and Finance Team ·       Facilitates contracts and agreements Qualifications Safety program experience·       Prior experience administering a safety program·       Able to lead the creation and implementation of multiple organization-wide safety initiatives·       Has relevant knowledge and technical skills—including how to apply federal and state safety standards—as demonstrated by work experience and education/training Collaboration and relationship building·       Experience working across multiple departments and/or work types (e.g., office settings, outdoors, public-facing, etc.)·       Willing to coordinate with partner organizations·       Can build and sustain relationships with a variety of people, inclusive of different backgrounds, ethnicities, genders, sexualities, ages, and viewpoints Leadership ·        Committed to fostering an inclusive work culture ·        Can work independently and problem solve·        Able to set priorities, obtain buy-in from others, and incorporate feedback·         Has knowledge and willingness to try multiple approaches to   conflict and conflict resolution Resource gathering·       Can find information and resources to guide decision making·       Able to select and manage contractors for specialized safety needs. Work Environments and Physical Requirements ·        Work is performed in office and outdoor settings. Sitting and operating a computer for 6-8 hours a day is common·        This position also regularly visits and consults with employees who work across three counties at approximately 36 different locations, including field sites, offices, retail stores, and public spaces. Hence, a valid driver’s license is preferred ·        A DMV record check to be cleared to drive company vehicles is required. Company vehicle will be provided to access work sites·        Ability to lift up to 25 pounds  The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of personnel so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed. The Golden Gate National Parks Conservancy is an Equal Opportunity Employer. Recruitment, placement and promotions are conducted without regard to an individual's race, color, religion, sex, national origin, age, physical handicap, veteran status or sexual orientation, or any other classification protected by Federal, State, and local laws & ordinances. We will consider qualified candidates with criminal history in a manner consistent with the requirements of the San Francisco Fair Chance Ordinance. All qualified applicants are encouraged to apply. ",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/b409b56b93de4127b77bacd9e350a1c6-director-of-safety-programs-golden-gate-national-parks-conservancy-san-francisco"
    },
    {
        "position": "Development Writer",
        "company": "Earthjustice Headquarters",
        "description": "Earthjustice is the premier nonprofit environmental law organization. We take on the biggest, most precedent-setting cases across the country. We wield the power of law and the strength of partnership to protect people’s health; to preserve magnificent places and wildlife; to advance clean energy; and to combat climate change. We partner with thousands of groups, supporters, individuals and communities to engage the critical environmental issues of our time, and bring about positive change. We are here because the earth needs a good lawyer.Founded in 1971, Earthjustice has a distinguished track record of achieving significant, lasting environmental protections. We achieve this by hiring people who share a passion for justice and a healthy environment. Our headquarters are in San Francisco, with offices in Anchorage, Juneau, Los Angeles, Tallahassee, Miami, Honolulu, New York, Philadelphia, Denver, Seattle, Bozeman, Chicago, and Washington, D.C.The Development Writer is responsible for writing and editing donor materials that are informed, accurate, and consistent with the Earthjustice brand. These materials support the organization’s ambitious fundraising goals and play a critical role in the cultivation, solicitation, and stewardship of all Earthjustice supporters. Reporting to the Donor Communications Manager, the Development Writer works closely with program VPs, attorneys, Communications and Marketing staff, and the entire Development team to craft effective donor-facing messages and engaging stories with a particular focus on major gift fundraising. Materials the Development Writer will produce include the annual report, donor reports and proposals, events and trip collateral, newsletters, fact sheets, brochures, invitations, program updates, cover letters, email messages, and website text.This role can be located in our San Francisco, CA (preferred) or remote.We will also consider remote candidates from the below locations where we have an established business location: Anchorage, Chicago, Juneau, Los Angeles, Tallahassee, Miami, Honolulu, New York, Philadelphia, Chicago, Denver, Seattle, and Bozeman.ResponsibilitiesWriting, Research, and Content Production (75%)Work closely with the Donor Communications Manager and Development staff to identify writing needs.Develop compelling and appropriate messaging for individual donors and prospects, and donor recognition societies.Carry out a heavy volume of writing assignments on a variety of topics and with tight deadlines including major and principal gift proposals, program reports, stewardship updates, concept papers, talking points, fact sheets, newsletter stories, event and travel collateral, and annual report content.Interview VPs, managing attorneys, staff attorneys, and PAL and Communications staff to develop narratives.Work with the Donor Communications Manager and team writers to coordinate with the Communications department on content strategy in order to share information, collaborate on cross-departmental initiatives, and ensure consistency of organizational messaging and materials.Research and review material prepared by frontline Development staff, Foundation Officers, Earthjustice attorneys, and Communications and Marketing staff to develop and produce creative, compelling written content.Collaborate with the graphic design team to produce attractive and appropriate designed collateral.Monitor and meet publication deadlines in coordination with fundraising calendar.Edit and proofread written materials created by other Development and Communications staff.Collaborate with DME team members and Development staff to develop new message framing, collateral types, and communication vehicles as needed.Program Knowledge (15%)Become fluent in the work of Earthjustice regional offices, programs, and campaigns. Develop a working knowledge of Earthjustice’s key past accomplishments and history.Stay abreast of updates in program areas to keep written materials current and accurate by participating in program staff briefings and program area email lists, interviewing program staff, and monitoring website updates and press releases.Track daily environmental news reports and keep updated information on a wide array of environmental issues.Continued Learning (10%)Attend departmental and organizational retreats for shared planning, team building, and professional development.Participate in organization-wide initiatives and trainings that contribute to the creation of a diverse, equitable, and inclusive work culture that encourages and celebrates differences.Utilize internal and external resources to support a personal and professional development journey that increases awareness and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations.Identify and participate in professional development opportunities (e.g. conferences, webinars, seminars, etc.) to enhance storytelling and communications skills and techniques, and stay abreast of new and emerging communications tools. QualificationsBachelor’s degree and five or more years successful experience as a writer/editorJournalistic, writing, environmental, and/or scientific background preferred.Outstanding verbal and written communication skills.Ability to synthesize complex legal and scientific material, translate it into compelling text, and communicate it clearly and succinctly.Ability to develop successful reports, proposals, and other materials creatively.Ability to prioritize work and to perform effectively under the pressure of multiple deadlines.Exceptional ability to work and communicate effectively with a wide range of people across the organization.Interest in environmental and public health concerns.Demonstrate an awareness and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations.Contribute to the creation of a diverse, equitable and inclusive work culture that encourages and celebrates differences.Salary is based on experience and location. Salary range in San Francisco, CA: $77,000 - $85,600Salary range for remote locations varies. Please note in your cover letter where you are located if remote.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/c6e961ddff2a4830b29d1c38f29df892-development-writer-earthjustice-headquarters-san-francisco"
    },
    {
        "position": "Administrative Assistant - Immigration Center for Women and Children",
        "company": "Immigration Center for Women and Children",
        "description": "The Immigration Center for Women and Children (ICWC) seeks a full-time administrative assistant - a dynamic position as a member of our stellar admin team - to work with attorneys, legal assistants, LOPC team, and student interns in its San Francisco office.**As an essential service organization, ICWC staff are currently splitting their time between in-office work and working remotely, in order to provide these critical services most safely and efficiently in this extraordinary time of Covid-19**ICWC is a non-profit legal organization providing affordable immigration services to underrepresented immigrants in California. ICWC strives to provide security and stability for children who are abused, abandoned or neglected and for immigrants who are victims of domestic violence, sexual assault and other violent crimes. The office primarily works with federal immigration laws that allow victims to apply for work authorization and permanent residency. More information about ICWC is available at www.icwclaw.org and https://www.facebook.com/268356376532931/videos/451709055513411/?t=41.Duties and Responsibilities, include but are not limited to:Performing administrative duties for the office, including:1. Maintaining records/filing systems and processing mail from clients, USCIS, FBI, ICE, etc.2. Handling telephone and walk-in reception duties, including scheduling client appointments for all staff3. Assisting attorneys with administrative tasks needed in a client’s immigration case, through a workshare task model4. Translating (documents) + interpreting (at hearing & interviews) for clients between Spanish & English5. Managing and monitoring client data collection, client database and calendaring systems6. Registering custodians of unaccompanied minors in removal proceedings for legal orientation sessions7. Assisting with various operational duties, including managing facilities and leading background/creative projects8. Regularly using Microsoft Office, Cerenade (e-Immigration air) software and forms, and Google Drive: docs + sheetsRequirements:1. High school diploma [ + Bachelor/Associate degree: preferred, but not required]2. Spanish language fluency: oral and written. The position requires the ability to communicate daily through oral and written communications in both Spanish and English. The administrative assistant will regularly interact with monolingual Spanish speakers. Please clearly specify in your application your ability to fluently communicate in both Spanish and English.Other Qualifications:1. Reliability2. Enthusiasm to work in a fast-paced legal office and to adapt to changes3. Meticulous attention to detail4. Demonstrated interest in low-income legal services and/or a commitment to civil liberties and immigrants' rights5. Ability to work effectively with victims of domestic violence, sexual assault, and other violent crimes",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/164f2429b4404fd2a274ea66ca09f697-administrative-assistant-immigration-center-for-women-and-children-immigration-center-for-women-and-children-san-francisco"
    },
    {
        "position": "Senior Resident Services Coordinator - 937 Clay, Swiss American",
        "company": "Chinatown Community Development Center",
        "description": "Job Summary: The Senior Resident Services Coordinator provides overall community-wide support to residents living at 937 Clay and Swiss American Hotel, two Single Room Occupancy (SRO) hotels with a combined 90+ units in the Chinatown neighborhood. The position requires a motivated and resourceful individual who is sensitive to resident needs; has excellent service coordination, team-building and group facilitation skills; and thrives in a relatively independent work environment. This position is a single site-based role which interacts directly with both the property management and resident service teams.Status: Full-time, NonexemptLocation: Chinatown neighborhood, San FranciscoHours: Monday through Friday 9:00 a.m. to 5:30 p.m., plus some nights and weekendsSalary: DOE; Comprehensive benefitsThe Organization: A private non-profit founded in 1977, Chinatown Community Development Center believes in a comprehensive vision of community. We own and/or manage approximately 30 affordable housing buildings serving over 3,800 low-income seniors, single adults, formerly homeless adults, and families of diverse ethnic and cultural backgrounds in San Francisco’s Chinatown, Tenderloin, Western Addition, and Polk Gulch neighborhoods. We also build housing, develop grassroots leadership, and engage low-income residents and youth. Our employees are passionate about the mission; thrive in a family organizational culture; and embody values of empowerment, teamwork, and compassion. Chinatown CDC serves a diverse population and is committed to hiring practices that provide culturally competent services. We encourage people of color to apply.General Job Responsibilities:  Case Work/ Information and Referral/Housing education:   Orient residents to Resident Services, helping to identify services/benefits that best fit their needs  Provide direct services such as, information and referrals, translation/interpretation assistance, and service connections to local social service and government agencies  Provide outreach and assistance to residents on housing-related issues  Develop on-going cooperative network of government and social service agencies  Serve as an advocate and liaison for residents with service agencies and/or property management  Work in partnership with Property Management to educate residents on their rights and responsibilities   Resident Community Building:   Implement a variety of activities that promote healthy community among residents, facilitating support groups, social celebrations, and resident empowerment  Plan and coordinate on-site and off-site educational, social, and recreational activities that may include, but are not limited to, the following: health, safety, and nutrition workshops; holiday celebrations; outings; voter education; disaster preparedness workshops; and fire drills   Provide mediation between residents when needed  Support resident leadership and empowerment by providing technical assistance to Resident Councils (if applicable) and working with residents to recruit and sustain volunteers for programs  Work with property staff and residents to develop and implement activities and systems that promote safety and security  Educate and/or link residents to community/neighborhood projects that impact their quality of life, so they may provide input  Work with resident council members when needed and if applicable   Administrative:   Maintain resident files on all services provided, including intakes, needs assessments, service plans, referrals, and outcomes  Track resident services data in multiple databases on a regular basis  Complete/maintain service reports, grant reports, activities budgets, program files, and other paperwork  Provide information for and/or assist with writing grant applications  Conduct resident surveys to measure programs  Create monthly calendar of events and activities, and produce outreach flyers and quarterly newsletters  Assist in recruiting and supervising volunteers  Assist Resident Services team and at organization events  Attend meetings and training   Knowledge, Skills, and Experience:  Ability to work with people from ethnically and socio-economically diverse backgrounds Sensitivity to issues facing elderly populations Ability to facilitate group meetings with challenging participants Crisis de-escalation and resolution skills   Strong inter-personal and effective communication skills  Ability to work independently as well as in a team structure  Genuine enthusiasm for meeting, motivating, and involving people in community activities   Minimum Qualifications:Academic qualifications:o Bachelor’s Degree in Social Work or related field and two (2) years of experience in providing direct services in the form of information, referrals, and/or linkages to community and public resources to low-income populations and one (1) year of experience in developing, organizing, and implementing group activities, or  o High school diploma or GED and a combination of five (5) years of experience in providing direct services in the form of information, referrals, and/or linkages to community and public resources to low-income populations as well as experience in developing, organizing, and implementing group activities   Bilingual and biliterate in English/Cantonese  Demonstrated commitment to and knowledge of Chinatown neighborhood and community resources  Experience working with older adults  Experience working with adults with mental health and or substance abuse issues  Knowledge of, and sensitivity to, the needs of low-income people  Ability to travel and coordinate services for several buildings in San Francisco  Demonstrated knowledge and commitment to community organizing as a tool to increase resident engagement and leadership development   Preferred Qualifications:   Knowledge of public benefits and how to screen for benefits eligibility  Experience providing services to seniors and adults with substance use/mental health needs   Experience delivering services to SRO resident communities   Experience working with on-site Property Management to promote housing stabilization/retention for low-income residents  Prior experience measuring program outcomes",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/e025fbb94d5549bcb91baeccdabffb3d-senior-resident-services-coordinator-937-clay-swiss-american-chinatown-community-development-center-san-francisco"
    },
    {
        "position": "Senior Resident Services Coordinator - Clayton & Tower",
        "company": "Chinatown Community Development Center",
        "description": "Job Summary: The Senior Resident Services Coordinator provides support to approximately 120 residents, mainly the elderly, living in Single Room Occupancy (SRO) hotels in the Chinatown and North Beach neighborhoods. The position requires a motivated and resourceful individual who is sensitive to residents' needs; has excellent service coordination, team-building and group facilitation skills; and thrives in a relatively independent work environment in a team setting with other providers. This is a floater position where the person provides services at two sites.Status: Full-time, Nonexempt     Location: Chinatown and North Beach neighborhoods, San Francisco     Hours: Monday through Friday 9:00 a.m. to 5:30 p.m., plus some nights and weekends     Salary: DOE; Comprehensive benefitsThe Organization: A private non-profit founded in 1977, Chinatown Community Development Center believes in a comprehensive vision of community. We own and/or manage approximately 30 affordable housing buildings serving over 3,800 low-income seniors, single adults, formerly homeless adults, and families of diverse ethnic and cultural backgrounds in San Francisco’s Chinatown, Tenderloin, Western Addition, and Polk Gulch neighborhoods. We also build housing, develop grassroots leadership, and engage low-income residents and youth. Our employees are passionate about the mission; thrive in a family organizational culture; and embody values of empowerment, teamwork, and compassion. Chinatown CDC serves a diverse population and is committed to hiring practices that provide culturally competent services. We encourage people of color to apply.General Job Responsibilities: Case Work/ Information and Referral  Orient residents to Resident Services, conducting intake to identify services/benefits that best fit their needs Provide direct services such as general information, referrals, translation/interpretation assistance and service connections to local social service and government agencies   Provide outreach and assistance to residents on housing-related issues Complete detailed case notes, thoroughly documenting referrals, services plans and outcomes Develop on-going cooperative network of government and social service agencies Serve as an advocate and liaison for residents with service agencies and/or property managementResident Community Building  Implement activities that promote healthy community among residents, facilitating support groups, social celebrations, and resident empowerment Plan and coordinate on-site and off-site educational, social, and recreational activities that may include, but are not limited to, the following: health, safety, and nutrition workshops; holiday celebrations; outings; voter education; disaster preparedness workshops; and fire drills  Provide mediation between residents when needed Support resident leadership and empowerment through volunteerism and working with residents to recruit and sustain volunteers for programs Work with property staff and residents to develop and implement activities and systems that promote safety and security Educate and/or link residents to community/neighborhood projects that impact their quality of life, so they may provide input Work with resident council members when needed and if applicableAdministrative Support  Maintain resident files on all services provided, including intakes, needs assessments, service plans, referrals, and outcomes Track resident services data in multiple databases on a regular basis Complete/maintain service reports, grant reports, activities budgets, program files, and other paperwork Provide information for and/or assist with writing grant applications Conduct resident surveys to measure programs Create monthly calendar of events and activities, and produce outreach flyers  Assist in recruiting and supervising volunteers Assist Resident Services team at organization events Attend meetings and trainingsKnowledge, Skills, and Experience: Ability to work with people from ethnically and socio-economically diverse backgrounds  Sensitivity to issues facing elderly and disabled populations  Ability to facilitate group meetings with challenging participants   Crisis de-escalation and resolution skills  Strong inter-personal and effective communication skills Ability to work independently as well as in a team structureGenuine enthusiasm for meeting, motivating, and involving people in community activitiesMinimum Qualifications: Academic qualifications: o Bachelor’s Degree in Social Work or related field and two (2) years of experience in providing direct services in the form of information, referrals, and/or linkages to community and public resources to low-income populations and one (1) year of experience in developing, organizing, and implementing group activities, or o High school diploma or GED and a combination of five (5) years of experience in providing direct services in the form of information, referrals, and/or linkages to community and public resources to low-income populations as well as experience in developing, organizing, and implementing group activities Bilingual and biliterate in English/Chinese  Demonstrated commitment to and knowledge of Chinatown neighborhood and community resources Experience working with older adults Experience working with adults with mental health and or substance abuse issues Knowledge of, and sensitivity to, the needs of low-income population Ability to travel and coordinate services for several buildings in San Francisco Demonstrated knowledge and commitment to community organizing as a tool to increase resident engagement and leadership developmentPreferred Qualifications:  Knowledge of public benefits and how to screen for benefits eligibility Experience providing services to older adults and adults with substance use/mental health needs  Experience delivering services to SRO resident communities  Experience working with on-site Property Management to promote housing stabilization/retention for low-income residentsPrior experience measuring program outcomes",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/f31e717138b84442b9d71b14b83bdb1f-senior-resident-services-coordinator-clayton-tower-chinatown-community-development-center-san-francisco"
    }
]