[
    {
        "position": "Financial Controller",
        "company": "Sustainable Fisheries Partnership Foundation",
        "description": "Background on SFP: The mission of Sustainable Fisheries Partnership (SFP) is to work toward rebuilding depleted fish stocks, reducing the environmental impacts of fishing and fish farming, and ensuring sustained economic opportunities for fishing communities worldwide. SFP improves access to information that can guide responsible seafood sourcing, and enhances the ability of seafood companies and partners to work with governments to improve policies and management practices in support of sustainable fisheries and aquaculture sectors. Visit www.sustainablefish.org to learn more. Position Description and Responsibilities: This is a remote-work position, for which candidates should be based in Hawaii or the US West Coast. The anticipated start date for this position is 3 August 2020. The Controller is responsible for oversight of all accounting operations of the organization, to include the production of periodic financial reports for internal, external and donor constituents, maintenance of an adequate system of accounting records and a comprehensive set of controls and budgets designed to mitigate risk, enhancing the accuracy of the company's reported financial results, and ensuring that reported results comply with generally accepted accounting principles (US-GAAP).Reporting to the CFO, the Controller oversees all day-to-day accounting operations of the organization and supervises a team of 3 staff members. The Controller has functional responsibility over accounting, accounts payable, accounts receivable, payroll, and grants administration and accounting, as well as training and identification of training needs. The Controller ensures that SFP has the systems and procedures in place to support effective program implementation and support flawless audits of its financial reports and systems.  This position also works closely with program leaders and their staffs, not only to educate them regarding finance and accounting procedures but also to explore how the finance function can support program operations.In addition, the Controller partners with the CFO, senior leadership, human resources (HR) and information technology (IT) staff to enhance and better integrate finance, HR, and IT functions and streamline information flows. Key Responsibilities and Activities:(20%) Oversee all accounts, financial ledgers, and reporting systems to ensure compliance with appropriate GAAP standards and regulatory requirements; maintain internal control and safeguards for receipt of revenue, costs, and program budgets and actual expenditures; maintain a documented system of accounting policies and procedures, oversee training of finance team staff and identify training needs.  (20%) Consistently analyze financial data and present financial reports in an accurate and timely manner; clearly communicate periodic donor and program status reports, as well as monthly, quarterly, and annual financial statements; monitor progress and changes and keep senior leadership abreast of SFP’s financial status. (20%) Oversee all financial, projects/programs, and grants accounting; ensure that expenditures are consistently aligned with grant, project and program budgets throughout the grant/fund period; and work with Development division and CFO to prepare financial reporting materials for government, corporate, and foundation grants. (15%) Manage the day-to-day financial and accounting activities including accounts payable, accounts receivable, bank reconciliations, and payroll. (10%) Support the CFO in engaging the board’s audit and finance committees around issues and trends in financial operating models and delivery. (5%) Coordinate the annual financial statement audit with external auditor and provide requested documents; coordinate preparation of Form 990 and ensure timely filing with the IRS; and ensure timely and accurate regulatory and tax filings to state and federal government. (5%) Assist CFO in the annual budgeting and planning process; administer and review all financial plans and funding proposals and compare to actual results with a view to identify, explain, and correct variances as appropriate. (5%) Other administrative matters and assigned projects.Essential Qualifications and Skills:Seven to ten years of progressively responsible accounting and finance experience.BS or equivalent in Accounting or Finance, MBA and/or CPAKnowledge of finance, accounting, budgeting, and cost control principles including Generally Accepted Accounting Principles (GAAP) and non-profit regulatory filings.Advanced skills in Excel, with ability to create and maintain complex pivot table reports.Knowledge of automated financial and accounting report systems. Ability to analyze financial data and prepare financial reports, statements and projections. Working knowledge of short and long term budgeting, forecasting, and project accounting.Strong interpersonal and communication skills. Ability to work with and motivate multicultural teams to produce quality materials within tight timeframes and simultaneously manage several projects. Ability to participate in and facilitate group meetings, both face-to-face and virtual.Demonstrable leadership skills in managing a teamAbility to work productively and manage a team in a remote office setting (i.e., primarily via Skype, email, webinars, and other electronic means, etc.) Scheduling flexibility to accommodate a virtual organization with staff working from home offices around the globe e.g., ability to work with Indonesia based staff during their work day, ability to work with European based staff during their work day, etc.Personal qualities of integrity, credibility, and a commitment to SFP mission.Desirable Qualifications and Skills:·        Experience working for a non-profit organization, charity or NGO ·        Experience working with government and foundation grantsDuration/Level of Effort: This is a full-time/ position. Level of Effort is expected to be 40 hours per week. Compensation: Competitive and based on experience.Application:  The deadline is 10 July 2020. All inquiries will be kept in the strictest confidence. Qualified candidates should submit the following to jobs@sustainablefish.org with the subject line “Controller”:·        Resume/CV·        Letter of interest (no more than 1 page)",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/61561094df9a44d298a4fb05094ecb69-financial-controller-sustainable-fisheries-partnership-foundation-honolulu-or-elsewhere-in-hawaii"
    },
    {
        "position": "Resource Coordinator",
        "company": "EAH Housing",
        "description": "This position is for a full-time Resource Coordinator to work at Kalani Gardens and Villages of Moa'e Ku, two multi-family communities in Mililani and Ewa Beach, HI. Qualified candidates will have a BA degree in Social Services, Healthcare or related field and have 1+ years of social service experience working with families. Position pays between $20.34/hr to $24.12/hr DOE.COMPANY OVERVIEWEAH Housing has been developing, managing and promoting affordable housing since 1968. We are one of the largest and most respected nonprofit housing development and management organizations in the western United States. With a staff of over 450, EAH develops multi-family housing, manages over 100 properties in California and Hawaii, and plays a leadership role in local, regional and national housing advocacy efforts.At EAH, we put our core values into action on a daily basis. We recognize that training is a critical investment in the success of our employees and in the continued excellence of EAH. Please visit our website to learn more about our culture and read employee comments to learn more about what it would be like to work at EAH.For immediate consideration please apply to requisition RESOU02092 on our website at  www.eahhousing.org/careersPOSITION OVERVIEWThe Resource Coordinator assists residents by connecting them with existing social services provided by public agencies or private practitioners within the community, examines the needs for on-site services and explores ways programs and services can be brought to the property.RESPONSIBILITIESCoordinates and oversees the delivery of services and program activities to residents both on and off-site.Utilizes intake survey/needs assessments to determine what types of programs and services would benefit the residentsRecruits, assists and links residents with services and program activitiesAttends all resident council meetingsDefines and monitors individual service plans for seniors and people in transitionInterfaces with provider agencies, public agencies and community volunteer agenciesQUALIFICATIONSBA Degree in Social Services, Healthcare or related field, or equivalent combination of education and/or experience.1-2 years of social service experience working with elderly, familiesCRIMINAL BACKGROUND CHECK REQUIREMENTSEAH Housing conducts criminal background checks on all candidates who have received a conditional job offer. Once you have receive such an offer, you will be required to submit and pass our criminal background requirements. Please be advised that certain roles may also require fingerprinting due to legal requirements. If onsite housing is a requirement of the position, any household members over 18 years of age who will be living onsite with the candidate must also undergo a criminal background check and tenant screening. Satisfactory completion of background check and fingerprinting requirements is a requirement of employment with EAH.    BENEFITSWe offer a comprehensive benefits package that includes medical, dental, vision, disability and life insurance, as well as a 403(b) retirement plan with a percentage match. We also offer a generous vacation accrual, holiday schedule and work schedule flexibility.EAH Housing is an AA/EEO/Veterans/Disabled Employer. CA BRE #00853495 | HI RB-16985",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/3d460557ac4442a0b06bd1397a5ca236-resource-coordinator-eah-housing-mililani"
    },
    {
        "position": "Behavioral Health Lead",
        "company": "Mendocino Coast Clinics",
        "description": "The Behavioral Health Lead reports directly to the Operations Director and will will be responsible for providing on going counseling to their assigned clients and providing Clinical Supervision to the Behavioral Health Professionals and the Case Managers. Supervise the Behavioral Health and Suboxone Case ManagersMinimum QualificationsMust posses a current and active license as an LCSW, Psychologist, to practice counseling in the State of CaliforniaOne to two years Lead experience preferredTwo to three years Behavorial Health clinic experience required",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/5c377c6a71fb4457b0e585b8a898e9fc-behavioral-health-lead-mendocino-coast-clinics-fort-bragg"
    },
    {
        "position": "Lead Case Manager at Glide Community Housing",
        "company": "Tipping Point Community",
        "description": "Tipping Point Community is posting on behalf of Glide Community Housing as a part of our Chronic Homelessness InitiativeAbout Glide Community Housing:The Mission and program goal of Glide Community Housing, Inc. Support Services is to break the cycle of multigenerational dependency, poverty, and low self-worth by providing a safe and nurturing environment that offers services that foster an overall sense of well-being, improve quality of life and help individuals and families maintain stable housing. Our supportive housing complex serves single adults and families living in one of our three high rise apartment buildings located in the heart of San Francisco's Tenderloin neighborhood.About the position:Title: Lead Case ManagerDepartment: Glide Community Housing, Inc.Reports to: Program ManagerFLSA Status: Non-exemptDirectly leads: NoneThe Lead Case Manager operates in a flexible, collaborative, resident-centered model responding to the daily and overall hopes and needs of the resident community. This person is responsible for working alongside individual residents, the resident community, and their teams of support to promote residents’ preferred relationships to housing retention and stability, as well as overall wellness. The Lead Case Manager will 1) have a defined group of residents to work alongside with, 2) provide leadership and support to other support services staff, interns and volunteers, as needed and as directed, 3) be a liaison with property management (and, as directed, contracting agencies) around resident-related concerns, 4) take administrative/managerial/clinical leadership on services team in absence of Program Manager and, in general, at site level for daily functioning, and, 5) work with the Program Manager and other team members around charting, auditing and reporting compliance needs. Regular and predictable attendance is essential.Essential duties + responsibilities:Essential duties and responsibilities include the following. Other duties can be assigned, and the duties and responsibilities of the job are subject to change without notice.Adhere to all laws and requirements regarding confidentiality, professional ethics, child and adult protective services, contractual agreements, etc.Conduct outreach and maintain high visibility in the resident community.Develop and lead, alongside the resident community, groups that create space for mutual knowledge sharing, celebration, and learning.Document resident contacts within the timeframe established. Ensure all resident contacts and notes describing work together are input into the Circe software system accurately and weekly.Provide support and training to other team members and interns/volunteers around notetaking, charting, and use of the Circe software system.Interpret and explain laws, regulations, and service programs to residents pertaining to housing, education, health, substance misuse, mental health related-activities, and other relevant activities.Help ensure team documentation is appropriately prepared for site audits and written reports.Manage petty cash and other administrative/managerial on-going tasks in absence of, and in collaboration with, Program Director, as directed.Facilitate or coordinate facilitation of team and site-level meetings with staff and residents in absence of Program Director and as directed;Provide advocacy and referral activities. Take leadership on in providing ongoing development of collaborations that enhance support of residents and resident community.Proactively engage residents in conversations, and linkages needed, to help them develop a preferred relationship to problems and to navigate challenges related to movement towards these intentions and hopes. Continue to help re-negotiate and re-define steps towards these hopes or preference to build in success, as defined by resident.Provide crisis intervention.Provide ongoing resource and service development alongside resident community to support residents having preferred relationship to problems and intentions.Meet professional obligations through efficient work habits such as: meeting deadlines, honoring schedules, attending and actively participating in staff and individual meetings and trainings.Attend off-site and agency meetings relevant to residents’ needs and/or for agency representation, including in place of the Program Director, as needed.Support tenant leadership on-site, including acting as a liaison between management and resident leaders and supporting their overall success.Meet professional obligations, also, through the following: not inquiring about difficulties before having first built a foundation of competence, connection and hope; actively eliciting residents’ wisdom that could contribute to resolving difficulties in their lives; not using objectifying language in any discussions without considering how residents might experience it or how it might shape our thinking about residents; actively thinking about the ways in which our own assumptions about race, gender, class, and sexual orientation affect our interactions with all residents; and routinely soliciting residents’ feedback about their preferences for the direction of our work together and the effects of our actions on them.Supervisory responsibilities: NoQualifications:Ability to deal with difficult interactions. Strong conflict resolution skills. Able to defuse potentially volatile situations with patience and tact.Ability to prioritize work and multi-task within specific timelines.Adheres to professional boundaries and standards. Understands and follows basic ethics, values and principles of social work practice, including those mentioned above.Demonstrated knowledge of and experience implementing effective therapeutic strategies with people struggling with complicated relationships to problems.Demonstrated knowledge of principles and techniques of co-assessment, collaborative helping strategies, counseling, and harm reduction practice.Excellent interpersonal skills. Ability to establish and maintain effective working relationships with those contacted in the course of work. Exercises sound judgment in interactions with others.Knowledge of resources which might benefit resident community and that residents can offer each other and staff to benefit others.Possesses understanding of residents’ community and the range of problems (including socio-political) and local knowledges that often join these problems.Works well under pressure and manages stress effectively in a demanding and fast paced environment.Demonstrates Cultural humility. Has the ability to work effectively across cultures. Demonstrates a commitment to staying curious, learning, communicating, and working respectfully with people different from themselves.Commitment to the mission, values and philosophy of Glide Community Housing, Inc.Education and/or experience:MA degree in Social Work/Psychology or related field and 2+ years’ case management experience or BA degree in Social Work/Psychology or related field and a minimum of 4 years’ case management experience working with socially and/or economically marginalized people with challenges negotiating their preferred relationship to multiple problems impacting their lives, or an equivalent combination of education and experience;Supervisory and/or program management experience desired;Extensive experience working in a community-based social service agency with adults, families, and/or seniors in relationship with homelessness and poverty and the problems that often come alongside these experiences;Experience working with people to co-develop and co-lead spaces of celebration, learning and exchange of knowledge.Certificates, Licenses, Registrations: NoneMathematical skills:Basic mathematical skills.Computer skills:Competent in the use of a computer, specifically MS Office Suite and ETO. Physical requirements:The physical demands described here is representative of that which an employee encounters while performing the essential functions of this job. Reasonable accommodations can be made to enable individuals with disabilities to perform the essential functions.Vision corrected in normal range.Hearing corrected in normal range. Ability to communicate effectively in person or via telephone in a manner which can be understood by those with whom the person is speaking.Able to use equipment typically found in an office environment. Uses standard office equipment and inputs and retrieves information from a computer. Uses computer keyboard with manual and finger dexterity and wrist-finger speed sufficient to perform repetitive actions efficiently for extended periods of time.Activities that occur frequently are sitting, standing, walking, and handling. Activities that occur infrequently are bending, crouching, kneeling, twisting, reaching straight above and below shoulder level, carrying and lifting up to 25 pounds.Ability to sit for minimum periods of one hour at a time and come and go from the work area repeatedly throughout the day. Ability to move quickly to address emergency or potentially dangerous situations. Ability to move about the building and the organization as needed.As this position requires periods of sitting and repetitive use of a telephone, computer and other office equipment, this person must take frequent short breaks and integrate stretching into her/his daily duties to avoid musculoskeletal disorders.Ability to use public and/or private modes of transportation. Duties are office based, but travel to various San Francisco venues is required, as is accompanying residents to off-site appointments.Work environment: The work environment described here is representative of that which an employee encounters while performing the essential functions of this job. Reasonable accommodations can be made to enable individuals with disabilities to perform the essential functions.Community based social service office environment that serves residents who can struggle with their relationships to anger and fear in ways that manifest as aggressive behavior.Noise level is moderate, and lighting is conducive to completion of work;Potential exposure to a range of pests and other occupational hazards related to working in a housing site in the Tenderloin.Glide Community Housing, Inc.’s buildings are in the Tenderloin, a high-crime neighborhood. Due to our surroundings, it is important to always be aware of what is going on around you while walking around the neighborhood.Tipping Point Community is posting on behalf of Glide Community Housing as a part of our Chronic Homelessness Initiative",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/c515da0347af4fe098518791fe18a9e9-lead-case-manager-at-glide-community-housing-tipping-point-community-san-francisco"
    },
    {
        "position": "Lead Case Manager - Family Specialist at Glide Community Housing",
        "company": "Tipping Point Community",
        "description": "Tipping Point Community is posting on behalf of Glide Community Housing as a part of our Chronic Homelessness InitiativeAbout Glide Community Housing:The Mission and program goal of Glide Community Housing, Inc. Support Services is to break the cycle of multigenerational dependency, poverty, and low self-worth by providing a safe and nurturing environment that offers services that foster an overall sense of well-being, improve quality of life and help individuals and families maintain stable housing. Our supportive housing complex serves single adults and families living in one of our three high rise apartment buildings located in the heart of San Francisco's Tenderloin neighborhood.About the position:Job title: Lead Case Manager (family specialist)Department: Glide Community Housing, Inc.Reports to: Program ManagerFLSA Status: Non-exemptDirectly leads: NoneThe Lead Case Manager (Family Specialist) operates in a flexible, collaborative, resident-centered model responding to the daily and overall needs and hopes of the resident community. This person is responsible for generally working alongside individual residents, families, and the resident community--and their teams of support--to promote residents' and families' preferred relationships to housing retention and stability, as well as overall wellness. Lead Case Manager (family specialist) primarily, but not exclusively, offers direct services, activities, and overall support specifically targeting resident and \"extended family\" children, youth and families. The Case Manager II will also 1) support the Lead Case Manager around administrative needs when supervisor is not onsite, 2) work, similar to Lead Case Manager, with residents with more challenging relationships to problems, as needed, and 3) provide mentoring to interns, volunteers and new staff. Regular and predictable attendance is essential.Essential duties + responsibilities:Essential duties and responsibilities include the following. Other duties can be assigned, and the duties and responsibilities of the job are subject to change without notice.Adhere to all laws and requirements regarding confidentiality, professional ethics, child and adult protective services, contractual agreements, etc.Assist parents/guardians in creating and maintaining a healthy, safe, and nurturing environment for their children and youth in partnership with their teams of support.Assist parents/guardians with family preservation and/or reunification.Document resident/family contacts within the timeframe established. Ensure all resident/family contacts and notes describing work together are input into ETO accurately and weekly.Conduct outreach and maintain high visibility in the resident community.Develop and lead, alongside resident community, groups and activities targeting children, youth, and families that create space for mutual knowledge sharing, celebration, and learning.Provide advocacy and referral activities.Coordinate with Lead Case Manager and Program Manager to provide ongoing development of collaborations that enhance support of residents and the resident community, particularly, but not exclusively, as it relates to children, youth and families.Proactively engage residents/families in conversations, and linkages needed, to help them develop preferred relationship to problems and navigate challenges related to movement towards these/their intentions and hopes. Continue to help re-negotiate and re-define steps towards these hopes or preference to build in success, as defined by residents/families.Provide crisis intervention.Provide ongoing resource and service development alongside resident community/families to support residents/families having preferred relationship to problems and hopes.Meet professional obligations through efficient work habits such as the following: meeting deadlines, honoring schedules, attending and actively participating in staff and individual meetings and trainings. Attend off-site meetings particularly relevant to families and/or for agency representation.Meet professional obligations also through the following: not inquiring about difficulties before having first built a foundation of competence, connection, and hope; actively eliciting residents' wisdom that could contribute to resolving difficulties in their lives; not using objectifying language in any discussions without considering how residents might experience it or how it might shape our thinking about residents; actively thinking about the ways in which our own assumptions about race, gender, class, and sexual orientation affect our interactions with all residents; and routinely soliciting residents' feedback about their preferences for the direction of our work together and the effects of our actions on them.Supervisory responsibilities: None Qualifications:Ability to deal with difficult interactions. Strong conflict resolution skills. Able to defuse potentially volatile situations with patience and tact.Ability to prioritize work and multi-task within specific timelines.Adheres to professional boundaries and standards. Understands and follows basic ethics, values and principles of social work practice, including those mentioned above.Demonstrated knowledge of and experience implementing effective therapeutic strategies with individuals/families struggling with challenging relationships to problems.Demonstrated knowledge of principles and techniques of co-assessment, collaborative helping strategies, counseling, and harm reduction practice, including how they relate to work with families, children, and youth.Excellent interpersonal skills. Ability to establish and maintain effective working relationships with those contacted in the course of work. Exercises sound judgment in interactions with others.Knowledge of resources which might benefit resident community and that residents/families can offer each other and staff to benefit others.Possesses understanding of residents' communities and the range of problems (including those embedded within the socio-political context) and local knowledge that often join with or help go against these problems for children, youth, and families;Works well under pressure and manages stress effectively in a demanding and fast paced environment.Demonstrates Cultural Humility. Has the ability to work effectively across cultures. Demonstrates a commitment to staying curious, learning, communicating, and working respectfully with people different from themselves.Commitment to the mission, values and philosophy of Glide Community Housing, Inc.Education and/or experience:MA degree in Social Work/Psychology or related field and 2+ years' case management experience or BA degree in Social Work/Psychology or related field and a minimum of 4 years' case management experience working with socially and/or economically marginalized families with challenges negotiating their preferred relationships to multiple problems, or an equivalent combination of education and experience.Experience working in a community based social service agency with people in relationship with homelessness and poverty and the problems that often come alongside these experiences. 3 Glide Community Housing, 333 Taylor street, San Francisco, CA. 94102.Experience working with children, youth and families to co-develop and co-lead spaces of celebration, learning, and exchange of knowledge impacting their lives. ▪ Experience working in and/or alongside other systems that often affect the lives of poor and marginalized families.Certificates, Licenses, Registrations: None Communication skills:Proficiency in a second language strongly desired;Exceptionally strong communication skills.Proficiency in spelling, grammar and writing needed to draft detailed instructions, service plans, correspondence, memos, and other required documentation.Mathematical skills: Basic mathematical skills.Computer skills:Competent in the use of a computer, specifically MS Office Suite and ETO.Physical requirements:The physical demands described here is representative of that which an employee encounters while performing the essential functions of this job. Reasonable accommodations can be made to enable individuals with disabilities to perform the essential functions.Vision corrected in normal range.Hearing corrected in normal range. Ability to communicate effectively in person or via telephone in a manner which can be understood by those with whom the person is speaking.Able to use equipment typically found in an office environment. Uses standard office equipment and inputs and retrieves information from a computer. Uses computer keyboard with manual and finger dexterity and wrist-finger speed sufficient to perform repetitive actions efficiently for extended periods of time.Activities that occur frequently are: sitting, standing, walking, and handling. Activities that occur infrequently are: bending, crouching, kneeling, twisting, reaching straight above and below shoulder level, carrying and lifting up to 25 pounds;Ability to sit for minimum periods of one hour at a time, and come and go from the work area repeatedly throughout the day. Ability to move quickly to address emergency or potentially dangerous situations. Ability to move about the building and the organization as needed.As this position requires periods of sitting and repetitive use of a telephone, computer and other office equipment, this person must take frequent short breaks and integrate stretching into her/his daily duties to avoid musculoskeletal disorders;Ability to use public and/or private modes of transportation. Duties are office based, but travel to various San Francisco venues is required, as is accompanying residents to offsite appointmentThank you for your interest in working with GLIDE Housing and we look forward to meeting you. Due to the high volume of responses anticipated, we will only respond to candidates who are under consideration. No phone calls, please.GLIDE Community Housing is an equal opportunity employer.Tipping Point Community is posting on behalf of Glide Community Housing as a part of our Chronic Homelessness Initiative",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/859b34601e444c72b70317de7645f123-lead-case-manager-family-specialist-at-glide-community-housing-tipping-point-community-san-francisco"
    },
    {
        "position": "Case Manager II (Supportive Housing Program) at Conard House",
        "company": "Tipping Point Community",
        "description": "Tipping Point Community is posting on behalf of Conard House as a part of our Chronic Homelessness InitiativeAbout Conard House:Conard House Inc. is a nonprofit organization building communities and restoring hope. We work with a diverse adult population and strive for cultural competency/humility by respecting experience, promoting inclusion, and building community. About the position:Position: Case Manager II (CM II), multiple job openings, full-time, Non-licensed or Non-waivered (MHRS)Salary: $23.35 per hour ($48,568.00 annualized) with excellent benefits. Additionally $3/hour premium pay available for direct services May –June 2020Reports to: Program Director II or IIIThis position is with the Outpatient Services within the Supportive Housing Program. This program provides housing, case management, and income advocacy for adult residents in nine Single Resident Occupancy (SRO) Hotels in the Tenderloin and South of Market area and scattered-site shared apartments located throughout San Francisco. Additionally, staff at Outpatient Services provide individual and group rehabilitation services, individual and group therapy, assessment and treatment planning, and crisis intervention pertaining to their scope of practice. We are committed Equal Opportunity Employer. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrests and conviction records. This position is included in the collective bargaining unit SEIU Local 1021.Qualifications: BA or equivalent years of experience and two years of experience providing direct services including work with individuals who also experience mental health, substance use, and physical health conditions. Applicants must have a working knowledge of psychiatric medications, psychological terminology, and mental health and social services in San Francisco.Effective advocacy, organizational, and communication skills are essential. The ability to work as a team member towards common goals and objectives is required. Applicants must have the ability to document using electronic database according to Medi-Cal guidelines. Experience with Medi-Cal billing and AVATAR database preferred. After a conditional offer of hire, a criminal back ground check will be reviewed. Ability to travel to meetings off-site required. However, personal vehicle is not required. Duties:Provide mental health services to clients and document services in AVATAR according to Conard House and Medi-Cal guidelines.Meet monthly billing target.Provide resources to clients on a broad range of problems in a manner that is supportive, constructive and non-judgmental.Admit and orient new clients to the program.Assess client's need for medical and psychiatric evaluations and make appropriate referrals.Develop and implement case management and money management plans and contracts.Coordinate Plans of Care with other services being provided to the client.Provide advocacy assistance pursuing entitlements, clothing, health care, mental health services and other issues. Maintain entitlements and ensure proper completion of client applications and forms.Conduct groups and activities oriented toward stabilized living. Facilitate interaction among clients and involvement in the social program.Maintain a supportive, independent living environment.Facilitate community building within the hotel and assist clients in utilizing hotel community resources.Intervene in crisis situations according to procedures.Assist clients with daily living skills.Develop and implement plan for client placement upon discharge from program. People from diverse cultural backgrounds encouraged to applyTipping Point Community is posting on behalf of Conard House as a part of our Chronic Homelessness Initiative",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/515bf34b79d9404c8e607dba1e797cc5-case-manager-ii-supportive-housing-program-at-conard-house-tipping-point-community-san-francisco"
    },
    {
        "position": "Case Manager III at Conard House",
        "company": "Tipping Point Community",
        "description": "Tipping Point Community is posting on behalf of Conard House as a part of our Chronic Homelessness InitiativeAbout Conard House:Conard House Inc. is a nonprofit organization that builds community and restores hope. We work with a diverse adult population and strive for cultural competency/humility by respecting experience, promoting inclusion, and building community.About the position:Position: Case Manager III (CM III), multiple positions, (Full-time), Waivered or Licensed Reports to: Program Director II or IIISalary: CM III: $24.28 per hour ($50,502 annualized) with excellent benefits. Additionally $3/hour premium pay available for direct services May –June 2020This position is with the Outpatient Services within the Supportive Housing Program. This program provides housing, case management, and income advocacy for adult residents in nine Single Resident Occupancy (SRO) Hotels in the Tenderloin and South of Market area and scattered-site shared apartments located throughout San Francisco. Additionally, staff at Outpatient Services provide individual and group rehabilitation services, individual and group therapy, assessment and treatment planning, and crisis intervention pertaining to their scope of practice. We are a committed equal opportunity employer. Pursuant to the City and State’s Fair Chance Ordinance, we will consider for employment qualified applicants with conviction records. This position is included in the collective bargaining unit SEIU Local 1021.Licensure supervision hours for LCSW, MFT, LPCC, Ph.D., Psy.D. are available for waivered staff. Waivered: Accruing licensure hours as a Registered AMFT, ASW, APCC with California Board of Behavioral Sciences or as a Registered Psychologist with California Board of Psychology.  Qualifications:Must be licensed in the state of CA or registered with the Board of Behavioral Science or Board of Psychology.  Licensure hours for LCSW, MFT, LPCC or Psychology are available. Must have experience providing direct services including work with individuals who experience mental health, substance use, and physical health conditions. Applicants must have a working knowledge of psychiatric medications, psychological terminology, and mental health and social services in San Francisco.Effective advocacy, organizational, and communication skills are essential. The ability to work as a team member towards common goals and objectives is required. Applicants must have the ability to document using electronic database according to Medi-Cal guidelines. Experience with Medi-Cal billing and AVATAR database preferred. Ability to travel to meetings off-site required. However, personal vehicle is not required.Must successfully complete education and reference verification. After a conditional offer of hire, a criminal background check must be reviewed.Duties:Provide mental health services to clients (individual and group psychotherapy, psychosocial case management, individual and group rehabilitation services, diagnostic assessment, plan development, crisis intervention) and document services in AVATAR according to Conard House and Medi-Cal guidelines.Provide resources to clients on a broad range of problems in a manner that is supportive, constructive and non-judgmental.Admit and orient new clients to the program.Assess client's need for medical and psychiatric evaluations and make appropriate referrals.Develop and implement case management and money management plans and contracts.Coordinate Plans of Care with other services being provided to the client.Provide advocacy assistance pursuing entitlements, clothing, health care, mental health services and other issues. Maintain entitlements and ensure proper completion of client applications and forms.Conduct groups and activities oriented toward stabilized living. Facilitate interaction among clients and involvement in the social program.Meet monthly billing target.Maintain a supportive, independent living environment.Facilitate community building within the hotel and assist clients in utilizing hotel community resources.Intervene in crisis situations according to procedures.Assist clients with daily living skills.Develop and implement plan for client placement upon discharge from program.People from diverse cultural backgrounds encouraged to apply.Tipping Point Community is posting on behalf of Conard House as a part of our Chronic Homelessness Initiative",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/e7b0f5c070c24afb95c680b4575420fc-case-manager-iii-at-conard-house-tipping-point-community-san-francisco"
    },
    {
        "position": "Case Manager I (Supportive Housing Program) at Conard House",
        "company": "Tipping Point Community",
        "description": "Tipping Point Community is posting on behalf of Conard House as a part of our Chronic Homelessness InitiativeAbout Conard House: As a non-profit organization, Conard House, Inc. builds welcoming communities and caring relationships that empower people and restore hope. We work with a diverse adult population and strive for cultural competency by respecting experience, promoting inclusion and building community.  About the position:Position: Case Manager I - Full-timeSalary: $21.47 per hour ($44,657 annualized) plus excellent benefits. Additional $3.00 per hour premium pay for direct services May through June 2020Reports to: Associate Director-SHP- ArandaThe position is with the Supportive Housing Program, which provides various services to formerly homeless adults including income advocacy, money management, case management, and housing retention. Pursuant to the city and state’s Fair Chance Ordinance, we will consider qualified applicants with conviction records for employment. This position is included in the Collective Bargaining Agreement with SEIU 1021.Qualifications: Bachelor’s Degree or equivalent experience providing direct services in supportive housing preferred.  Demonstrated case management skills and knowledge of entitlement, redetermination, appeals processes and treatment and social service referral sources.  Must have good written communication skills. Experience with the C.A.A.P. program a plus. Working knowledge of Harm Reduction a plus.Effective advocacy, organizational, and communication skills (including de-escalation and conflict resolution) needed. Ability to work as a team member towards common goals and objectives.People who don’t meet specific qualifications are encouraged to call if genuinely interested in the position. After conditional offer, a criminal background check must be received.Duties:Provide services and information to tenants in a manner that is supportive, constructive and non-judgmental.Conduct intakes in collaboration with Property Management, and formulate case presentations.Admit and orient new tenants to the program.Assess tenant needs for medical and psychiatric evaluations and make appropriate referrals.Develop and implement service plans and contracts. Coordinate case conferences other services providers assisting tenant.Provide on-site money management for CAAP benefits. Interface with Department of Human Services.Facilitate community-building activities within the Hotel.Participate in the preparation of monthly community meetings and holiday celebrations; must be willing to prepare and distribute foods to our tenant populationProvide advocacy assistance pursuing entitlements, clothing, health care, mental health services and other issues. Maintain entitlements and ensure proper completion of client applications and forms.Respond in crisis situations to provide de-escalation and conflict resolution assistance utilizing appropriate methods according to agency procedures.   Develop and implement plan for client placement upon discharge from the program.Perform general office duties such as phones, filing, doing rosters, etc.People from diverse cultural backgrounds encouraged to apply.Tipping Point Community is posting on behalf of Conard House as a part of our Chronic Homelessness Initiative",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/25e79d5d5fb14068857161f730d4ce8e-case-manager-i-supportive-housing-program-at-conard-house-tipping-point-community-san-francisco"
    },
    {
        "position": "COVID-19 Emergency Housing Coordinator Administrative Assistant at Swords to Plowshares",
        "company": "Tipping Point Community",
        "description": "Tipping Point Community is posting on behalf of Swords to Plowshares as a part of our Chronic Homelessness InitiativeAbout Swords to Plowshares:Founded in 1974, Swords to Plowshares is a community-based not-for-profit organization that provides counseling and case management, rapid re-housing and eviction prevention services, employment and training, supportive housing, and legal benefits assistance for low-income, homeless and at-risk veterans in the San Francisco Bay Area. Swords to Plowshares promotes and protects the rights of veterans through advocacy, public education, and partnerships with local, state and national entities. Learn more about the work of Swords to Plowshares, and ways in which you can help, by visiting our website at: https://www.swords-to-plowshares.org/.Location:1060 Howard StreetSan Francisco, CA 94103Employment type:TemporaryPart-time, Non-ExemptSchedule:32 hours per week, at the discretion of the COVID-19 Emergency Housing Coordinator. Evenings and WeekendsPosition summary:The COVID-19 Emergency Housing Coordinator Administrative Assistant – Part-time (Evenings & Weekends) will provide critical support services to homeless veteran clients placed in temporary emergency hotels during the COVID19 pandemic. The COVID-19 Emergency Housing Coordinator Administrative Assistant – Part-time (Evenings & Weekends) primary focus will be to work in partnership with Swords to Plowshares, to coordinate and execute client’s needs.Responsibilities:Assists COVID19 Emergency Housing Coordinator with establishing workflows for Swords to Plowshares and VA to provide social supports and quality healthcarePerform data analysis and reports using Microsoft Excel for COVID19 Emergency Housing CoordinatorAssists in daily reconciliation of emergency housing properties foliosAssists in tracking of veterans placed into emergency housing and veterans eligible for permanent housingAssists in provisions provided through COVID19 Emergency housing placementAssess the nutritional needs of veterans to effectively provide the daily nutritional food intakeCompletes inventory and reports of food provisions to the COVID19 Emergency Housing CoordinatorEstablish relationships with food distributors, as well as local community restaurants to ensure that all veterans placed in emergency housing receive access to daily food intake and ongoing food replenishmentAssists in delivery efforts of food to hotels from restaurantsWork with COVID19 Emergency Housing Coordinator to purchase restaurant gift cards for veterans residing in Emergency Housing sitesCollaborate with STP staff to address Diversity & Inclusion effortsAssists Outreach SpecialistAssists scheduling meetings by various methods of communications is required by COVID19 Emergency Housing Coordinator.Assists with COVID19 Emergency Housing Coordinator job descriptions.Assists COVID19 Emergency Housing Coordinator and Outreach coordinator with additional responsibilities.Adhere to laws regarding confidentiality and reporting requirements; maintain a knowledge of current HIPAA certification requirements.Maintain timely and appropriate documentation and summaries.Maintain an ability to carry out the essential duties of the position within what can be considered reasonable accommodation.Perform other related duties as required by COVID19 Emergency Housing Coordinator.Requirements:EducationBachelor’s Degree           orHigh School Diploma with 4+ years working with homeless populations or 4+ years military experience in a related fieldExperienceMinimum one (1) year of experience working with veterans or “hard to serve” individuals, e.g., homeless, substance users and persons with mental illness, in areas of housing stabilization, placement and retentionQualificationsValid driver’s license with clean driving recordAbility to work both independently and as a member of a teamMust be able to communicate effectively with a variety of personalities and be comfortable working with an at-risk client population, including embracing the agency’s Diversity, Equity, and Inclusion initiativeSkillsAbility to swiftly build strong rapport and trust with veteran clientsCrisis intervention skills, including de-escalation and conflict resolution skillsGood written and oral communication skillsMotivational Interviewing trainingExperience with Microsoft Office Suite & 365, Social Media Platforms, various methods of Virtual Communications and various electronic medical records systemsBenefits:Compensation is based on a competitive public interest salary scale. Swords to Plowshares offers a generous benefits package including the following benefits:Excellent medical and dental packages403(b) retirement plan with employer contribution17 vacation days in the first year12 holidays every yearWellness programApply:(No calls please)Please submit a resume and thoughtful cover letter explaining your interest in Swords to Plowshares, where/how you found out about this career opportunity, and your salary requirement.Swords to Plowshares is an inclusive employer and we are proud of the rich diversity among our staff. Please join us!Tipping Point Community is posting on behalf of Swords to Plowshares as a part of our Chronic Homelessness Initiative",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/69f51bbc24af46c1b8042e62cba3df73-covid-19-emergency-housing-coordinator-administrative-assistant-at-swords-to-plowshares-tipping-point-community-san-francisco"
    },
    {
        "position": "Manager, Advancement",
        "company": "Project Open Hand",
        "description": "The Manager, Advancement works to secure funds for the organization by managing a group of assigned, qualified donors assuring that as many as possible are retained as continuing donors to Project Open Hand (POH) and are upgraded in their giving and involvement.  This is an ideal position for an eager and innovative development professional who cares deeply about Project Open Hand’s mission to nourish and engage our community through nutrition and a culture of compassion. QUALIFICATIONS REQUIRED: Bachelor’s degree in Business or equivalent experience.  3 years of proven experience managing a complex fundraising program. A successful track record of personally identifying, cultivating and soliciting donors. 1-2 years of experience in managing people and budgets. A knowledge and understanding of the funding community in San Francisco and the Bay Area. Ability to travel in the 9-county Bay Area region.  ESSENTIAL FUNCTIONS AND RESPONSIBILITIES: Coordinate necessary activities in a Planned and Major Giving program to secure funds. Manage mid to major gift donors and identify, qualify, cultivate, solicit and steward these very important friends of POH. Create individual fundraising plans for each donor or prospect in portfolio. Work collaboratively with and in support of volunteers, Board, and development and communications staff to cultivate and solicit donors for POH priorities. Create portfolios for and assign donors to staff, Board, volunteers. Manage strategy for donor cultivation and stewardship events such as tours, house parties, thank you events.  Manage all donor affinity groups including but not limited to: Young Professionals Council (YPC), The Supper Club, and the Alumni Board Council. Coordinate and participate in all aspects of the gift cycle: Initiate contacts with potential leadership, major, and mid gift donors. Develop appropriate cultivation strategies for them, including working with volunteers and staff. Move potential donors in an appropriate and timely fashion toward solicitation and closure using Moves Management methodology. Make solicitations when appropriate. Maintain stewardship contacts with donors; adhere to the highest ethical standards; demonstrate empathetic disposition, and perseverance; reflect optimistic and positive attitude, and convey sensitivity to needs of the donors. Ensure coordination of marketing, fundraising, and event efforts through collaboration with the Director, Development Operations and Manager, Communications. Monitor all prospect contacts to ensure positive and purposeful prospect and donor relations. Offer prospect strategy counsel to CEO, VP, Board and advancement staff who are managing other prospects. Create monthly reports as required that accurately reflect portfolio activity and performance for all assigned portfolios to staff and volunteers. Portfolios may include those assigned to: Board, CEO, VPs, and POH staff. Manage annual board give/get campaign. Collaborate with other not-for-profits and community organizations to promote the mission of the Agency as well as common goals for the benefit of the community as a whole. Serve as a visible spokesperson and advocate for POH’s mission and programs in partnership with other key staff. Other duties as assigned. ",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/196fade65d084e81817ac2334283ae7c-manager-advancement-project-open-hand-san-francisco"
    },
    {
        "position": "Director of Engagement",
        "company": "San Francisco Marin Medical Society",
        "description": "ABOUT THE SAN FRANCISCO MARIN MEDICAL SOCIETYThe San Francisco Marin Medical Society (SFMMS) is a professional association representing physicians, medical students, residents and fellows in all modes of practice and specialties in San Francisco and Marin Counties.The purpose of SFMMS is to improve the health of the San Francisco and Marin communities by uniting and supporting the local physician community. SFMMS has a long history of creating bold, progressive policy to protect the health of the public and look out for underserved and underrepresented communities.SFMMS’ goals are to advocate on behalf of the physician community, convene and connect physicians to nourish and sustain their practice, and provide professional resources that make it easier for physicians to practice quality medicine.ABOUT THE DIRECTOR OF ENGAGEMENTThe Director of Engagement is a critical component of the SFMMS team. They will work closely with the Executive Director and other senior staff to develop and deliver opportunities for physician members to convene and connect with one another to nourish and sustain their practice.IS THIS JOB RIGHT FOR YOU?The ideal candidate:Is mission oriented.Has an interest in issues related to health and health care.Has ideas about how to engage busy people and track that engagement over time.Has a track record of having developed and delivered compelling, engaging virtual and in-person events.Is comfortable with public speaking.Thrives in a dynamic, flexible environment.Prioritizes responsiveness to members and teammates.Has strong writing skills.Remote candidates will be considered. Occasional travel to the Bay Area may be required.SFMMS is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.RESPONSIBILITIES OF THE DIRECTOR OF ENGAGEMENTCreate, market, coordinate, and deliver opportunities for SFMMS members to engage with their society, including but not limited to:Policy briefings with local expertsMember socials and family-oriented eventsPractice trainingAdvocacy opportunities in San Francisco, Marin County, Sacramento, D.C. and beyondTime-limited working groupsSFMMS governanceDesign key performance indicators related to member engagement.Develop organizational strategy and recommendations related to marketing, communications, and member outreach. Develop a plan to onboard new members that conveys the organization’s mission and opportunities to engage.Coordinate and facilitate time-limited working groups and Committee meetings to create the conditions for member consensus around key issues.Produce compelling content for the SFMMS journal, newsletter, blog, social media, and more.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/2f0d5c804d654693871d097a6bc5d55a-director-of-engagement-san-francisco-marin-medical-society-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/f99515afca004197b7baf5a21a294c61-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/d997b9716707480eae1ce56864ed9597-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/cea2135f51764029bb563b8ea5d655cf-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/9efa7c8ed78446f3a283fd55ee07d2c8-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/7e7d8a0f79f844e9a451ce0600b4bdec-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/51f04a3734f741aa9cfe7b83cf5e88f7-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/22697f20c28a4ddfab72d5e4ec40e40d-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "BAYAC AmeriCorps Program Assistant at Mission Graduates",
        "company": "California Volunteers AmeriCorps Programs - Central Coastal Region",
        "description": "Program Name: Bay Area Youth Agency Consortium (BAYAC) AmeriCorps Program Description: We are currently looking for aspiring educators and afterschool enthusiasts to join our BAYAC team at our host site at Mission Graduates! Be a part of this team to inspire elementary students of San Francisco’s Mission District to develop a college readiness mindset and build a stronger community. Mission Graduates works with schools such as Everett Middle School, Thomas Edison Charter Academy, Alvarado Elementary, Marshall Elementary, Flynn Elementary, Cleveland Elementary, Sanchez Elementary and Bryant Elementary. Learn more about Mission Graduates at https://www.missiongraduates.org/. Mission Graduates’ mission is to increase the number of K-12 students in San Francisco’s Mission District who are prepared for and complete a college education. Founded in 1972, Mission Graduates provides a wide range of afterschool, in-school, and summer programs helping to establish college education as an expectation and goal for every child. Each year, Mission Graduates reaches over 3,100 low-income children, youth, and families from San Francisco’s Mission District, emphasizing college as a means to achieve economic equity and strengthen the fabric of the community. Apply now at www.bayac.org to join our Mission District AmeriCorps cohort! What is BAYAC AmeriCorps?BAYAC AmeriCorps collaborates with over 20 agencies in schools and community-based organizations to serve youth and families in the San Francisco Bay Area. As part of AmeriCorps, BAYAC Members commit to a full-time (40 hours/week) term of service in the Bay Area's most high-need communities, working to provide youth with opportunities for meaningful engagement, skill building, and emotional and social development. This is a paid work experience program for folks who are looking to advance their career working with youth and in the field of education. We are hiring folks to serve as after-school educators, classroom aides, academic coaches & mentors, tutors, health educators, case managers, and enrichment activities coordinators.Position duties may include:One-on-one tutoringMake college a reality for young students through college readiness programsSupport students/youth in developing the skills they need to be successful in school and lifeProvide homework and academic support for program participants at school sitesProvide case management, referrals, and independent living skills for clients at community based sitesPlan and facilitate youth focused lesson plans and activitiesPromote a safe and positive learning environmentActively supervise and ensure student/youth safety at all timesModel positive attitudes, behaviors, and languageCommunicate regularly with the site coordinator and regional supervisorMaintain accurate attendance records and reporting proceduresAttend and participate in weekly training and cohort meetingsGain experience and skills:Work full time in diverse and vibrant Bay Area communitiesWork within the education and nonprofit sectorsDevelop basic teaching skills, including curriculum development, behavior management practices and public speaking/facilitationMake lasting connections with fellow service minded community membersBuild confidence in public speakingAcquire concrete workplace skillsDevelop personal and professional goals with guidance and supportPromote meaningful community partnershipsBecome part of a large alumni networkQualifications:U.S. citizen, U.S. national, or a lawful permanent resident of the United StatesAt least 17 years oldHigh School Diploma or GEDAbility to work full-time (40 hours/week) and commit to a 11-month term of serviceSuccessful completion of TB test and Live Scan/fingerprinting (upon hire)Prefer to have 48 college credits completedPrefer bilingual in Spanish/English, not requiredTo Apply: Go to http://www.bayac.org/ and click \"Apply Now!\" to submit your application and be scheduled for an interview. Get your applications in today, as we are filling our positions on a first come first serve basis!Timeline: Service cohorts begin August 2020 and serve until July 2021 for 1700-hour members.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/2198f6da483c4b1885a9799fa749dc94-bayac-americorps-program-assistant-at-mission-graduates-california-volunteers-americorps-programs-central-coastal-region-san-francisco"
    },
    {
        "position": "Bilingual Housing Counselor and Investigations Coordinator",
        "company": "Fair Housing Advocates of Northern California",
        "description": "DUTIES AND RESPONSIBILITIES:Under supervision of the Supervising Attorney, provide direct fair housing counseling services to tenants and homeowners in protected classes, including providing information on coverage of fair housing laws, making reasonable accommodation requests, providing advocacy, intervention and/or mediation services, and acting as representative in administrative complaintsIn collaboration with other senior staff, coordinate fair housing investigations, implement testing programs to identify potential violations of federal, state and local civil rights laws, evaluate test methodology, provide feedback on structuring complaint and audit-based tests, analyze completed rental/lending/other tests, and prepare administrative complaints for filingWith other investigative staff, recruit, train, hire, and manage a diverse and highly trained tester pool, overseeing work quality, while maintaining accurate and updated records for tester applicants and trained testersMaintain accurate and complete records of complaint-based, systemic and/or audit investigationsConduct timely preliminary analysis of testing results prior to referral to attorneysPresent at fair housing training sessions for housing providers; present fair housing information to social service providers, advocacy organizations, and/or community membersAssist in education and outreach efforts, including attending community and advocacy organization meetings, municipal/local government hearings and/or meetings, public housing authority meetings, and other relevant outreach events as agency representative as appropriate; prepare formal written comments on any relevant documents or topicsREQUIRED QUALIFICATIONS:Commitment to fair housing and civil rightsExcellent oral communication skills, including public speaking and interpersonal skills in English and SpanishStrong analytical and organization skills and ability to manage multiple cases and investigationsAbility to meet project deadlines and maintain accurate recordsSelf-motivation and ability to work with limited supervisionAbility to work effectively with a diverse community and with patience, tact and respect when interacting with the public and other staff membersValid California driver's license and use of carDESIRED QUALIFICATIONS:Spanish writing skillsAbility to understand legal documents, federal and state fair housing statutes and regulationsExperience with Microsoft Word, Excel, Salesforce, PowerPoint, and other softwareKnowledge of federal and state fair housing lawsSupervisory skillsEDUCATION AND EXPERIENCE:Experience in social service or public entity and on behalf of civil rights protections desirable. Candidates must have a desire to work and interact with, as well as demonstrate respect for individuals and groups without regard to race, religion, sex, color, national origin, age, sexual orientation, familial status, or disability. Spanish speaking skills required; Spanish writing skills ideal.This position requires the use of a car and some infrequent non-traditional work hours for enforcement activities.Position open until filled.",
        "currentURL": "https://www.idealist.org/en/nonprofit-job/c7b36613c1a84171b5d5fbe928c0e691-bilingual-housing-counselor-and-investigations-coordinator-fair-housing-advocates-of-northern-california-san-rafael"
    }
]