[
    {
        "position": "Scripps Institution of Oceanography - UCSD - Summer Undergraduate Research Fellowship",
        "description": "SURF is a 10-week summer Research Experience for Undergraduates (REU) designed to engage students in diverse and exciting Earth, ocean and atmospheric sciences research at a world-renowned institution.In particular, the SURF program seeks to increase the diversity of students successfully prepared to pursue Earth and ocean sciences career pathways, and to recruit individuals from institutions with limited undergraduate research opportunities.SURF is supported with funding from the National Science Foundation, Division of Ocean Sciences.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/00b6418425db456f98759cb7531bec5e"
    },
    {
        "position": "Yale New Haven Health Gift Shop Volunteer",
        "description": "Volunteers serve in many of our “first point of service” positions. Making a positive impression and setting a positive tone for patients and families is a critical part of the patient experience. Some of these front line positions include: Gift Shop volunteers provide customer service assistance, which includes helping customers with purchases and keeping inventory up-to-date.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/044b418d1c2b4cae88672be0108a8fee"
    },
    {
        "position": "BW Health - CapSource Project Based Experiential Learning Opportunity",
        "description": "BW Health works tirelessly to create and proliferate sports medicine solutions that help people move, on the rehab and preventative sides of an injury. We are proud to make excellent products that provide the best in patient care.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/04cec366f32641aaa07831402eb93fe1"
    },
    {
        "position": "Dover Manufacturing",
        "description": "Today's students and recent graduates are the future of Dover, and we are excited to tap into their passion, talent and diversity as we build tomorrow's teamWhy Students and Recent Grads Are An Integral Part Of Our TeamEager for professional and personal growth Innovative mindsetPassion to make a difference in our communitiesOpen to challengesPositive and impactful attitude",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0610b1a9167146409a6be4221ed0ffc3"
    },
    {
        "position": "The Clorox Company - Undergrad Brand Camp",
        "description": "Encompassing brand management, marketing intelligence, and marketing communications, the mission of our Marketing team is to build brands consumers love. Together, we focus on creating and sustaining the lasting consumer and customer relationships that enable us to continually grow our brands. Assignments include establishing marketing best practices; developing and implementing marketing plans; leveraging consumer insights; creating, enforcing, and evaluating business-building projects; and identifying and driving new product development and innovation.Read more at https://www.thecloroxcompany.com/careers/college-recruiting/#3w1zUW30iPL93OZG.99",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/06749038263e40388932684dae23b3c0"
    },
    {
        "position": "Corporate Controller Organization Intern - American Airlines",
        "description": "As an intern for the Corporate Controller organization, you will be assisting in the number of areas within Corporate Accounting, Accounts Payable, Cargo Accounting, and Financial Reporting, including but not limited to the following: Test and document results for system modification or enhancements Assist in the development and documentation of processes and policies Assist in the development and implementation of initiatives around process improvement and data cleansing Assist in a quality assurance capacity for data and processes Assist with the review of accounting/financial statement schedules for accuracy and consistency Assist with the preparation or review of journal entries Assist with general ledger account reconciliations or supplier account reconciliations Perform other general office and administrative tasks as required",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/076LbINo8oKBR9kbPgDs"
    },
    {
        "position": "CSS Industries Design",
        "description": "CSS Industries is a consumer products company, engaged in the design, manufacture, and distribution of seasonal and all occasion social expression products.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/087e45146817428ab5a2fb1b6523b799"
    },
    {
        "position": "Finance - Unity for Equality",
        "description": "Unity For Equality is looking for dedicated individuals who will be part of a growing team. The description of the position is: Accounting, Financial Controls and Financial Reporting Directs preparation of fiscal records and financial plans, policies, and reports. Directs oversight of audits, works closely with the Board Audit Committee. Financial operations and consolidation of subsidiaries. Strategic, Financial and Operational Planning Participates in the development of the corporation's plans and programs. Develops and communicates financial vision and strategy. Directs preparation of annual operating and business fiscal plans (budgets). Develops financial forecasts and monitors financial health, monitoring guardrails around financial commitments. Works with the business to optimize business performance and planning. Provides strategic financial input and leadership on decision making issues affecting the organization (i.e., evaluation of potential alliances acquisitions and/or mergers and pension funds and investments). Evaluates capital expenditures, investment activities and portfolio management. Ensures timely and accurate business/financial reports and plans; presents them to the Partners across all business units to increase financial transparency in management reporting and business line performance. Treasury and Tax Manages treasury function, including meeting short and long-term funding needs. Determines appropriate capital structure. Initiates and oversees execution of all capital market transactions. Manages tax function Risk Management Understands how regulatory reform will impact the business and helps ensure the business is best positioned to respond. Manages aspects of risk through accounting, audit, planning and treasury functions External Financial Relations Manages investor relations function Serves as company’s representative to financial/investment community and shareholders. Manages banking and investment banking relationships Manages A/R, A/P relationships with third party vendors and customers Oversees and delivers recommendations to Board and Board committees regarding financials, audit matters, investments, and strategic initiatives and direction.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0EE4hhfOXr34k9rhcTYG"
    },
    {
        "position": "Volunteer: Disaster Action Team Member - Jackson Co.",
        "description": "We're in local communities every day, helping people prepare for, respond to and recover from emergencies. When emergencies strike, people need help. A fire leaves a family homeless. A heart attack threatens a life. A tornado flattens homes, schools and businesses. A military family needs to be connected. A young child needs a blood transfusion. They need the Red Cross.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0WLpRS6xPsQYEcHPriH7"
    },
    {
        "position": "ADM Milling Commercial Management",
        "description": "Your journey at ADM could begin with an internship, followed by new challenges, more responsibility, and endless opportunities for advancement.At ADM, interns are our largest pipeline of talent. During this internship you will apply classroom knowledge to real-world situations and challenges enabling you to develop personally and professionally. The 12-week internship program starts in May and ends in August.The program is coordinated through our North American headquarters in Decatur, Illinois, although some internships are in other locations across the country, with an emphasis on the U.S. Midwest.Milling Commercial Management Internship Commercial management interns learn the fundamentals of the business by embarking on an intense 12-week internship program at one of ADMsflour mills. The commercial management internship is focused on helping students learn the basics of managing commercial responsibilities. A typical day includes grain procurement and settlements, customer service, rail and truck transportation, accounts receivable, and scheduling of the mill and shipments. Commercial management interns will also participate in plant and food safety initiatives, the plant safety committee, and conduct safety observation reports. Full-Time Positions ADM is currently seeking individuals who will graduate with a bachelors degree in December or May for our commercial management trainee position. This position teachesthe basics of managing a wheat flour mill, including overseeing the office employees. A commercial managerstypical day isspent working to maximize profitsthrough management of grain procurement, productsales and customer service. Commercial managers are responsible for profit and lossreporting, overseeing acquisitions of grain for processing, developing the most economical blendsto meet customerspecifications, pricing and selling finished products, and providing direction in sales of co-products. Trainees will: assist with development and maintenance of relationships with the current customer base; actively participate in the plant and food safety initiatives; help manage site transportation; implement and assist in cost control and saving measures and communicate plant issuesto corporatemanagement. Qualifications Ideal candidatesfor these positions are highly motivated and team-oriented with excellent oral and written communication skills. Experience using a computer, especially with Microsoft Word and Excel is preferred. The ability to multi-task is essential. The position requires walking long distances, climbing stairs, sitting for long periods of time, communicating by phone and operating a keyboard. The candidate must be pursuing a bachelors degree in business or an agriculture-related field. Candidates must have a GPA of 2.7 or greater and be open to relocation throughout the U.S.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0c602878b19447bc96fb187e74500a71"
    },
    {
        "position": "National Institute of Standards and Technology - Calendar",
        "description": "OWM partners with the National Conference on Weights and Measures (NCWM), an organization of State and local weights and measures officials and representatives of business, industry, consumer groups, and Federal agencies, to develop U.S. standards in the form of uniform laws, regulations, and methods of practice. OWM serves as the U.S. representative to the International Organization of Legal Metrology (OIML) to bring efficiency and cost savings to U.S. manufacturers and other stakeholders doing business overseas, through the promotion of harmonized international standards and regulatory practices.OWM ensures traceability of state weights and measures standards to the SI; develops procedures for legal metrology tests and inspections, and conducts training for laboratory metrologists and weights and measures officials. OWM provides guidance on the model weights and measures laws and regulations adopted by the NCWM and coordinates the development and publication of key NCWM publications.It is estimated that sales of products or services impacted by weights and measures laws in the United States represent approximately 50 percent of the U.S. Gross Domestic Product. Industry sectors potentially affected by the decisions of the NCWM include retail food sales, other retail sales, petroleum products, transportation, and chemicals.The NIST Office of Weights and Measures analyzes weights and measures training needs, obtains input from the weights and measures community, designs and delivers training for laboratory metrologists and weights and measures officials, measures the impact and effectiveness of training to ensure ongoing continual improvement, and consults with the weights and measures community to ensure ongoing professional development.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0c2c116f121b1e38"
    },
    {
        "position": "FDA Office of Generic Drugs - CDER",
        "description": "A complete application consists of: An applicationTranscripts  Click here for detailed information about acceptable transcriptsA current resume/CV, including academic history, employment history, relevant experiences, and publication listTwo educational or professional referencesAll documents must be in English or include an official English translation.If you have questions, send an email to FDArpp@orau.org. Please include the reference code for this opportunity in your email.Academic LevelsGraduate StudentsPostdoctoralPost-Master'sUndergraduatesPost-Bachelor'sDescriptionA research opportunity is available at the Food and Drug Administration (FDA), Center for Drug Evaluation and Research (CDER). FDA's Office of Generic Drugs is committed to conducting regulatory science research related to generic drugs under the Generic Drugs User Fee Agreement of 2012 (GDUFA). This program is an opportunity in which participants will engage with a mentor or mentors in the Office of Generic Drugs during a targeted internship to examine a question of interest to the office. The interns will collaberate on research projects on topics relevant to OGD science needs. Interns will gain hands-on regulatory research experience under expert OGD mentors on a variety of projects to address these five priority areas: Post-market Evaluation of Generic Drugs, Equivalence of Complex Products, Equivalence of Locally Acting Products, Therapeutic Equivalence Evaluation and Standards and Computational and Analytical Tools.This program, administered by ORAU through its contract with the U.S. Department of Energy to manage the Oak Ridge Institute for Science and Education, was established through an interagency agreement between DOE and FDA. The initial appointment is for up to 12 months, but may be renewed upon recommendation of FDA contingent on the availability of funds. The participant will receive a monthly stipend commensurate with educational level and experience. Proof of health insurance is required for participation in this program. The appointment is full-time at FDA in the Silver Spring, MD area. Participants do not become employees of FDA or the program administrator, and there are no fringe benefits paid.QualificationsApplicants must be currently enrolled in a bachelors, masters, or doctoral program or have received one of these degrees within five years of the desired starting date.Eligibility RequirementsDegree: Currently pursuing a Bachelor's degree , Master's degree , or Doctoral degree or have received one of these degrees within 60 months.Discipline(s):Engineering (All)Life Health and Medical Sciences (All)Other Physical Sciences (All)Veteran Status: None",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0cd3210daf0242d4b2f6325c7736ac7f"
    },
    {
        "position": "Peabody Energy - Corporate Office",
        "description": "Paid internship opportunities are also available at Peabody’s St. Louis Corporate Office.  Specific opportunities are based on business needs.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0d62a6b81943461e89e8f305abedac48"
    },
    {
        "position": "Nashville Music City Marketing, Events Promotion Spring",
        "description": "THE NASHVILLE CONVENTION & VISITORS CORP SEEKS INTERNS FOR THE FOLLOWING:FALL SEMESTER (2020)Application deadline – September 1st, 2020Time Frame of Internship – Willing to work with studentInternship Areas Available – Marketing, Events, or ProductionMarketing includes the following areas of interest: Public Relations, Digital, Research, Visitor Services, Creative Services, Promotions/Advertising, Sponsorship, Convention Services, & Membership*Must be available to work Jack Daniel’s Music City Midnight: New Year’s Eve in Nashville (December 31st)SUMMER SEMESTER (2020)Application deadline – January 15th, 2020Time Frame of Internship – 2nd/3rd week of May – 2nd/3rd week of August (will work with student)Internship Areas Available – Marketing, Events, or ProductionMarketing includes the following areas of interest: Public Relations, Research, Digital, Visitor Services, Creative Services, Promotions/Advertising, Sponsorship, Convention Services, & Membership*Must be available to work Let Freedom Sing! Music City July 4th (July 4th)Internships at the NCVC are paid. In addition, interns receive paid access to our downtown parking garage 24/7.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0ea7c4c4f6f2463396f0e074c66dd248"
    },
    {
        "position": "Susquehanna Polling & Research Political Research - Spring",
        "description": "SP&R offers year-round full and part-time student internships.Students with an interest in government, history, business, communications, or politics (a major in political science is suggested, but not required) with strong communication, writing and organizational skills are encouraged to apply for a chance to get out of the classroom and gain real world experience by contributing to the research process at SP&R and by networking with local professionals. Both graduate and undergraduate students welcome to apply. Academic credit is offered but not required. Compensation is available for students who agree to conduct surveys. Read more about this internship opportunity.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0f6abeb712d842198556e050b8a34a4a"
    },
    {
        "position": "St. Louis Magazine Marketing",
        "description": "Marketing interns for St. Louis’ premier city magazine write stories for our website, conduct research for the magazine, and more. Because St. Louis Magazine is an independently owned publication, we give interns the opportunity to work on projects that correspond with their area(s) of editorial interest. An internship is a unique chance to add clips to your portfolio while working alongside professional reporters and editors. We expect interns to work between 10 and 20 hours per week. Dress is business casual.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0fc69449719740888326f22ac7412657"
    },
    {
        "position": "Intern, Marketing (Summer 2020) - Live Nation Entertainment",
        "description": "Who we are.\nWe're fans who help fans everywhere get in to the live events they love. A proud division of Live Nation Entertainment, Ticketmaster has changed the way the world connects with their favorite artists, teams, and shows, and we continue to shape innovation every day. We're not just selling tickets (though we do that better than anyone else), we’re enriching lives one amazing experience at a time. And we think that’s pretty amazing. If you're passionate about the magic of live entertainment like we are, and you want to work at a company dedicated to helping millions of fans experience it, we want to hear from you.\n\nWhy you should become an intern with us.\nAn internship at Ticketmaster is anything but ordinary. The pace is fast, the atmosphere is fun, and we'll push and challenge you to learn and grow beyond anything you’d expect. It’s truly is a unique and rewarding environment. While intern projects vary, you’ll support work that’s meaningful and has real-world impact from day one for an industry leading brand with global recognition. Our summer internships are typically a 12-week experience focused on both functional and professional growth, including executive lead weekly learning sessions, individual peer mentoring, an exclusive industry summit, intern Hackathon, and more special events.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0qBiWeI8QgHNTpIsK3Jk"
    },
    {
        "position": "Data Analyst",
        "description": "one of the top environmental and engineering consulting firms in the country, has an opening for a Data Analyst Intern. The Data Analyst Intern will join our Business Systems team and assist with collecting and analyzing data, and extending company's data with third party sources. If you have a knack for data, we encourage you to apply Now more than the ever, the world needs smart, cutting-edge solutions to address the engineering and environmental challenges of tomorrow. That's where we come in. As a member of our team, you will support our diverse range of clients, from Fortune 100 companies, to the federal government, to local communities nationwide to continuously improve human health and the environment.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/0kl8N4ygsHkvMJU8K1PP"
    },
    {
        "position": "MSUM/UND Spring Symposium on Communication Disorders",
        "description": "The University of North Dakota Department of Communication Sciences & Disorders conducts comprehensive programs of undergraduate and graduate (professional) training leading to bachelor’s, master’s and doctoral degrees. The program in speech-language pathology is accredited by the Council on Academic Accreditation in Audiology and Speech Language Pathology of the American Speech-Language-Hearing Association.____________*The external URL has not been updated yet. Check back later to view updated information about this opportunity. Or add it to your Favorites and be notified when it is updated!",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/1156"
    },
    {
        "position": "Special Events Coordinator - International Women's Air and Space Museum",
        "description": "The International Women's Air & Space Museum seeks a self motivated individual with strong communication skills, both written and verbal, must be organized, detail-oriented, able to manage multiple projects, outgoing and enthusiastic.",
        "currentURL": "https://app.studentopportunitycenter.com//app/search/11d1aea54fee464cb361c10677c7a185"
    }
]