[
    {
        "position": "Purple Maia Internship",
        "description": "We are looking for interns with an ability to work with middle school or high school aged students, with knowledge of coding and/or programming and a grounding in Hawaiian culture, and who are good role models for youth.Classes may be after-school or during school hours, several days a week, at schools and community centers around Oʻahu (primarily Honolulu and Waiʻanae), with chances to remotely assist online classes or classes on neighbor islands. Having your own transportation will be helpful. Those who show commitment, proactiveness, and skill may be able to grow into full teaching positions or take on special projects aligned with your skillset. This is a paid position.If youʻre interested, please fill out this application. Preferred requirements:Knowledge of computer programming, web development, mobile development, graphic design, Hawaiian language and culture, and/or STEM. Portfolio of work a plus.Any teaching experience, but prefer experience with middle school and high school studentsAbility to effectively communicate, both verbally and in writingAbility to interact effectively in a multicultural settingOpen to connecting computer science learning with Hawaiian or other cultural technological knowledge and values, deepening and diversifying knowledge of bothDuties: Take part in mandatory intern onboarding and/or start of year trainingLearn course material 2 weeks ahead of studentsAttend all classes you commit to and follow absence/late policyMonitor the learning as well as emotional progress of students, providing on-on-one help with course content and mentoring whenever possibleIf necessary, works to build competency in game, mobile app, web development languages, or other class content when necessary to be able to assist studentsAssist instructors with troubleshooting and classroom management if necessaryMay assist with classroom data collection and participate in staff reflections on project effectiveness and student progressMay occasionally take the lead in teaching, at the instructorʻs discretion",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/009132518ec847c595f9d939eae10f29"
    },
    {
        "position": "PacRim Marketing Group",
        "description": "As an intern with PacRim Marketing / PRTech, you will gain direct, hands-on work experience by managing job responsibilities in a real-world, global business environment. You will be exposed to all areas of the organization, which will enable you to understand: The company's structure and operationsGeneral policies and proceduresWorking with a diverse team and staffThe resources, processes, strategies and techniques utilized in achieving business objectivesParticipation in appropriate office meetings, conferences, and projectsResponsibilities/DutiesAssist a specific group or multiple groups in various projects and initiatives while learning the functions of various positions, work processes, and procedures. Manage tasks, and prepare and submit a weekly report detailing weekly accomplishments, areas for improvement (and suggestions), issues or problems and the next week's goals. Collaborate with managers to develop and fulfill a reciprocally valuable experience.Each intern reports to a specific person in the company and on occasion may take direction from other managers / team members.Each intern will be introduced and assigned responsibilities and/or projects. The intern will monitor progress and report to the immediate supervisor on a regular basis.The intern will familiarize him or herself with the process and procedures within the department.The intern will learn how specific tasks are performed related to the overall function of the firm.Upon completion of an internship with PacRim Marketing Group, Inc. / PRTech, LLC, interns will be able to: Demonstrate proficiency in understanding the company(s).Explain the company's product(s), services, and philosophy.Assess the outcome of the initial expectations.Demonstrate specific skills acquired and show improvement in the implementation of those skills.Present a completed project or demonstrate proficiency in completing on-going task assignments.Provide meaningful feedback on the internship.Provide feedback and evaluation session with employer at the end of the internship.RequirementsBilingual speaking, reading, and writing ability in Japanese, Korean, and or Mandarin is highly desired for all of the departments.Studies, or interest in, Travel Industry Management, Communications, Journalism, Marketing, Public Relations, Advertising, International Business, Computer Science, or related fields.High level of computer skills (Microsoft Office - Excel, PowerPoint, Work, Outlook, typing skills 45+ WPM; Programming for PRTech positions with a focus on .NET Microsoft technology).Majoring in, or having a degree in, Business Administration, Communication, Journalism, Travel Industry Management, Computer / Creative Media, MIS, and Computer Engineering, or related fields.Strong oral, written and interpersonal communications skills in English language.Passion for Hawaii and the Asia-Pacific markets and cultural nuances.Detail oriented with ability to multi-task well under high pressure.DepartmentsThe company's business units (departments and teams) each maintain a unique set of services and solutions, and client portfolios, as briefly described below.Integrated Marketing Services (IMS): Develops and manages integrated PR, marketing, events, and advertising programs for clients. Team members include project managers / client service specialists, Japanese / Korean / Chinese PR and marketing professionals, and production staff.My Hawaii Media: Publishes digital and print media specialized in Hawaii content, providing clients an opportunity to reach targeted Asian International Traveler markets through content marketing. Team members include Japanese / Korean / Chinese content marketing professionals (writers, editors), bloggers, SNS / online marketing specialists, and user interface and technical specialists (developers, programmers, networkers).PRTech: Develops and manages Asian websites and web applications for clients. From Japanese, Korean, Traditional Chinese, and Simplified Chinese websites to an Asian language reservation system, this team focuses on driving web traffic and reservations for clients. Team members include web designers, developers, programmers, and online marketing specialists.",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/0e2aac6300a247388e7ec8a0b439f2a9"
    },
    {
        "position": "Intern - Information Technology",
        "description": "Application LinkPunahou School provides students with a range of employment opportunities. Working at Punahou while attending school allows students to gain valuable skills and job experience that can enhance the academic learning process and give students the opportunity to serve and learn in a values-based, mission-oriented setting.Punahou School is actively recruiting an Intern in the Information Technology (IT) department. From K – 12, technology is an integral part of learning. At Punahou School, the IT department strives to create an environment where access to and support for digital information, tools, devices and rich learning opportunities are fully integrated throughout the K – grade 12 environment. The IT team designs, builds, maintains and enhances technology for students and staff enabling them to effectively utilize current and emerging technologies as tools for effective learning.Position Details:Department: Information TechnologyStatus: Casual Per DiemFLSA Status: Non-ExemptWork Year: 12 MonthsWork Hours: Monday - Friday, 7:30 AM - 4:00 PM, Hours may vary depending on operational needsMinimum Qualifications:Bachelor's Degree.Information technology, electrical engineering or management information science majors preferred.Experience with Mac OS, iOS, and Windows OS.Basic computer skills to help troubleshoot Mac and PC related issues.Comfortable working with students K-12 through adults.Ability to read and follow written instructions to address hardware and software issues.",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/IxkYUjwkn5CuO9F5tbd5"
    },
    {
        "position": "Internship with Stipend, Financial Award, Housing &amp; Transportation",
        "description": "Application LinkJob DescriptionPaid Training & Leadership Programs- FederalAre you seeking an entry level position, training-on-the-job, paid training or internships, apprenticeships, federal programs that offer housing and job training, or similar opportunities? Are you looking to replace traditional students jobs like dog walker, babysitter, sandwich artist or cashier on your resume with more valuable skills and employment opportunities?Disaster Response. Environmental Projects. Community Support. Rebuilding. Human & Social Services. Technology. Urban & Rural Planning. Public Relations. Management. Education.HELPFUL SKILLS:AdaptabilityAttentivenessConflict resolutionCreative ThinkingEffective communicationTime ManagementOrganizational SkillsTeamworkBENEFITS:No specific experience or degree required; training provided as neededGain experience while exploring career optionsGain a competitive edge over other job applicants in private or government sectorsGain leadership and management experienceGain college credits for continuing education and workforce development (earn 6-9 credit hours)Gain new contacts by networking with government and community agency directorsGain new skills in your career field and expand your capabilitiesGain advantages for college, trade school or apprenticeshipsTeam Leader option for those with advanced skills and educationProgram can be repeatedTravel, lodging, healthcare- plus childcare allowance if applicableEarn bi-weekly stipend plus $6,095 to pay off educational debt or pay for future educational and job training expensesIDEAL CANDIDATES:GED, HIGH SCHOOL DIPLOMA, CERTIFICATE PROGRAMS, TRADES TRAINING, SOME COLLEGE COURSES, ASSOCIATE DEGREE, BACHELOR DEGREECAREER INTEREST AREAS:Business- all focus areasEnvironmental- including forestry and fire science, sustainability, geographyHealth- public health, health education, healthcare interestPublic- social services, public services, program development, counseling, non-profit management, government, educationDevelopment- construction management, building trades, health & safety, eco-design, energy management, urban/rural planningCommunication- academic research, English, Spanish, Sign Language, history, writing, marketing, communicationsAdministrative Services- HR, office management, personnel supervision, personnel training, budget managementTechnology- GIS/GPS systems, computer science, networking, cybersecurity, database management911- emergency management, emergency services, disaster response, project management, homeland securityAPPLICATION INSTRUCTIONS:Start your application at https://vipnccc.com/applyCompany DescriptionPlease visit our virtual info session for program information and application assistance:Virtual Information Session (available 24/7)https://ncccfema.videoshowcase.net/",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/RVW0TcWlHtTrTRzNebox"
    },
    {
        "position": "Digital Marketing Intern",
        "description": "Application LinkDescriptionJob Description:Leidos is seeking an intern to support the marketing & communications team for its Hawai'i Energy program, based out of Honolulu, Hawai'i. The Hawai'i Energy program works to empower local residents and businesses to make smart energy choices through efficiency and conservation initiatives. Our marketing & communications team is a group of dynamic, experienced professionals who support the overall operation of the program through retail promotions, advertising, event coordination, video production, email and social media content, and managing our website, HawaiiEnergy.com. Our website is a critical piece of our operation, as it is where all of our customers go to find the information they need, whether that is a form to download, tips on how to save energy, or information on our rebates.We are seeking an intern with skills and interest in marketing through digital platforms, including some web development to support the growing needs of our site. Employment through summer (August 2020) is required, with a possible extension dependent on performance and budget.Primary ResponsibilitiesMonitor performance of Hawaii Energy website using Google Analytics (i.e. traffic, audience demographics, download rates, etc.)Track performance of digital marketing pieces such as e-newsletters, social media posts, and banner ads, including link clicks and content trendsResearch and apply basic Search Engine Optimization (SEO) practicesCritical website maintenance to help keep site attractive and user-friendlyResearch and potentially create special website tools & features to enhance customer experienceAssist with improving Hawaii Energy's Clean Energy Ally portal (website dashboard for contractors)Assist with producing content (articles, photos, videos) for Hawaii Energy website and social media pagesOther learning opportunities may include:Video and/or photography projects assisting team members on video shoots, capturing video and photos of Hawaii Energy eventsSpecial event assistance coordinating with team members with event logistics, audio-visual setup/execution, and other marketing-related tasksBasic QualificationsMust be currently-enrolled college student pursuing a degree in Business, Marketing, Computer Science, or related with at least two years completed towards your degreeStrong interest in digital marketing, website design or development and desire to learn and build skillsPrevious basic experience with website content management software (Joomla, Wordpress, or similar) and/or HTML codingPrevious basic experience with Google AnalyticsBasic understanding of website layout and digital content formatting, including resizing and embedding of images and videosPreferred QualificationsFamiliarity of Hawai'i Energy offerings and servicesPassion for clean energy and helping the communityPrior experience with Adobe DreamweaverLeidosInternshipExternal Referral Bonus:IneligiblePotential for Telework:NoClearance Level Required:NoneTravel:NoScheduled Weekly Hours:40Shift:DayRequisition Category:InternJob Family:Intern TechnicalLeidosLeidos is a Fortune 500® information technology, engineering, and science solutions and services leader working to solve the world's toughest challenges in the defense, intelligence, homeland security, civil, and health markets. The company's 33,000 employees support vital missions for government and commercial customers. Headquartered in Reston, Virginia, Leidos reported annual revenues of approximately $10.19 billion for the fiscal year ended December 28, 2018. For more information, visit www.Leidos.com.Pay and BenefitsPay and benefits are fundamental to any career decision. That's why we craft compensation packages that reflect the importance of the work we do for our customers. Employment benefits include competitive compensation, Health and Wellness programs, Income Protection, Paid Leave and Retirement. More details are available here.Securing Your DataLeidos will never ask you to provide payment-related information at any part of the employment application process. And Leidos will communicate with you only through emails that are sent from a Leidos.com email address. If you receive an email purporting to be from Leidos that asks for payment-related information or any other personal information, please report the email to spam.leidos@leidos.com.Commitment to DiversityAll qualified applicants will receive consideration for employment without regard to sex, race, ethnicity, age, national origin, citizenship, religion, physical or mental disability, medical condition, genetic information, pregnancy, family structure, marital status, ancestry, domestic partner status, sexual orientation, gender identity or expression, veteran or military status, or any other basis prohibited by law. Leidos will also consider for employment qualified applicants with criminal histories consistent with relevant laws.SDL2017",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/SLF7G6N5Rbu4Vt6rOUo9"
    },
    {
        "position": "DoD Web GIS Application, Services, and Data Coordinator Internship",
        "description": "Application LinkThe Defense POW/MIA Accounting Agency (DPAA) is responsible for finding and recovering missing US Service Members from our Nation's past conflicts. DPAA is a Department of Defense (DoD) joint military organization comprised of military service members, DoD civilians, and contractors, with offices in Hawaii, Washington DC, and Omaha, NE.DPAA is offering a learning opportunity to support their global search and recovery efforts. The research will be based on the locations and coordinates derived from the analysis of historic documents, current and historic imagery, leads developed through investigations, and previous search and recovery efforts.As a DPAA participant, you will learn all that is needed to maximize the technological capabilities of the systems through research and a hands-on experience.This opportunity will offer experiential learning and exploration in any number of technological areas including:Programing automated processes using scriptsCustomizing user interfaces with coding and/or configurationCyber security configurations.The nature of theGeographic Information System (GIS) industry requires the need to have a large research and educational component in order to be successful. This opportunity will require the individual to interact with users from many different backgrounds and disciplines, including both civilian and military, and from historians to anthropologists. The DPAA GIS brings all these disparate data sources together into a Common Operating Picture (COP) where analysts, historians, archaeologists and anthropologists can visualize and analyze the spatial data in easy-to-use applications. Under the guidance of a mentor, participant will take part in configuring and maintaining web applications, maps, and services in a federated ArcGIS Server environment using ArcMap/Pro, Portal, and WebApp Builder, while promoting the applications to users in the Agency to increase adoption and use.This opportunity will be based in the Hawaii office on Joint Base Pearl Harbor-Hickam (JBPHH).Appointment LengthThis appointment is a twelve month research appointment, with the possibility to be renewed for additional research periods. Appointments may be extended depending on funding availability, project assignment, program rules, and availability of the participant.Participant BenefitsParticipants will receive a stipend to be determined by DPAA. Stipends are typically based on the participants academic standing, discipline, experience, and research facility location. Other benefits may include the following:Health Insurance Supplement.Participants are eligible to purchase health insurance through ORISE.Relocation AllowanceTraining and Travel AllowanceNature of AppointmentThe participant will not enter into an employee/employer relationship with ORISE, ORAU, DOD, or any other office or agency. Instead, the participant will be affiliated with ORISE for the administration of the appointment through the ORISE appointment letter and Terms of Appointment.The individual should have a minimum of a bachelor's degree in Geography with focus on GIS, Computer Science, Management Informations Systems, or related discipline.This opportunity requires knowledge of esri's ArcGIS Server and Potal (or ArcGIS Online) with preferred experience publishing map, image, and feature services, configuring web maps, and using WebApp Builder to configure web apps. The individual should also have experience using ArcMap/Pro to publish web services.Some experience assisting and providing feedback users in the basic use of GIS applications is preferred.Experience building applications in runtime is preferred.Experience working in a military environment is preferred.  Create a Job Alert for Similar JobsAbout ORISE The Oak Ridge Institute for Science and Education (ORISE) is a U.S. Department of Energy institute focusing on scientific initiatives to research health risks from occupational hazards, assess environmental cleanup, respond to radiation medical emergencies, and educate the next generation of scientists.ORISE administers a broad range of internships, scholarships, fellowships and research experiences. These programs are available to science and engineering students and educators at every academic level from K-12, to college students and postdocs, to university faculty members.ORISE programs include research experiences at Department of Energy national laboratories as well as other federal agencies with research facilities located across the country as well some positions outside the United States.  Connections working at ORISE More Jobs from This Employer BACK TO TOP",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/3VIcTGsN4SUHRSblCJ8s"
    },
    {
        "position": "Information Technology Specialist",
        "description": "Application LinkFor almost 40 years, Navian Hawaii, a local non-profit hospice, has been a vital part of our community, caring for our neighbors, friends and families with Aloha.Position Summary:The Electronic Medical Record (EMR)/IT Specialist is responsible for hardware and software system analysis, trouble shooting and resolution. Responsible for opening, monitoring and tracking incident requests relating to both EMR and IT related issues. And offers direct support to the IT Manager. The EMR/IT Specialist is also available to assist all end-users on a day-to-day basis.Primary Responsibilities:Information TechnologyProvides direct support to the end-user organization wide as it relates to standard technical issues with applications and/or hardware or software failuresSoftwareAssists in support of all-software applications organization-wideSupports IT Manager in coordination with software vendors, licensing, upgrades, maintenance, application improvement and training programsAssist in developing training curriculum for the end-user regarding upgrades and system functionalityDevelop “how-to” documents and have them readily available to all end-usersHardwareTrouble-shoots and anticipates future hardware issuesAnalyze information and make appropriate recommendations on equipment upgradesAssists in working with vendors to ensure best cost, reliability and safety factorsNetworking & Computer SystemsLearn and maintain a comprehensive understanding of the network and software program capabilities, functionality and workflowsAssists in coordination with third party vendor contracted to manage network to ensure efficiency and reliabilityInterface with network engineers to support the maintenance of all local area networkMonitor performance and recommend upgrades and/or processes as neededElectronic Medical RecordsAssist IT Manager & Data Analytics Manager to ensure maximum support is provided to the end-userCollect relevant information from the EMR company to ensure standard practices are documented and available to the end-userCreate teaching sheets and step-by-step processes to be used for training's and available to the end-userWork with IT Manager to ensure all upgrades are rolled out within a timely basisSupport Data Analytics Manager with all educational trainingContinuously maintain a comprehensive and clear understanding of all EMR capabilities and functionalityParticipate in testing EMR functionality, applications and validate workflowsKnowledge and Skills Requirements:Excellent interpersonal communication skills required (written, verbal and listening)Strong organizational skills including the ability to set priorities and manage complex workloadWillingness to learn and remain competent in EMR systems and have strong understanding of the workflows being supportedFamiliar with curriculum planning and common tolls for presentationsProven training, critical thinking and problem-solving skills, decisive judgement and the ability to work independently and collaboratively across department boundariesApproachable, outgoing and enthusiastic as well as open and adaptable to changeKnowledgeable or has the ability to learn healthcare concepts and terminologyAbility to develop and implement long and short term organizational goalsDemonstrates good judgement in seeking and accepting guidance, facilitates clear and honest communicationDemonstrates ethical conduct and judgement that is in harmony with the mission and values of Navian HawaiiExperience and Educational Requirements:Bachelor's degree in computer science, information technology, or other related fieldExperience supporting the software strongly preferred.Experience with education and excellent presentation skillsPC proficiency to include Microsoft Word, Excel, Outlook and Access; and Design programsDemonstrated ability to communicate and work with a wide variety of end-users, at varying technological skill levels, requiredHours:Approximately 40 hours per week, during normal work hours: Mondays through Fridays, 8:00 am through 4:30 pm.May require evenings/weekend assistance depending upon project roll out or system problems.Job Type: Full-timeBenefits:Health insuranceDental insuranceVision insurancePaid time off",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/d5tLA95yHgwpzynDQ9Ka"
    },
    {
        "position": "Summer research internship: computational plant biology in Manoa, HI or remote",
        "description": "What: Summer research experience for undergraduates in Computational Biology with a focus on R programming and leaf ecophysiology.Where: Mānoa, HI or remote if you unable to be in Mānoa.When: June 15-August 10, 2020 (approximate)How: A student researcher will work with me and collaborators at the University of California, Davis to develop new software tools using the R programming language (https://cran.r-project.org) to model CO2 and H2O exchange in leaves. There will also be professional development opportunities to meet potential graduate school advisors and employers in academia and industry.Why: To learn about how leaves function so we can improve agriculture and train our workforce in advanced computational biology.The stipend is $3751.86 ($11.65/hour). The student is expected to work for 40 hours per week for 8 weeks, but “work” includes all training and professional development. I will supply a laptop computer for the duration of the internship.To apply: Email me (Dr. Chris Muir, cdmuir@hawaii.edu) a resumé, an (un)official transcript, and (optional) coding sample (URL or file). Please send me inquiries if you’d like to learn more about the position. To increase diversity in science, I strongly encourage native Hawaiians, women, and other underrepresented groups to apply.",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/NhdkFmF3LI5gv6wo3Vq7"
    }
]