[
    {
        "position": "Houston Intern",
        "description": "Application LinkAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work - all of your talents, passions, and priorities... all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You've come to the right place!JOB REQUISITIONHouston Intern - 2021LOCATIONHOUSTONADDITIONAL LOCATIONJOB DESCRIPTIONInterns work with Protiviti's clients, who are some of the world's leading companies. As an Intern, you collaborate with the team to deliver client solutions for complex business problems that these organizations face. Experience tells us that no one competency is enough to solve today's complex business problems. That's why we focus on developing Interns with an understanding of our business, knowledge across solutions and industries, technical aptitude, and leadership qualities that will ensure their future success.Our culture is grounded in empowerment, teamwork, and problem-solving, and, at all career levels, we encourage innovation, seeking your ideas and insights. Our people care about one another; they coach and guide; and they help each member of our team be their very best.When you join our team, you will participate in a first-class onboarding program. You will also attend The Intern Challenge, an experiential learning course that will help you transition successfully into your role as an Intern.Protiviti's Intern Program is an innovative experience designed to immerse you in our unique business and culture. Through our Intern Program, you will work across a variety of solutions and industries and engage in internal initiatives, all of which will fuel your curiosity, uncover hidden strengths, and prepare you for your career.With each project, you receive hands-on training in a nurturing environment and interact with leaders across our practice. Our Talent Managers will have lined up specific experiences that support career growth, your skills, and the needs of the business. A network of coaches will help you navigate challenges and celebrate milestones. There are opportunities to join committees, participate in employee network groups, enjoy social, civic, and networking activities, and build meaningful relationships across the firm and in the community.Meaningful onboarding. Impactful training. Foundational learning. These experiences define Protiviti's award-winning Intern Program - a program that builds upon your skills and knowledge and enables you to thrive professionally.QUALIFICATIONS+ Degree: Bachelor's, Master's degree in a relevant discipline (e.g., Accounting, Computer Engineering, Computer Science, Data Sciences, Finance, Information Systems, and MIS)+ Cumulative Minimum GPA: 3.0 overall, 3.0 major+ Visa Status: All applicants applying for U.S. job openings need authorization to work in the United States+ Graduation Status: Must be within one year of graduation at time of internshipWHAT MAKES YOU SUCCESSFUL+ Working in teams, as well as independently+ Being creative and analytical+ Possessing excellent leadership, communication and interpersonal skills+ Desiring to learn and a receptiveness to feedback and mentoring+ Displaying an interest in finance, accounting, technology, and business operationsARE YOU ON BOARD WITH TRAVEL?Since we work with clients, typically at their sites, this position requires travel to client sites. Out-of-town travel may also be required. Interns need reliable transportation to and from local client sites.Note: Students may apply for only one location. Duplicate applications will not be accepted.Protiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services.For all US & Canada Postings: You may submit your application materials online or call 1.888.556.7420 for additional ways to apply. Protiviti is an Equal Opportunity Employer. M/F/Disability/VeteranJOB LOCATIONTX PRO HOUSTONProtiviti is a global consulting firm that delivers deep expertise, objective insights, a tailored approach and unparalleled collaboration to help leaders confidently face the future. Protiviti and our independently owned Member Firms provide consulting solutions in finance, technology, operations, data, analytics, governance, risk and internal audit to our clients through our network of more than 70 offices in over 20 countries. For the third consecutive year, Protiviti was named to the Fortune 100 Best Companies to Work® for list.We have served more than 60 percent of Fortune 1000® and 35 percent of Fortune Global 500® companies. We also work with smaller, growing companies, including those looking to go public, as well as with government agencies. Protiviti is a wholly owned subsidiary of Robert Half (NYSE: RHI). Founded in 1948, Robert Half is a member of the S&P 500 index.",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/RhMkLFA9k9xaejjn5P7U"
    },
    {
        "position": "Human Resources Intern",
        "description": "Application LinkHuman Resources Intern Apply now » Date: Apr 2, 2020Location: Ft. Smith, AR, US#job-location.job-location-inline { display: inline; }Company:  GerdauAbout UsGerdau is the leading company in the production of long steel in the Americas and one of the major suppliers of specialty long steel in the world. With more than 45,000 employees, Gerdau has an installed capacity of more than 25 million metric tons of steel and it is the largest recycler in Latin America, and around the world, it transforms millions of metric tons of scrap into steel every year.Gerdau Long Steel North America is a leader in mini-mill steel production and steel recycling in North America, with an annual manufacturing capacity of approximately 10 million metric tons of mill finished steel products. Through a vertically integrated network of mini-mills, scrap recycling facilities and downstream operations, the company serves customers throughout the U.S. and Canada, offering a diverse and balanced product mix of merchant steel, rebar, structural shapes, fabricated steel, flat rolled steel and wire rod.Gerdau Special Steel North America is an engineered bar producer headquartered in Jackson, Michigan with world-class steel manufacturing mills in Jackson, Michigan, Monroe Michigan, and Fort Smith, Arkansas, and metal processing facilities in Huntington, Indiana, Pleasant Prairie, Wisconsin, Lansing, Michigan, Canton, Ohio, and North Vernon, Indiana.With engineered steel bar producing capabilities in North America, Europe, Brazil, and soon to be India, the Gerdau Special Steel group is the largest supplier of SBQ engineered steel bars to the global automotive and heavy truck industries.Position Summary:HR Data Analyst Intern is responsible for reporting, analysis, and communication of various HR data points. As well as getting data and other material uploaded into the HR Information System. All this is to assist our leadership to make effective, data-driven, and strategic operating decisions.Job Responsibilities:Scanning and Uploading of Personnel files and other documents into new HR System.Identify trends in various parts of the business based on detailed review and compilation of data.Collect and organize pieces of information into meaningful and actionable insights using visual design and infographics that enhances effective decision making.Prepare presentation materials to aid in the communication of HR projects, analysis, etc.Ensure accuracy and data integrity of HR system.The Individual\tHave completed at least two years of a college degree from a recognized accredited college or university in Computer ScienceRecord of high academic achievement (Minimum GPA 2.5; preferred GPA 3.0 or higher)Well-rounded applicants with leadership roles in student organizations or extra-curricular activitiesCandidates much demonstrate leadership potential, strong interpersonal skills, excellent written and oral communication skills, initiative, and problem-solving skillsMust be legally authorized to work in the United States without requiring current or future sponsorship for employmentApplication ProcessGerdau believes in equal employment opportunity related to all employees and applicants for employment. It is the policy of Gerdau that there will be no discrimination against any employee or applicant for employment on the basis of race, religion, color, national origin, citizenship, marital status, sex, age, sexual orientation, genetic information, gender identity, veteran status, disability, or other legally protected status. All applicants must be legally eligible to immediately work in the country of hire without current or future sponsorship.Gerdau believes in equal employment opportunity related to all employees and applicants for employment. It is the policy of Gerdau that there will be no discrimination against any employee or applicant for employment on the basis of race, religion, color, national origin, citizenship, marital status, sex, age, sexual orientation, genetic information, gender identity, veteran status, disability, or other legally protected status. All applicants must be legally eligible to immediately work in the country of hire without current or future sponsorship.If you are vision-impaired or have some other disability under the Americans with Disabilities Act or a similar law, and you wish to discuss potential accommodations related to applying for employment at Gerdau, please contact our Talent Acquisition Team at (866) 788-2798 or recruiting@gerdau.com.",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/XK9wkhDW1DnqePyDv0Is"
    },
    {
        "position": "Metro Intern",
        "description": "Application LinkMetro DC InternProtivitiPosted Under: Washington, DC jobs in Other; Other jobs in zipcode 20599Posted On: 2020-05-26At Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work - all of your talents, passions, and priorities--- all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You've come to the right place!JOB REQUISITIONMetro DC Intern - 2021LOCATIONWASHINGTON DC - MCLEANADDITIONAL LOCATIONJOB DESCRIPTIONAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work - all of your talents, passions, and priorities--- all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You've come to the right place!POSITION HIGHLIGHTSInterns work with Protiviti's clients, who are some of the world's leading companies. As an Intern, you collaborate with the team to deliver client solutions for complex business problems that these organizations face. Experience tells us that no one competency is enough to solve today's complex business problems. That's why we focus on developing Interns with an understanding of our business, knowledge across solutions and industries, technical aptitude, and leadership qualities that will ensure their future success.Our culture is grounded in empowerment, teamwork, and problem-solving, and, at all career levels, we encourage innovation, seeking your ideas and insights. Our people care about one another; they coach and guide; and they help each member of our team be their very best.When you join our team, you will participate in a first-class onboarding program. You will also attend The Intern Challenge, an experiential learning course that will help you transition successfully into your role as an Intern.Protiviti's Intern Program is an innovative experience designed to immerse you in our unique business and culture. Through our Intern Program, you will work across a variety of solutions and industries and engage in internal initiatives, all of which will fuel your curiosity, uncover hidden strengths, and prepare you for your career.With each project, you receive hands-on training in a nurturing environment and interact with leaders across our practice. Our Talent Managers will have lined up specific experiences that support career growth, your skills, and the needs of the business. A network of coaches will help you navigate challenges and celebrate milestones. There are opportunities to join committees, participate in employee network groups, enjoy social, civic, and networking activities, and build meaningful relationships across the firm and in the community.Meaningful onboarding. Impactful training. Foundational learning. These experiences define Protiviti's award-winning Intern Program - a program that builds upon your skills and knowledge and enables you to thrive professionally.QUALIFICATIONS* Degree: Bachelor's, Master's or MBA degree in a relevant discipline (e.g., Accounting, Computer Engineering, Computer Science, Data Sciences, Economics, Finance, Information Systems, Management and MIS)* Cumulative Minimum GPA: 3.0 overall, 3.0 major* Visa Status: All applicants applying for U.S. job openings need authorization to work in the United States* Graduation Status: Must be within one year of graduation at time of internshipWHAT MAKES YOU SUCCESSFUL* Working in teams, as well as independently* Being creative and analytical* Possessing excellent leadership, communication and interpersonal skills* Desiring to learn and a receptiveness to feedback and mentoring* Displaying an interest in finance, accounting, technology, and business operationsARE YOU ON BOARD WITH TRAVEL?Since we work with clients, typically at their sites, this position requires travel to client sites. Out-of-town travel may also be required. Interns need reliable transportation to and from local client sites.COMPANY OVERVIEWProtiviti is a global consulting firm that delivers deep expertise, objective insights, a tailored approach and unparalleled collaboration to help leaders confidently face the future. Our consulting solutions span critical business problems in technology, business process, analytics, risk, compliance, transactions and internal audit. We are committed to attracting and developing a diverse workforce of professionals who share the common value of collaboration. As an organization, we believe that by teaming together and with our clients, we can see beyond the surface of problems that organizations face and discover opportunities to help them face the future with confidence.Our more than 4,500 people serve clients through the network of Protiviti and independently owned Member Firms in more than 70 offices in over 20 countries. We have served over 60% of FORTUNE 1000-- companies and 35% of FORTUNE Global 500-- companies. Our people and organization have consistently been recognized by FORTUNE and Consulting Magazine as a best company to work for.APPLICATION PROCESSApply at www.protiviti.com/careers.Note: Students may apply for only one location. Duplicate applications will not be accepted.Protiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services.For all US & Canada Postings: You may submit your application materials online or call 1.888.556.7420 for additional ways to apply. Protiviti is an Equal Opportunity Employer. M/F/Disability/VeteranJOB LOCATIONVA TYSONS CORNER",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/wKTu1GtiJ5OGXZiT5CCh"
    },
    {
        "position": "High School Quality Assurance Intern for Weapons Effects Software",
        "description": "Application LinkApplied Research Associates has an immediate opening for a motivated rising high school senior to learn about professional software development practices while also contributing to the success of a program critical to our national defense. This position offers an opportunity to participate in quality assurance and testing efforts on cutting-edge physics-based simulation software.Join our team of software developers and engineers developing diverse tools for modeling and simulation of weapons effects. Our interns are valued members of the team tasked with work that is critical to the success of our projects. ARA is looking for a motivated rising high school senior to learn about professional software development practices while also contributing to the success of a program critical to our national defense. This position offers an opportunity to participate in quality assurance and testing efforts on cutting-edge physics-based simulation software. In this position you will be part of the development team, working with developers and engineers to deliver reliable software that produces high-fidelity simulation results with interactive 3-D visualization. Tasks include participating in Agile development meetings, testing software and understanding how it should be used, discovering and documenting defects, working with the development team to reproduce and resolve issues, and much more.Applied Research Associates, Inc. is seeking Quality Assurance Interns to support the JWS project on-site in Raleigh, NC. Our staff of recognized experts uses state-of-the-art software to integrate accredited engineering models that provide complete, comprehensive answers for many diverse weaponeering and vulnerability assessment problems. We have expertise and provide engineering solutions in areas such as weapon penetration, cratering, blast effects, fragmentation, structural damage, human injury, etc.Additionally, our professional software development team has designed and produced software systems ranging from integrated multi-disciplinary design and optimization systems to 3-D interactive design/analysis systems, weapons effects and operational mission planning systems, electronic technical manuals, cyber security applications, multimedia database management systems, and technical hypertext systems. We develop software using the latest hardware and software technologies including C++, C#, Java, and Python.High School Quality Assurance Intern for Weapons Effects Software Requirements:Rising High School SeniorKnowledge of Microsoft Office products such as Word, Excel, and PowerPointAdvanced math classes such as CalculusProblem-solving skillsGood communication skillsDesire to learnHigh School Quality Assurance Intern for Weapons Effects Software Preferences:Microsoft certified in ExcelHigh school engineering classesIf this is the perfect job for you please apply online at careers.ara.comAbout Us:Applied Research Associates, Inc. (aka ARA) is an employee-owned international research and engineering company known for providing technically superior solutions to complex and challenging problems in the physical sciences. We were founded in Albuquerque, NM in 1979 as the disco era was, thankfully, closing out and the personal computer era was beginning. We employ over 1,400 professionals and continue to grow. ARA offices throughout the U.S. and Canada provide a broad range of technical expertise in defense, civil, and health technologies, computer software and simulation, systems analysis, environmental technologies, and testing and measurement. Around ARA you are equally likely to hear a conversation about Kubernetes clusters as you are a debate on merits of a reverse polish notation (RPN) calculator!While this is all of the Year One and Beyond stuff, Day One is highly impressive too. These are things like our competitive salary (DOE), Employee Stock Ownership Plan (ESOP), benefits package, relocation opportunities, and a challenging culture where innovation & experimentation are the norm. At ARA, employees are our greatest assets so we give our employees the tools, training, and opportunities to take active roles as owners. The motto, “Engineering and Science for Fun and Profit” sums up the ARA experience. The company realizes employee ownership spawns greater creativity and initiative along with higher performance and customer satisfaction levels.ARA is passionate about inclusion and diversity in our workplace. In 2018 40% of our new employees voluntarily self-identified as protected veterans. (Source-AAP EOY 2018 Veterans Data Collection Report). Additionally, the Southeast Division looks not only for the right skills, but also for a cultural fit. We seek colleagues who will contribute to the unique culture that makes ARA such a great place to work. Some of the social impact aspects we have implemented at our division include monthly get-togethers, team outings to local baseball games in the summer, board game lunches, holiday party, corn hole tournaments, chili cook-offs and so on. We are also very proud of our Women’s Initiative Network (WIN) whose purpose is to motivate, support, and encourage professional career development for women to maximize career and professional accomplishments. For additional information and an opportunity to join this unique workplace, please apply at careers.ara.com.ExperienceRequiredRelevant Work ExperienceEqual Opportunity Employer/Protected Veterans/Individuals with DisabilitiesThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/vySFoLa95xPdtrnhD1lU"
    },
    {
        "position": "Chicago Intern",
        "description": "Application LinkAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work – all of your talents, passions, and priorities… all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You've come to the right place!JOB REQUISITIONChicago Intern- 2021LOCATIONCHICAGOADDITIONAL LOCATIONJOB DESCRIPTIONAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work – all of your talents, passions, and priorities… all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You’ve come to the right place!POSITION HIGHLIGHTSInterns work with Protiviti’s clients, who are some of the world’s leading companies. As an Intern, you collaborate with the team to deliver client solutions for complex business problems that these organizations face. Experience tells us that no one competency is enough to solve today’s complex business problems. That’s why we focus on developing Interns with an understanding of our business, knowledge across solutions and industries, technical aptitude, and leadership qualities that will ensure their future success.Our culture is grounded in empowerment, teamwork, and problem-solving, and, at all career levels, we encourage innovation, seeking your ideas and insights. Our people care about one another; they coach and guide; and they help each member of our team be their very best.When you join our team, you will participate in a first-class onboarding program. You will also attend The Intern Challenge, an experiential learning course that will help you transition successfully into your role as an Intern.Protiviti’s Intern Program is an innovative experience designed to immerse you in our unique business and culture. Through our Intern Program, you will work across a variety of solutions and industries and engage in internal initiatives, all of which will fuel your curiosity, uncover hidden strengths, and prepare you for your career.With each project, you receive hands-on training in a nurturing environment and interact with leaders across our practice. Our Talent Managers will have lined up specific experiences that support career growth, your skills, and the needs of the business. A network of coaches will help you navigate challenges and celebrate milestones. There are opportunities to join committees, participate in employee network groups, enjoy social, civic, and networking activities, and build meaningful relationships across the firm and in the community.Meaningful onboarding. Impactful training. Foundational learning. These experiences define Protiviti’s award-winning Intern Program – a program that builds upon your skills and knowledge and enables you to thrive professionally.QUALIFICATIONSDegree: Bachelor’s, Master’s or MBA degree in a relevant discipline (e.g., Accounting, Computer Engineering, Computer Science, Data Sciences, Economics, Finance, Information Systems, Management, and MIS) Cumulative Minimum GPA: 3.0 overall, 3.0 majorVisa Status: All applicants applying for U.S. job openings need authorization to work in the United StatesGraduation Status: Must be within one year of graduation at time of internshipWHAT MAKES YOU SUCCESSFULWorking in teams, as well as independentlyBeing creative and analyticalPossessing excellent leadership, communication and interpersonal skillsDesiring to learn and a receptiveness to feedback and mentoringDisplaying an interest in finance, accounting, technology, and business operationsARE YOU ON BOARD WITH TRAVEL?Since we work with clients, typically at their sites, this position requires travel to client sites. Out-of-town travel may also be required. Interns need reliable transportation to and from local client sites.COMPANY OVERVIEWProtiviti is a global consulting firm that delivers deep expertise, objective insights, a tailored approach and unparalleled collaboration to help leaders confidently face the future. Our consulting solutions span critical business problems in technology, business process, analytics, risk, compliance, transactions and internal audit. We are committed to attracting and developing a diverse workforce of professionals who share the common value of collaboration. As an organization, we believe that by teaming together and with our clients, we can see beyond the surface of problems that organizations face and discover opportunities to help them face the future with confidence.Our more than 4,500 people serve clients through the network of Protiviti and independently owned Member Firms in more than 70 offices in over 20 countries. We have served over 60% of FORTUNE 1000® companies and 35% of FORTUNE Global 500® companies. Our people and organization have consistently been recognized by FORTUNE and Consulting Magazine as a best company to work for.APPLICATION PROCESSApply at www.protiviti.com/careers.Note: Students may apply for only one location. Duplicate applications will not be accepted.Protiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services.For all US & Canada Postings: You may submit your application materials online or call 1.888.556.7420 for additional ways to apply. Protiviti is an Equal Opportunity Employer. M/F/Disability/VeteranJOB LOCATIONIL PRO CHICAGO",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/w6sfdvgOBU9vXOIUkW8o"
    },
    {
        "position": "Intern - Surface Water Management Intern",
        "description": "Application LinkIntern - Surface Water Management Intern (Seasonal)Job DetailsIntern - Surface Water Management Intern (Seasonal)This listing closes on 3/15/2020 at 11:59 PM Pacific Time (US & Canada); Tijuana.Salary$17.00 - $18.00 HourlyLocation Main County Campus-3000 Rockefeller Ave, Everett, WAEverett, WAJob TypeInternshipDepartmentPublic WorksJob Number2020-SWM INTERN-FEBDivisionSurface Water ManagementClosing date and time3/15/2020 at 11:59 PM Pacific Time (US & Canada); TijuanaDescription    Spend your summer gaining valuable career experience with Snohomish County Public Works as a Surface Water Management Intern working on Stream Ecology.The interns (2 positions) will work alongside a team of scientists to collect water quality, physical habitat and benthic invertebrate data in rivers, lakes and streams, sample for juvenile salmonids in the Snohomish estuary and help manage environmental data. This internship will involve working in the field 4 days per week, 10 hours per day while perform strenuous labor such as brush cutting, crawling through vegetation and hauling nets.Surface Water Management (SWM) works in partnership with the community to reduce road and property flooding and to protect and restore Snohomish County's rivers, lakes and streams. You can find us responding to water-quality problems and complaints, monitoring river, stream and lake health, maintaining drainage systems, managing habitat improvement projects and more. We focus on four areas of service:* Clean water in rivers, streams and lakes;* Habitat for fish and aquatic wildlife;* River flooding and erosion; and* Stormwater drainage systems.The preferred candidate will be:* Enrolled in an environmental studies or science program* Comfortable working in water, during inclement weather and from boats and rafts.* Familiar with computer programs (Microsoft Suite and GIS)* Familiar with water quality parameters and stream habitat needsIdeally the intern would start in May or June (depending on student availability), and work 10-12 weeks. Rate of pay is determined by the number of full academic years the applicant has completed at an accredited college or university by the beginning of the internship. Candidates must be majoring in environmental science or studies, biology, planning, or a closely related four-year academic program.$17 per hour: Completion of two full academic years as required below$18 per hour: Completion of three or more academic years as required below.Job Duties    SNOHOMISH COUNTY INTERNSHIP PROGRAMSnohomish County supports internship programs that provide work experience for students in an accredited post-secondary institution that is related to their course of study. The internship program is designed so the student will have the opportunity to apply principles and theories learned in the classroom, gain new skills, explore a career path and be supervised and mentored by a professional in their field.The student may choose to receive scholastic credit for their internship in accordance with the guidelines set by their school.BASIC FUNCTIONTo perform a variety of support activities in the areas of surface water management. Interns will perform tasks under the direct supervision and assistance of Surface Water Management staff.STATEMENT OF ESSENTIAL INTERNSHIP DUTIES1. Interns may be required to perform one or more of the following job duties:2. Assists with Surface Water Management projects and programs.3. Assists with project assessment and monitoring activities.4. Assists with public outreach at public meetings, fairs and festivals.5. Assists with coordination of volunteer activities for protecting water quality and restoring salmon habitat.6. Assists with data management.7. Performs related duties as required.Minimum Qualifications    Must be able to show proof of enrollment in an accredited post-secondary institution at the time of the Internship. If the Internship occurs during the summer, the student may provide proof of summer or fall enrollment.Have completed two full academic years of studies at an accredited college or university by the beginning of the internship and be majoring in or have completed coursework in any of the following programs: environmental sciences/studies, civil engineering, watershed or water resource management, water quality, biology, chemistry, ecology, limnology, forestry, agriculture, botany, plant ecology, horticulture, environmental health, toxicology, environmental planning, geology, geomorphology, geography, GIS, communications, environmental education, marketing, or related field.SPECIAL REQUIREMENTSA valid Washington State Driver's License is requiredAdditional Information    KNOWLEDGE AND ABILITIESIncrease Intern Knowledge of:* elementary principles and practices of surface water management as related to area of assignment;* elementary research and data collection techniques;* use of personal computers and related software.Increase Intern Ability to:* communicate effectively, both orally and in writing in a multicultural workforce serving a diverse population;* work effectively with a cross-section of watershed residents, businesses, specific interest groups and agencies;* gather, evaluate and document technical data;* apply technical data to practical in-field problems.SUPERVISIONThe intern is trained and mentored by an administrative superior as assigned. The work is performed with a moderate degree of independence and is reviewed through conferences, periodic reports and results obtained.WORKING CONDITIONSThe work is performed in a regular office environment with some work performed outdoors in all types of weather conditions. The intern may be required to lift, move and carry objects between 20 and 50 pounds, crouch, crawl, kneel, bend, climb and balance. The intern may be required to work along the water's edge, wade in streams, or work on the water in a boat. The intern may be required to work evenings, weekends and holidays as necessary.Snohomish County is an Equal Employment Opportunity (EEO) employer.Accommodations for individuals with disabilities are provided upon request.EEO policy and ADA noticeSnohomish County offers a comprehensive benefits package to employees that receive a regular appointment who work at least 20 hours a week.Visit www.snohomishcountywa.gov/Benefits to learn more about the following benefits.County Benefits* Medical Insurance* Vision Insurance* Dental Insurance* Retirement* Basic Group Term Life Insurance/ Accidental Death and Dismemberment (AD&D) Insurance* Long Term Disability (LTD)* Commuting Benefits* Employee Assistance Program (EAP)* Partners for Health Employee Wellness Program* Leave & HolidaysVoluntary Benefits* Deferred Compensation 457(b)* Supplemental Group Term Life Insurance* Additional Accidental Death and Dismemberment Insurance (AD&D)* Flexible Spending Accounts (FSA)* Supplemental Individual Insurance PoliciesHealthcare Premiums* Regular full-time employees: If you work 35 or more hours per week, you will pay these monthly premiums for medical insurance. The County pays the monthly premiums for vision, dental, and basic life insurance.* Regular part-time employees: If you work between 20 and 34 hours per week, you will pay pro-rated monthly premiums for medical, dental, vision, and basic life insurance. The County's contribution toward the premium for an employee in a regular part-time appointment will be pro-rated in an amount equal to the F.T.E. percentage the employee is assigned.Note: Temporary employees, seasonal employees and paid interns may be eligible for medical insurance benefits. Review the County's ACA Employer Shared Responsibility Guide to learn more.01Following are a series of supplemental questions designed to assess your job related experience and qualifications. Please note that as part of the screening process your responses will be reviewed in conjunction with your general online application. The employment history and education detailed in your general application must validate/support your responses to the supplemental questions. If your responses cannot be validated, you will not proceed to the next steps of the review/selection process.A resume may be submitted, but it will not substitute for the general online application or supplemental questions; responses such as \"see resume\" or \"see application\" will not be considered.Do you agree to answer each question truthfully and that your responses can be supported by your general application/work history and by your references?* Yes* No02Do you have a valid Washington State Driver's License or the ability to obtain one within thirty (30) days of employment?* Yes, I have a valid Washington State Driver's License* No, but I have the ability to obtain one within thirty (30) days of employment* No, I do not have the ability to obtain one03Do you understand you may be asked to provide copies of your credentials, including transcripts and Driver's license?* Yes* No04What will your academic standing be as of June 2020? You will be asked to provide documentation to support your answer.* Not a current student (not eligible)* Freshman (not eligible)* S",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/oyb093Zdtgqian2qt7yZ"
    },
    {
        "position": "Cincinnati Intern",
        "description": "Application LinkAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work – all of your talents, passions, and priorities… all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You've come to the right place!JOB REQUISITIONCincinnati Intern - 2021LOCATIONCINCINNATIADDITIONAL LOCATIONJOB DESCRIPTIONAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work – all of your talents, passions, and priorities… all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You’ve come to the right place!POSITION HIGHLIGHTSInterns work with Protiviti’s clients, who are some of the world’s leading companies. As an Intern, you collaborate with the team to deliver client solutions for complex business problems that these organizations face. Experience tells us that no one competency is enough to solve today’s complex business problems. That’s why we focus on developing Interns with an understanding of our business, knowledge across solutions and industries, technical aptitude, and leadership qualities that will ensure their future success.Our culture is grounded in empowerment, teamwork, and problem-solving, and, at all career levels, we encourage innovation, seeking your ideas and insights. Our people care about one another; they coach and guide; and they help each member of our team be their very best.When you join our team, you will participate in a first-class onboarding program. You will also attend The Intern Challenge, an experiential learning course that will help you transition successfully into your role as an Intern.Protiviti’s Intern Program is an innovative experience designed to immerse you in our unique business and culture. Through our Intern Program, you will work across a variety of solutions and industries and engage in internal initiatives, all of which will fuel your curiosity, uncover hidden strengths, and prepare you for your career.With each project, you receive hands-on training in a nurturing environment and interact with leaders across our practice. Our Talent Managers will have lined up specific experiences that support career growth, your skills, and the needs of the business. A network of coaches will help you navigate challenges and celebrate milestones. There are opportunities to join committees, participate in employee network groups, enjoy social, civic, and networking activities, and build meaningful relationships across the firm and in the community.Meaningful onboarding. Impactful training. Foundational learning. These experiences define Protiviti’s award-winning Intern Program – a program that builds upon your skills and knowledge and enables you to thrive professionally.QUALIFICATIONSDegree: Bachelor’s, Master’s or MBA degree in a relevant discipline (e.g., Accounting, Computer Engineering, Computer Science, Data Sciences, Economics, Finance, Information Systems, Management, and MIS) Cumulative Minimum GPA: 3.0 overall, 3.0 majorVisa Status: All applicants applying for U.S. job openings need authorization to work in the United StatesGraduation Status: Must be within one year of graduation at time of internshipWHAT MAKES YOU SUCCESSFULWorking in teams, as well as independentlyBeing creative and analyticalPossessing excellent leadership, communication and interpersonal skillsDesiring to learn and a receptiveness to feedback and mentoringDisplaying an interest in finance, accounting, technology, and business operationsARE YOU ON BOARD WITH TRAVEL?Since we work with clients, typically at their sites, this position requires travel to client sites. Out-of-town travel may also be required. Interns need reliable transportation to and from local client sites.COMPANY OVERVIEWProtiviti is a global consulting firm that delivers deep expertise, objective insights, a tailored approach and unparalleled collaboration to help leaders confidently face the future. Our consulting solutions span critical business problems in technology, business process, analytics, risk, compliance, transactions and internal audit. We are committed to attracting and developing a diverse workforce of professionals who share the common value of collaboration. As an organization, we believe that by teaming together and with our clients, we can see beyond the surface of problems that organizations face and discover opportunities to help them face the future with confidence.Our more than 4,500 people serve clients through the network of Protiviti and independently owned Member Firms in more than 70 offices in over 20 countries. We have served over 60% of FORTUNE 1000® companies and 35% of FORTUNE Global 500® companies. Our people and organization have consistently been recognized by FORTUNE and Consulting Magazine as a best company to work for.APPLICATION PROCESSApply at www.protiviti.com/careers.Note: Students may apply for only one location. Duplicate applications will not be accepted.Protiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services.For all US & Canada Postings: You may submit your application materials online or call 1.888.556.7420 for additional ways to apply. Protiviti is an Equal Opportunity Employer. M/F/Disability/VeteranJOB LOCATIONOH CINCINNATI",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/BkZXImJDtooH05OxutiT"
    },
    {
        "position": "Regulatory Affairs Intern",
        "description": "Application LinkJob TitleRegulatory Affairs InternJob DescriptionIntern - Regulatory Affairs- Bothell, WA – Summer 2020We welcome individuals who are currently pursuing an undergraduate or graduate degree to join Philips as a Regulatory Affairs Intern in our Bothell, WA location for a 3-month long internship to play a role in creating our next generation of respiratory care products.In this role, you have the opportunity toWork within the Emergency Care and Resuscitation team in Bothell Washington for a 3-month appointment (summer 2020). The Regulatory Affairs Intern will work with the regulatory team to support international license renewals/updates and maintain regulatory files and tracking databases.You are responsible forCreate detailed written regulatory plans that can be used to target domestic and international shipment dates.Develop and prepare product registration submissions for the US, Canada, EU and select worldwide locations.Review and approve engineering changes, advertising, promotional items and labeling for regulatory compliance.Identify potential regulatory approvals risks based on changes in regulations, standards, country specific issues or other unique characteristics of the project.To succeed in this role, you should have the following skills and experienceWorking towards Bachelor’s degree or advanced degree, preferably in Regulatory Affairs and/or a science related field.General knowledge of medical device regulations (21CFR), FDA law, MDD, other global laws and regulations and standards, including ISO14971, IEC 60601 and related particular standards.Requires strong written, oral and interpersonal skillsMust be able to manage multiple tasks and perform with accuracy and a high attention to detailProficient computer skills in Microsoft Office.In return, we offer youSharpen your talents with new challenges in our dynamic organization. As a market-driven company, we’re used to listening to our customers & apply the same thinking to our employees. We offer a competitive salary, outstanding benefits and flexibility in a career with a positive and supportive atmosphere in which to develop your talents further.US work authorization is a precondition of employment. The company will not consider candidates who require sponsorship for a work-authorized visa.Company relocation benefits will not be provided for this position. Candidates need to live within the territory or within commuting distance to Bothell, WA.Why should you join Philips?Working at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum. Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways.To find out more about what it’s like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog. Once there, you can also learn about our recruitment process, or find answers to some of the frequently asked questions.It is the policy of Philips to provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to age, color, citizenship, disability or perceived disability, ethnicity, gender, gender identity or expression, genetic information, marital or domestic partner status, military or veteran status, national origin, pregnancy/childbirth, race, religion, sexual orientation, or any other category protected by federal, state and/or local laws. Philips is an equal employment opportunity and affirmative action employer Disability/Veteran.As an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance.ContactIf you forgot your password, you can click the Forgot Password button on the Sign In screen to reset it.If you have any other questions regarding the recruitment process please refer to our FAQs. In case of technical difficulties with the website, please send an email to careersite@philips.com.(Note: To ensure fairness and legal compliance in our recruitment processes, only technical issues will be monitored through the above inbox. Please do not submit resumes or applications to this email, as they will not be reviewed. Only applications received through the online application process will be considered.)",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/hM7PvReVvRhNsYZn5c7J"
    },
    {
        "position": "Indianapolis Intern",
        "description": "Application LinkAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work - all of your talents, passions, and priorities... all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You've come to the right place!JOB REQUISITIONIndianapolis Intern - 2021LOCATIONINDIANAPOLISADDITIONAL LOCATIONJOB DESCRIPTIONAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work - all of your talents, passions, and priorities... all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You've come to the right place!POSITION HIGHLIGHTSInterns work with Protiviti's clients, who are some of the world's leading companies. As an Intern, you collaborate with the team to deliver client solutions for complex business problems that these organizations face. Experience tells us that no one competency is enough to solve today's complex business problems. That's why we focus on developing Interns with an understanding of our business, knowledge across solutions and industries, technical aptitude, and leadership qualities that will ensure their future success.Our culture is grounded in empowerment, teamwork, and problem-solving, and, at all career levels, we encourage innovation, seeking your ideas and insights. Our people care about one another; they coach and guide; and they help each member of our team be their very best.When you join our team, you will participate in a first-class onboarding program. You will also attend The Intern Challenge, an experiential learning course that will help you transition successfully into your role as an Intern.Protiviti's Intern Program is an innovative experience designed to immerse you in our unique business and culture. Through our Intern Program, you will work across a variety of solutions and industries and engage in internal initiatives, all of which will fuel your curiosity, uncover hidden strengths, and prepare you for your career.With each project, you receive hands-on training in a nurturing environment and interact with leaders across our practice. Our Talent Managers will have lined up specific experiences that support career growth, your skills, and the needs of the business. A network of coaches will help you navigate challenges and celebrate milestones. There are opportunities to join committees, participate in employee network groups, enjoy social, civic, and networking activities, and build meaningful relationships across the firm and in the community.Meaningful onboarding. Impactful training. Foundational learning. These experiences define Protiviti's award-winning Intern Program - a program that builds upon your skills and knowledge and enables you to thrive professionally.QUALIFICATIONS+ Degree: Bachelor's, Master's or MBA degree in a relevant discipline (e.g., Accounting, Computer Engineering, Computer Science, Data Sciences, Economics, Finance, Information Systems, Management, and MIS)+ Cumulative Minimum GPA: 3.0 overall, 3.0 major+ Visa Status: All applicants applying for U.S. job openings need authorization to work in the United States+ Graduation Status: Must be within one year of graduation at time of internshipWHAT MAKES YOU SUCCESSFUL+ Working in teams, as well as independently+ Being creative and analytical+ Possessing excellent leadership, communication and interpersonal skills+ Desiring to learn and a receptiveness to feedback and mentoring+ Displaying an interest in finance, accounting, technology, and business operationsARE YOU ON BOARD WITH TRAVEL?Since we work with clients, typically at their sites, this position requires travel to client sites. Out-of-town travel may also be required. Interns need reliable transportation to and from local client sites.COMPANY OVERVIEWProtiviti is a global consulting firm that delivers deep expertise, objective insights, a tailored approach and unparalleled collaboration to help leaders confidently face the future. Our consulting solutions span critical business problems in technology, business process, analytics, risk, compliance, transactions and internal audit. We are committed to attracting and developing a diverse workforce of professionals who share the common value of collaboration. As an organization, we believe that by teaming together and with our clients, we can see beyond the surface of problems that organizations face and discover opportunities to help them face the future with confidence.Our more than 4,500 people serve clients through the network of Protiviti and independently owned Member Firms in more than 70 offices in over 20 countries. We have served over 60% of FORTUNE 1000? companies and 35% of FORTUNE Global 500? companies. Our people and organization have consistently been recognized by FORTUNE and Consulting Magazine as a best company to work for.APPLICATION PROCESSApply at www.protiviti.com/careers.Note: Students may apply for only one location. Duplicate applications will not be accepted.Protiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services.For all US & Canada Postings: You may submit your application materials online or call 1.888.556.7420 for additional ways to apply. Protiviti is an Equal Opportunity Employer. M/F/Disability/VeteranJOB LOCATIONIN INDIANAPOLISProtiviti is a global consulting firm that delivers deep expertise, objective insights, a tailored approach and unparalleled collaboration to help leaders confidently face the future. Protiviti and our independently owned Member Firms provide consulting solutions in finance, technology, operations, data, analytics, governance, risk and internal audit to our clients through our network of more than 70 offices in over 20 countries. For the third consecutive year, Protiviti was named to the Fortune 100 Best Companies to Work? for list.We have served more than 60 percent of Fortune 1000? and 35 percent of Fortune Global 500? companies. We also work with smaller, growing companies, including those looking to go public, as well as with government agencies. Protiviti is a wholly owned subsidiary of Robert Half (NYSE: RHI). Founded in 1948, Robert Half is a member of the S&P 500 index.",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/tuw9qd5kxi3hP367syNq"
    },
    {
        "position": "Chicago Intern",
        "description": "Application LinkAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work - all of your talents, passions, and priorities... all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You've come to the right place!JOB REQUISITIONChicago Intern- 2021LOCATIONCHICAGOADDITIONAL LOCATIONJOB DESCRIPTIONAt Protiviti, you make a positive impact on our clients, the company, and your community. We hire creative, curious people who like learning and growing every day. We fuel your curiosity with challenging work, talented colleagues and innovative learning resources. At every level of our team, we build leaders who have the ability to influence and achieve. We value inclusion and encourage you to bring your whole self to work - all of your talents, passions, and priorities... all of the things that make you who you are.Are you inspired to lead, learn, grow, and make a difference?You've come to the right place!POSITION HIGHLIGHTSInterns work with Protiviti's clients, who are some of the world's leading companies. As an Intern, you collaborate with the team to deliver client solutions for complex business problems that these organizations face. Experience tells us that no one competency is enough to solve today's complex business problems. That's why we focus on developing Interns with an understanding of our business, knowledge across solutions and industries, technical aptitude, and leadership qualities that will ensure their future success.Our culture is grounded in empowerment, teamwork, and problem-solving, and, at all career levels, we encourage innovation, seeking your ideas and insights. Our people care about one another; they coach and guide; and they help each member of our team be their very best.When you join our team, you will participate in a first-class onboarding program. You will also attend The Intern Challenge, an experiential learning course that will help you transition successfully into your role as an Intern.Protiviti's Intern Program is an innovative experience designed to immerse you in our unique business and culture. Through our Intern Program, you will work across a variety of solutions and industries and engage in internal initiatives, all of which will fuel your curiosity, uncover hidden strengths, and prepare you for your career.With each project, you receive hands-on training in a nurturing environment and interact with leaders across our practice. Our Talent Managers will have lined up specific experiences that support career growth, your skills, and the needs of the business. A network of coaches will help you navigate challenges and celebrate milestones. There are opportunities to join committees, participate in employee network groups, enjoy social, civic, and networking activities, and build meaningful relationships across the firm and in the community.Meaningful onboarding. Impactful training. Foundational learning. These experiences define Protiviti's award-winning Intern Program - a program that builds upon your skills and knowledge and enables you to thrive professionally.QUALIFICATIONS+ Degree: Bachelor's, Master's or MBA degree in a relevant discipline (e.g., Accounting, Computer Engineering, Computer Science, Data Sciences, Economics, Finance, Information Systems, Management, and MIS)+ Cumulative Minimum GPA: 3.0 overall, 3.0 major+ Visa Status: All applicants applying for U.S. job openings need authorization to work in the United States+ Graduation Status: Must be within one year of graduation at time of internshipWHAT MAKES YOU SUCCESSFUL+ Working in teams, as well as independently+ Being creative and analytical+ Possessing excellent leadership, communication and interpersonal skills+ Desiring to learn and a receptiveness to feedback and mentoring+ Displaying an interest in finance, accounting, technology, and business operationsARE YOU ON BOARD WITH TRAVEL?Since we work with clients, typically at their sites, this position requires travel to client sites. Out-of-town travel may also be required. Interns need reliable transportation to and from local client sites.COMPANY OVERVIEWProtiviti is a global consulting firm that delivers deep expertise, objective insights, a tailored approach and unparalleled collaboration to help leaders confidently face the future. Our consulting solutions span critical business problems in technology, business process, analytics, risk, compliance, transactions and internal audit. We are committed to attracting and developing a diverse workforce of professionals who share the common value of collaboration. As an organization, we believe that by teaming together and with our clients, we can see beyond the surface of problems that organizations face and discover opportunities to help them face the future with confidence.Our more than 4,500 people serve clients through the network of Protiviti and independently owned Member Firms in more than 70 offices in over 20 countries. We have served over 60% of FORTUNE 1000® companies and 35% of FORTUNE Global 500® companies. Our people and organization have consistently been recognized by FORTUNE and Consulting Magazine as a best company to work for.APPLICATION PROCESSApply at www.protiviti.com/careers.Note: Students may apply for only one location. Duplicate applications will not be accepted.Protiviti is not licensed or registered as a public accounting firm and does not issue opinions on financial statements or offer attestation services.For all US & Canada Postings: You may submit your application materials online or call 1.888.556.7420 for additional ways to apply. Protiviti is an Equal Opportunity Employer. M/F/Disability/VeteranJOB LOCATIONIL PRO CHICAGOProtiviti is a global consulting firm that delivers deep expertise, objective insights, a tailored approach and unparalleled collaboration to help leaders confidently face the future. Protiviti and our independently owned Member Firms provide consulting solutions in finance, technology, operations, data, analytics, governance, risk and internal audit to our clients through our network of more than 70 offices in over 20 countries. For the third consecutive year, Protiviti was named to the Fortune 100 Best Companies to Work® for list.We have served more than 60 percent of Fortune 1000® and 35 percent of Fortune Global 500® companies. We also work with smaller, growing companies, including those looking to go public, as well as with government agencies. Protiviti is a wholly owned subsidiary of Robert Half (NYSE: RHI). Founded in 1948, Robert Half is a member of the S&P 500 index.",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/VW5ON0VXMOSz1tpB562L"
    },
    {
        "position": "Practical Nursing Intern",
        "description": "Application LinkGreat Plains Tribal Chairmen's Health BoardJob OpeningsPractical Nursing InternshipOHC Nursing � Rapid City, South DakotaDepartment OHC NursingEmployment Type InternshipMinimum Experience Entry-levelJob Summary:Practical Nursing interns will participate in their directive study in order to gain the knowledge, skills, attitude, and integrity to provide safe, prudent, and patient-centered care. The purpose of this directive study is to prepare practical nursing interns for the National Council Licensure Examination for Practical Nursing (NCLEX-PN) in order to become successfully employed as an LPN.Essential Functions:* Follow safety guidelines and practice universal precautions at all times.* Develop ethical professionalism in the healthcare setting.* Learn to work as a team unit with others in both the nursing department and entire healthcare system.* Gain respect and empathy for patients, coworkers and members of the healthcare team.* Demonstrate professionalism by adhering to attendance, time management and organization.* Demonstrate willingness to learn practical nursing skills as required and outlined in their directive study.* Completes all activities and assignments as required and outlines in their directive study.* Organize a typical daily workload as a practical nurse.* Recognize and correct performance errors in order to increase practical nursing skills and abilities.* Accept instruction, constructive criticism, and offer suggestions for improvement.* Meet all requirements set forth by the Practical Nursing Programs curriculum.* Demonstrate a level of competency by the completion of directive study to be ready for employment as an entry level practical nurse.* Must comply with federal laws and regulations as required by the Health Insurance Portability and Accountability Act (HIPAA).* Performs related duties.Professional Behavior* Effectively plan and organize workload and schedule time to meet the demands of the position.* Work in a cooperative and professional manner with GPTCHB staff.* Treat Great Plains tribes and collaborators with dignity and respect.* Utilize effective verbal and written communication skills.* Abide by the GPTCHB policies, procedures, and structure.* Adhere to safety guidelines, use proper nursing techniques.* Advance personal educational development by attending training sessions and seminars as appropriate.Requirements* Exemplify excellent customer service with tribal stakeholders, health board colleagues, program partners, service recipients, visitors and guests.* Foster a work environment of wellness, courtesy, friendliness, helpfulness and respect.* Relate well and work collaboratively with coworkers and all levels of staff in a professional manner.* Consistently demonstrate respect for and acceptance of differing capabilities, cultures, gender, age, sexual orientation and/or personalities.* Maintain and ensure organizational privacy and confidentiality.* Must be able to handle crisis and tolerate stress professionally.* Proficiency with computer programs (Word, Excel, PowerPoint) and other Internet technologies.* Valid drivers license must be kept current, and certificates, credentials or licenses must be kept current and consistent with regulations required by applicable federal, state and/or grant regulations.* Ability to promote an alcohol-, tobacco- and drug-free lifestyle.* Embrace modes of appearance and attire that reflect a professional presence.* Adhere to GPTCHB policies and procedures.Work Environment/Physical DemandsThe work is typically performed standing or sitting. The work is typically performed in a clinic setting which requires normal safety precaution for infection control and environmental safety measures. The work environment is usually noisy.While performing the duties of this job, the employee is regularly required to stand and sit, talk, and hear. The employee is frequently required to reach with hands and arms. The employee is occasionally required to walk and stoop, kneel, or crouch. The employee must regularly lift and/or move light objects, and occasional lift heavier objects.  Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and ability to adjust focus.Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.Education/Experience/Certificates/Credentials* Must be an enrolled Practical Nursing student with a college, technical school, or university that has an active collaborative agreement with GPTCHB, Oyate Health Center.* Student must have successfully completed all Practical Nursing courses and be approved for clinical rotations.* Agree to and abide by the rules and regulations of the intern program and GPTCHB policies and procedures.* Must successfully pass a criminal and background check, and a pre-employment drug screen.NATIVE AMERICAN/AMERICAN INDIAN PREFERENCE IN HIRING WILL BE APPLIED AS DEFINED IN TITLE 25 USC 44-46 &474.Employment is contingent upon the outcome of all required criminal background checks.Apply for this PositionFirst NameLast NameEmailPhoneAddressCityStateAKALARASAZCACOCTDCDEFLFMGAGUHIIAIDILINKSKYLAMAMDMEMHMIMNMOMPMSMTNCNDNENHNJNMNVNYOHOKORPAPRPWRISCSDTNTXUTVAVIVTWAWIWVWYPostal/ZipCountryAfghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan �land Islands Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling Islands) Colombia Comoros Congo Congo, the Democratic Republic of the Cook Islands Costa Rica Cote D'Ivoire (Ivory Coast) Croatia (Hrvatska) Cuba Cura�ao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France France, Metropolitan French Guiana French Polynesia French Southern Territories French West Indies Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard and McDonald Islands Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea (North) Korea (South) Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territories Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Barth�lemy Saint Kitts and Nevis Saint Lucia Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka St. Helena St. Pierre and Miquelon Sudan Suriname Svalbard Swaziland Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay US Minor Outlying Islands Uzbekistan Vanuatu Vatican City State Venezuela Viet Nam Virgin Islands (British) Virgin Islands, U.S. Wallis and Futuna Islands Western Sahara Yemen Yugoslavia Zaire Zambia ZimbabweCover LetterNo file selectedResumeNo file selectedDate AvailableHighest Education ObtainedGED or Equivalent High School Some College College - Associates College - Bachelor of Arts College - Bachelor of Fine Arts College - Bachelor of Science College - Master of Arts College - Master of Fine Arts College - Master of Science College - Master of Business Administration College - Doctorate Medical Doctor OtherCollege/UniversityWho referred you for this position?References (Name, Company, and Contact Info)Tribal Affiliation (if any)Reservation (if any)Enrollment #/Blood QuantumWhat do you see as your strengths? What do you hope to improve upon?Your answers to the following four questions are entirely optional.This information will not be used as selection criteria. If you'd rather not share this information, feel free to select \"Decline to Answer\".GenderDecline to answer Male FemaleEthnicityDecline to answer American Indian or Alaska Native Asian Black or African American Hispanic or Latino Native Hawaiian or Other Pacific Islander Two or More Races WhiteDisabilityDecline to answer No, I don't have a disability Yes, I have a disability (or previousl",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/zjTHLezYdgEDVDHrGK8w"
    },
    {
        "position": "Web Developer Intern",
        "description": "Application LinkGEI a Way of LifeWhen you re doing what you love and working with great people, work becomes less like a job, and more like a way of life. Here at GEI Consultants, Inc. (GEI) we have been fostering growth and creativity for nearly 50 years. Our culture is one of collaboration and support. If you are passionate about your field, excited about learning, and constantly looking for ways to innovate, we d love to have you join the GEI family.Who are we?GEI Consultants, Inc. is an employee-owned, leading consulting engineering and environmental firm ranked #95 in the ENR top 500 (2019). We partner with hundreds of government, energy, industry and institutional clients, and have completed 50,000 project engagements throughout the United States, Canada, and more than 20 other countries. We are sought out for our ideas, our creativity, and most of all, for the quality and character of our people.Job DescriptionThe Web Developer is responsible for the development and design of database driven web applications, GIS based web applications, GIS mapping applications, and components for clients. The developer will design, develop, test, and deliver web sites, applications, and components. The developer will create web applications and components from the requirements analysis, through design, coding, and testing, to production. Adaptability and ability to learn quickly in various technical and creative environments while delivering quality work under tight deadlines are key attributes of the job.Minimum QualificationsPractical experience in HTML, JavaScript, CSS and AJAX for web developmentProficient in some of the following: Java, JSP, ASP.NET, XML, and JSONKnowledge of database including Oracle, Access, or SQL serverExperience in providing high quality deliverables on timeSelf motivated, detail-oriented, and organizedMajor in computer-related field (computer science/engineering)Physical Job RequirementsSedentaryXLightMediumOtherActivity Level Throughout WorkdayPhysical Activity RequirementsOccasional(0-35% of day)Frequent(33-66% of day)Continuous(67-100% of day)Not ApplicableSitting XStandingXWalkingXClimbingXLifting (floor to waist level) (in pounds)0-25 lbsLifting (waist level and above) (in pounds)0-25 lbsCarrying objectsXPush/pullXTwistingXBending XReaching forward XReaching overhead XSquat/kneel/crawlXWrist position deviationXPinching/fine motor skillsXKeyboard use/repetitive motionXTaste or smell (taste=never)XTalk or hearXXAccurate 20/40Very Accurate 20/20Not ApplicableNear VisionXFar VisionXYesNoNot ApplicableColor Vision (ability to identify and distinguish colors)XSensory RequirementsMinimalModerateAccurateNot ApplicableDepth perceptionXHearingXEnvironmental RequirementsOccupational Exposure Risk PotentialReasonably AnticipatedNot AnticipatedBlood borne pathogensXChemicalXAirborne communicable diseasesXExtreme temperaturesXRadiationXUneven surfaces or elevationsXExtreme noise levelsXDust/particular matterXOther (exposure risk):Usual workday hours:X81012Other work hoursGEI is an EEO/AA/M/F/Vet/Disability employer",
        "currentURL": "https://app.studentopportunitycenter.com/app/search/6quYK4g3Ucfut9YpqTCh"
    }
]